readme.org
#+TITLE: Redes Neuronales Artificiales
#+AUTHOR: Eduardo Alcaraz
#+LANGUAGE: es
#+LaTeX_HEADER: \usepackage[spanish]{inputenc}
#+SETUPFILE: /home/likcos/Dropbox/org/cursos/redesneuronales/theme-readtheorg-local.setup
#+EXPORT_FILE_NAME: index.html
#+OPTIONS: num:nil
#+OPTIONS: tex:mathjax
#+HTML_HEAD: <style> #content{max-width:1800px;}</style>
#+HTML_HEAD: <style>pre.src {background-color: #303030; color: #e5e5e5;}</style>




* Presentación del Curso
** Objetivo general
  Este curso tiene como objetivo proporcionar una
  comprensión *profunda y progresiva* de las redes neuronales
  artificiales, desde sus fundamentos teóricos hasta las principales
  arquitecturas modernas utilizadas en la industria y la
  investigación.


- Fundamentos matemáticos y conceptuales
- Funcionamiento interno de una red neuronal
- Entrenamiento y optimización
- Arquitecturas principales
- Intuición práctica y casos de uso



* Instalación de requerimientos

