index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="es" xml:lang="es">
<head>
<!-- 2026-01-20 mar 12:01 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Redes Neuronales Artificiales</title>
<meta name="author" content="Eduardo Alcaraz" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/readtheorg.css"/>

</head>
<body>
<div id="content" class="content">
<h1 class="title">Redes Neuronales Artificiales</h1>
<div id="table-of-contents" role="doc-toc">
<h2>&Iacute;ndice</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org7015bef">Presentación del Curso</a>
<ul>
<li><a href="#org55bcfc6">Objetivo general</a></li>
</ul>
</li>
<li><a href="#orgd7913fc">Instalación de requerimientos</a>
<ul>
<li><a href="#org2908672">Verificación de Python</a></li>
<li><a href="#orgd19dad3">Creación del entorno virtual</a></li>
<li><a href="#org59856e4">Activación del entorno virtual</a>
<ul>
<li><a href="#org8d63460">GNU/Linux y macOS</a></li>
<li><a href="#orgd83f74e">Windows – Símbolo del sistema (CMD)</a></li>
<li><a href="#org930287a">Windows – PowerShell</a></li>
<li><a href="#org6a8d374">Windows – Git Bash</a></li>
</ul>
</li>
<li><a href="#org33d747b">Actualización del gestor de paquetes</a></li>
<li><a href="#org6585e96">Instalación de dependencias</a></li>
<li><a href="#org937286a">Verificación de la instalación</a></li>
<li><a href="#org5b8a8b6">Desactivación del entorno virtual</a></li>
</ul>
</li>
<li><a href="#org60db9a4">Manual de Entornos Virtuales en Python</a>
<ul>
<li><a href="#orga33fe24">Introducción</a></li>
<li><a href="#orge7daa4a">Flujo de Trabajo Básico</a>
<ul>
<li><a href="#org9c59411">1. Creación del entorno</a></li>
<li><a href="#orge6288f5">2. Activación</a></li>
</ul>
</li>
<li><a href="#org35a2d0a">Gestión de paquetes</a></li>
<li><a href="#org0d2e26d">El archivo de Requerimientos</a></li>
<li><a href="#org59b2408">Exportar dependencias</a></li>
<li><a href="#org6210df1">Instalar desde el archivo</a></li>
<li><a href="#org1fe0104">Tips de Limpieza</a></li>
<li><a href="#org905da8c">Entornos Virtuales Python (Edición Windows)</a></li>
<li><a href="#orgcbacff7">Requisitos Previos</a></li>
<li><a href="#org6df5084">Flujo de Trabajo en Windows</a>
<ul>
<li><a href="#org1ecaf66">1. Crear el Entorno Virtual</a></li>
<li><a href="#org2d2fd9a">2. El Paso Crítico: La Activación</a></li>
<li><a href="#orgb732b51">3. Confirmación</a></li>
</ul>
</li>
<li><a href="#orgd972244">Gestión de Librerías con PIP</a>
<ul>
<li><a href="#org263d455">Instalación de paquetes</a></li>
<li><a href="#org9c377df">Congelar dependencias (Compartir proyecto)</a></li>
<li><a href="#orgd16c0b9">Instalar desde un archivo recibido</a></li>
</ul>
</li>
<li><a href="#org2d128bc">Uso de Entornos en Emacs (Windows)</a>
<ul>
<li><a href="#org59b2eff">Instalación del paquete pyvenv</a></li>
<li><a href="#orgb30adea">Cómo activarlo dentro de Emacs</a></li>
</ul>
</li>
<li><a href="#org7867558">Solución de Problemas Comunes en Windows</a></li>
<li><a href="#orgdffce91">Desactivación y Limpieza</a></li>
<li><a href="#org8c3ad50">Agregar a jupyter notebook</a></li>
</ul>
</li>
<li><a href="#org9e59490">Introducción a la Inteligencia Artificial (IA)</a>
<ul>
<li><a href="#orge8abd65">Definición formal</a></li>
<li><a href="#orgc0d06be">IA débil vs IA fuerte</a></li>
</ul>
</li>
<li><a href="#org2ec9534">Machine Learning (Aprendizaje Automático)</a>
<ul>
<li><a href="#org538a1c5">Tipos de aprendizaje</a></li>
</ul>
</li>
<li><a href="#org1e9a825">Historia de las Redes Neuronales</a>
<ul>
<li><a href="#org41a039a">Contexto histórico</a></li>
<li><a href="#orgb7d7519">McCulloch y Pitts (1943)</a></li>
<li><a href="#orgc88900d">Perceptrón y optimismo inicial</a></li>
<li><a href="#org6abfff8">Críticas y estancamiento</a></li>
<li><a href="#orge9f6364">Renacimiento moderno</a></li>
</ul>
</li>
<li><a href="#orge1d3add">La Neurona Artificial</a>
<ul>
<li><a href="#orgce9ef15">Motivación</a></li>
<li><a href="#org735c33c">Componentes</a></li>
<li><a href="#org76dccc7">Modelo matemático</a></li>
</ul>
</li>
<li><a href="#org25a374b">El Perceptrón</a>
<ul>
<li><a href="#org4efaf09">Definición</a></li>
<li><a href="#orgdb2daa7">Interpretación geométrica</a></li>
<li><a href="#org07749df">Aprendizaje</a></li>
<li><a href="#org2e136e0">Limitaciones</a></li>
</ul>
</li>
<li><a href="#orgd2b29db">¿Qué es un problema linealmente separable?</a>
<ul>
<li><a href="#org1f2a355">Intuición básica</a></li>
</ul>
</li>
<li><a href="#orgcdb5810">Estructura de un Perceptrón Simple</a>
<ul>
<li><a href="#org19a7b23">Entradas (Inputs)</a></li>
<li><a href="#org95535b6">Pesos Sinápticos (Weights)</a></li>
<li><a href="#org5ba5f1e">Suma Ponderada (Weighted Sum)</a></li>
<li><a href="#org07f09c8">Sesgo (Bias)</a></li>
<li><a href="#org798af64">Función de Activación</a></li>
<li><a href="#orgb4270fd">Salida (Output)</a></li>
</ul>
</li>
<li><a href="#org28e2f60">Ejemplo Tacos</a>
<ul>
<li><a href="#org1b5db83">1. El Escenario: La Decisión de la Cena</a>
<ul>
<li><a href="#org99e45c3">Nuestras Entradas (Inputs)</a></li>
<li><a href="#org011770f">El Peso (Weight): La Importancia</a></li>
</ul>
</li>
<li><a href="#org439258c">2. ¿Cómo toma la decisión? (La Suma y el Sesgo)</a>
<ul>
<li><a href="#orgc337946">El Sesgo (Bias)</a></li>
</ul>
</li>
<li><a href="#orgcf36728">3. El Descenso del Gradiente: ¿Cómo "Aprende" la Neurona?</a>
<ul>
<li><a href="#org0263ebd">El Error: La Brújula</a></li>
<li><a href="#orgdd207dc">El Ajuste (La Regla Delta)</a></li>
</ul>
</li>
<li><a href="#org452c07a">Perceptrón ejemplo (Python)</a>
<ul>
<li><a href="#org1cbff08">Perceptrón para una compuerta "AND"</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgc08eba2">Codigo C python</a></li>
<li><a href="#org87de320">Redes Neuronales Multicapa (Multilayer Perceptron)</a>
<ul>
<li><a href="#orgf04393b">Introducción</a></li>
<li><a href="#orgfa9d43f">Modelo matemático</a>
<ul>
<li><a href="#orgd9d565a">Neurona individual</a></li>
<li><a href="#org3abb12f">Forma matricial de una capa</a></li>
</ul>
</li>
<li><a href="#org670f5f4">Funciones de activación</a>
<ul>
<li><a href="#org8ecb0d2">¿Para qué sirven las funciones de activación?</a></li>
</ul>
</li>
<li><a href="#orgae9e0eb">Clasificación de las funciones de activación</a>
<ul>
<li><a href="#orgbf074db">Funciones de activación clásicas</a></li>
<li><a href="#orgaf0135f">Funciones de activación modernas</a></li>
<li><a href="#orgff27281">Funciones de activación en la capa de salida</a></li>
<li><a href="#org6f63e25">Impacto en el entrenamiento</a></li>
</ul>
</li>
<li><a href="#orgf0b7f33">Propagación hacia adelante (Forward Propagation)</a></li>
<li><a href="#orge935b49">Funciones de pérdida</a>
<ul>
<li><a href="#org7a0dcbd">Error cuadrático medio (MSE)</a></li>
<li><a href="#org444ae6c">Entropía cruzada (Cross-Entropy)</a></li>
</ul>
</li>
<li><a href="#org8475fcb">Backpropagation</a></li>
<li><a href="#orgcfa3523">Descenso de gradiente</a></li>
</ul>
</li>
<li><a href="#orga982b53">Ejemplo Clasificación del dataset Iris con MLP</a>
<ul>
<li><a href="#org9025bea">Reproducibilidad del experimento</a></li>
<li><a href="#orga02ff76">Estratificación de clases</a></li>
<li><a href="#orgea407f1">Importancia en redes neuronales</a></li>
<li><a href="#org9e61ba4">Normalización de los datos</a></li>
<li><a href="#org6433828">Definir el Perceptrón Multicapa (MLP)</a>
<ul>
<li><a href="#org3730d02">Arquitectura de la red neuronal</a></li>
<li><a href="#orgb5fb5e7">Capa de entrada</a></li>
<li><a href="#org63eaffa">Capas ocultas</a></li>
<li><a href="#org22e573d">Función de activación</a></li>
<li><a href="#org0e249b3">Capa de salida</a></li>
<li><a href="#org828ab5a">Entrenamiento del modelo</a></li>
</ul>
</li>
<li><a href="#orge103146">Número de iteraciones</a></li>
<li><a href="#orge20e603">Reproducibilidad</a></li>
<li><a href="#org6e589ec">Entrenamiento del modelo</a>
<ul>
<li><a href="#org7fec327">Propagación hacia adelante (forward pass)</a></li>
<li><a href="#org28b16b6">Cálculo del error</a></li>
<li><a href="#orgcec415a">Backpropagation</a></li>
<li><a href="#org0baa450">Descenso de gradiente con Adam</a></li>
</ul>
</li>
<li><a href="#org121ba4e">Evaluación del modelo</a>
<ul>
<li><a href="#org43e7442">Métricas utilizadas</a></li>
</ul>
</li>
<li><a href="#org7842ef7">Predicción con una nueva flor</a></li>
<li><a href="#org6c53864">Interpretación matemática del MLP</a></li>
</ul>
</li>
<li><a href="#org301fabc">Ejemplo Clasificación de Cáncer de Mama con MLP</a>
<ul>
<li><a href="#org5462d3d">Importar librerías</a></li>
<li><a href="#org807d152">Cargar el dataset Breast Cancer</a>
<ul>
<li><a href="#org01fd31f">Importancia del dominio</a></li>
</ul>
</li>
<li><a href="#orgcb899b9">Partición del conjunto de datos</a>
<ul>
<li><a href="#orgfd2a90d">Significado de los parámetros</a></li>
<li><a href="#orgf8e5d55">Propósito de la partición</a></li>
</ul>
</li>
<li><a href="#org387d5ce">Normalización (Estandarización)</a>
<ul>
<li><a href="#org9d1cac6">Importante</a></li>
</ul>
</li>
<li><a href="#org1aff302">Definición del Perceptrón Multicapa (MLP)</a>
<ul>
<li><a href="#org5d317ee">Arquitectura del modelo</a></li>
<li><a href="#org7269d85">Función de activación ReLU</a></li>
<li><a href="#org3d3fc36">Optimizador Adam</a></li>
<li><a href="#orgf9cbc31">Número máximo de iteraciones</a></li>
<li><a href="#org394ef21">Reproducibilidad</a></li>
</ul>
</li>
<li><a href="#orgb9a0145">Entrenamiento del modelo</a>
<ul>
<li><a href="#orgfaf18f7">Proceso interno (visión conceptual)</a></li>
</ul>
</li>
<li><a href="#org145d8c8">Evaluación del modelo</a>
<ul>
<li><a href="#org629df3e">Métricas principales</a></li>
</ul>
</li>
<li><a href="#orgf110795">Interpretación matemática de la salida binaria</a></li>
<li><a href="#org8cf5958">Predicción de una nueva muestra</a>
<ul>
<li><a href="#orgb7cbcbf">Comentarios importantes</a></li>
</ul>
</li>
<li><a href="#orgd775baa">Resumen conceptual</a></li>
</ul>
</li>
<li><a href="#org65b2102">Redes Neuronales LSTM (Long Short-Term Memory)</a>
<ul>
<li><a href="#orgedd8f1f">Estructura general de una RNN</a>
<ul>
<li><a href="#org56bc796">Problema: vanishing y exploding gradients</a></li>
</ul>
</li>
<li><a href="#org733e479">Motivación de las LSTM</a></li>
<li><a href="#orgea859ac">Arquitectura interna de una celda LSTM</a>
<ul>
<li><a href="#org9a47d58">Ecuaciones de la LSTM</a></li>
<li><a href="#org35be279">Interpretación de las puertas</a></li>
</ul>
</li>
<li><a href="#orgac392d3">Intuición conceptual</a></li>
<li><a href="#org4934aae">Entrenamiento de una LSTM</a></li>
<li><a href="#org6d42adf">Tipos de tareas típicas con LSTM</a></li>
<li><a href="#org25992bb">Variantes y extensiones de LSTM</a></li>
<li><a href="#org54b1845">Implementación básica en Python (Keras)</a></li>
<li><a href="#org04b2937">Ventajas y limitaciones de LSTM</a>
<ul>
<li><a href="#orgf7b42e6">Ventajas</a></li>
<li><a href="#org6ed38ed">Limitaciones</a></li>
</ul>
</li>
<li><a href="#orgb90b09c">Conclusión</a></li>
</ul>
</li>
<li><a href="#org24358f0">Ejemplo Clasificación del dataset Iris con una red LSTM</a>
<ul>
<li><a href="#org98267e0">Importar librerías</a></li>
<li><a href="#org2347246">Cargar el dataset Iris</a></li>
<li><a href="#orgb69b738">Partición entrenamiento / prueba</a>
<ul>
<li><a href="#org70ba70b">Propósito de la partición</a></li>
<li><a href="#org28a6d1e">Parámetro test<sub>size</sub></a></li>
<li><a href="#org4596a3f">Reproducibilidad del experimento</a></li>
<li><a href="#org371bdbe">Estratificación de clases</a></li>
</ul>
</li>
<li><a href="#orgea57be5">Normalización de los datos</a></li>
<li><a href="#orgbb3f71f">Preparar los datos para LSTM</a></li>
<li><a href="#orgc5f326b">Definir la red LSTM</a>
<ul>
<li><a href="#org8c6df01">Arquitectura de la red</a></li>
</ul>
</li>
<li><a href="#org633b9e9">Compilación del modelo</a></li>
<li><a href="#org5871aca">Entrenamiento del modelo LSTM</a>
<ul>
<li><a href="#orgf67a0b1">Propagación hacia adelante (forward pass)</a></li>
<li><a href="#org33f7fe5">Cálculo del error</a></li>
<li><a href="#org6f85fbd">Backpropagation Through Time (BPTT)</a></li>
<li><a href="#orgd5fb814">Descenso de gradiente con Adam</a></li>
</ul>
</li>
<li><a href="#orga44f5b8">Evaluación del modelo</a>
<ul>
<li><a href="#orgc6f9d34">Métricas utilizadas</a></li>
</ul>
</li>
<li><a href="#orgcadf24e">Predicción con una nueva flor</a></li>
<li><a href="#orgfcd1968">Interpretación matemática básica de la LSTM</a></li>
</ul>
</li>
<li><a href="#org8a82987">Bibliografía  Deep Learning</a>
<ul>
<li><a href="#org3c076f8">Teórica y Académica&#xa0;&#xa0;&#xa0;<span class="tag"><span class="MATEMATICAS">MATEMATICAS</span>&#xa0;<span class="FUNDAMENTOS">FUNDAMENTOS</span></span></a>
<ul>
<li><a href="#org1a1484a">Deep Learning</a></li>
<li><a href="#org654aaee">Neural Networks and Deep Learning: A Textbook</a></li>
</ul>
</li>
<li><a href="#org913b264">Práctica y Programación&#xa0;&#xa0;&#xa0;<span class="tag"><span class="PYTHON">PYTHON</span>&#xa0;<span class="PYTORCH">PYTORCH</span>&#xa0;<span class="KERAS">KERAS</span></span></a>
<ul>
<li><a href="#org8bb1bdb">Deep Learning with Python (3rd Edition)</a></li>
<li><a href="#org69f9d04">Hands-On Machine Learning with Scikit-Learn and PyTorch</a></li>
</ul>
</li>
<li><a href="#orgc8123ac">Aprendizaje "Desde Cero"&#xa0;&#xa0;&#xa0;<span class="tag"><span class="NUMPY">NUMPY</span>&#xa0;<span class="LOGICA">LOGICA</span></span></a>
<ul>
<li><a href="#org1eefb2e">Grokking Deep Learning</a></li>
<li><a href="#orgdae682c">Neural Networks from Scratch (NNFS)</a></li>
</ul>
</li>
<li><a href="#org590c047">Tabla Comparativa para Elección Rápida</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org7015bef" class="outline-2">
<h2 id="org7015bef">Presentación del Curso</h2>
<div class="outline-text-2" id="text-org7015bef">
</div>
<div id="outline-container-org55bcfc6" class="outline-3">
<h3 id="org55bcfc6">Objetivo general</h3>
<div class="outline-text-3" id="text-org55bcfc6">
<p>
Este curso tiene como objetivo proporcionar una
comprensión <b>profunda y progresiva</b> de las redes neuronales
artificiales, desde sus fundamentos teóricos hasta las principales
arquitecturas modernas utilizadas en la industria y la
investigación.
</p>


<ul class="org-ul">
<li>Fundamentos matemáticos y conceptuales</li>
<li>Funcionamiento interno de una red neuronal</li>
<li>Entrenamiento y optimización</li>
<li>Arquitecturas principales</li>
<li>Intuición práctica y casos de uso</li>
</ul>
</div>
</div>
</div>
