readme.org
** Verificación de Python
Antes de instalar las dependencias, verifique que el sistema cuente con Python
versión 3.9 o superior.

#+BEGIN_SRC bash
python --version
#+END_SRC

En caso de que el comando anterior no esté disponible, intente:

#+BEGIN_SRC bash
python3 --version
#+END_SRC

** Creación del entorno virtual
Se recomienda crear un entorno virtual para aislar las dependencias del proyecto
y evitar conflictos entre versiones de librerías.

#+BEGIN_SRC bash
python -m venv mlp_env
#+END_SRC

** Activación del entorno virtual

La activación del entorno virtual depende del sistema operativo y del intérprete
de comandos utilizado.

*** GNU/Linux y macOS
#+BEGIN_SRC bash
source mlp_env/bin/activate
#+END_SRC

*** Windows – Símbolo del sistema (CMD)
Si se utiliza el *Símbolo del sistema* (cmd.exe), ejecute:

#+BEGIN_SRC bat
mlp_env\Scripts\activate.bat
#+END_SRC

*** Windows – PowerShell
Si se utiliza *Windows PowerShell*, ejecute:

#+BEGIN_SRC powershell
mlp_env\Scripts\Activate.ps1
#+END_SRC

En caso de que la ejecución de scripts esté deshabilitada, habilítela
temporalmente con:

#+BEGIN_SRC powershell
Set-ExecutionPolicy -ExecutionPolicy RemoteSigned -Scope Process
#+END_SRC

Posteriormente, vuelva a ejecutar el comando de activación.

*** Windows – Git Bash
Si se utiliza *Git Bash*, ejecute:

#+BEGIN_SRC bash
source mlp_env/Scripts/activate
#+END_SRC

Una vez activado el entorno virtual, el nombre del entorno aparecerá entre
paréntesis al inicio de la línea de comandos.

** Actualización del gestor de paquetes
Antes de instalar las librerías, se recomienda actualizar el gestor de paquetes
=pip=.

#+BEGIN_SRC bash
pip install --upgrade pip
#+END_SRC

** Instalación de dependencias
Ejecute el siguiente comando para instalar los requerimientos del módulo
Perceptrón Multicapa *feedforward*.

#+BEGIN_SRC bash
pip install numpy matplotlib scikit-learn pygame
#+END_SRC

** Verificación de la instalación
Para verificar que las dependencias se instalaron correctamente, ejecute Python
en modo interactivo:

#+BEGIN_SRC bash
python
#+END_SRC

Posteriormente, importe las librerías:

#+BEGIN_SRC python
import numpy
import matplotlib
import sklearn
import pygame
print("Instalación de requerimientos completada correctamente")
#+END_SRC

** Desactivación del entorno virtual
Una vez finalizado el trabajo, el entorno virtual puede desactivarse con el
siguiente comando:

#+BEGIN_SRC bash
deactivate
#+END_SRC

* Manual de Entornos Virtuales en Python

** Introducción
El uso de entornos virtuales es esencial para mantener las
dependencias de tus proyectos aisladas. En este manual aprenderás a
gestionarlos usando el módulo estándar =venv=.

** Flujo de Trabajo Básico

*** 1. Creación del entorno
Para crear un entorno virtual, navega a la raíz de tu proyecto en la terminal (o dentro de un buffer de Emacs con =M-x shell=) y ejecuta:

#+begin_src bash
python -m venv .venv
#+end_src

*Nota:* El nombre =.venv= es una convención que hace que el directorio sea oculto en sistemas Unix.

*** 2. Activación
La activación depende de tu sistema operativo:

**** En Windows (PowerShell)
#+begin_src powershell
.\.venv\Scripts\Activate.ps1
#+end_src

**** En macOS / Linux
#+begin_src bash
source .venv/bin/activate
#+end_src

** Gestión de paquetes
Una vez activado (verás el prefijo =(.venv)= en tu prompt), puedes instalar librerías:

#+begin_src bash
pip install requests pandas
#+end_src


** El archivo de Requerimientos
Es fundamental para la reproducibilidad del proyecto.

** Exportar dependencias
#+begin_src bash
pip freeze > requirements.txt
#+end_src

** Instalar desde el archivo
#+begin_src bash
pip install -r requirements.txt
#+end_src

** Tips de Limpieza
Para salir del entorno virtual:
#+begin_src bash
deactivate
#+end_src

Para borrar el entorno, simplemente elimina la carpeta:
#+begin_src bash
rm -rf .venv  # En Linux/macOS
rmdir /s /q .venv  # En Windows
#+end_src

---
#+BEGIN_QUOTE
"Keep your global Python clean, keep your projects isolated."
#+END_QUOTE




** Entornos Virtuales Python (Edición Windows)

** Requisitos Previos
1. Tener instalado Python (descargado de [[https://www.python.org/][python.org]] o la Microsoft Store).
2. Durante la instalación, asegúrate de marcar la casilla: **"Add Python to PATH"**.

** Flujo de Trabajo en Windows

*** 1. Crear el Entorno Virtual
Abre tu terminal (PowerShell o CMD) en la carpeta de tu proyecto. El comando es el mismo para ambos:

#+begin_src powershell
python -m venv venv
#+end_src

*** 2. El Paso Crítico: La Activación
En Windows, la activación depende de qué terminal estés usando.

