index.html
<div id="outline-container-orgd7913fc" class="outline-2">
<h2 id="orgd7913fc">Instalación de requerimientos</h2>
<div class="outline-text-2" id="text-orgd7913fc">
</div>
<div id="outline-container-org2908672" class="outline-3">
<h3 id="org2908672">Verificación de Python</h3>
<div class="outline-text-3" id="text-org2908672">
<p>
Antes de instalar las dependencias, verifique que el sistema cuente con Python
versión 3.9 o superior.
</p>

<div class="org-src-container">
<pre class="src src-bash">python --version
</pre>
</div>

<p>
En caso de que el comando anterior no esté disponible, intente:
</p>

<div class="org-src-container">
<pre class="src src-bash">python3 --version
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd19dad3" class="outline-3">
<h3 id="orgd19dad3">Creación del entorno virtual</h3>
<div class="outline-text-3" id="text-orgd19dad3">
<p>
Se recomienda crear un entorno virtual para aislar las dependencias del proyecto
y evitar conflictos entre versiones de librerías.
</p>

<div class="org-src-container">
<pre class="src src-bash">python -m venv mlp_env
</pre>
</div>
</div>
</div>
<div id="outline-container-org59856e4" class="outline-3">
<h3 id="org59856e4">Activación del entorno virtual</h3>
<div class="outline-text-3" id="text-org59856e4">
<p>
La activación del entorno virtual depende del sistema operativo y del intérprete
de comandos utilizado.
</p>
</div>
<div id="outline-container-org8d63460" class="outline-4">
<h4 id="org8d63460">GNU/Linux y macOS</h4>
<div class="outline-text-4" id="text-org8d63460">
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #483d8b;">source</span> mlp_env/bin/activate
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd83f74e" class="outline-4">
<h4 id="orgd83f74e">Windows – Símbolo del sistema (CMD)</h4>
<div class="outline-text-4" id="text-orgd83f74e">
<p>
Si se utiliza el <b>Símbolo del sistema</b> (cmd.exe), ejecute:
</p>

<div class="org-src-container">
<pre class="src src-bat">mlp_env\Scripts\activate.bat
</pre>
</div>
</div>
</div>
<div id="outline-container-org930287a" class="outline-4">
<h4 id="org930287a">Windows – PowerShell</h4>
<div class="outline-text-4" id="text-org930287a">
<p>
Si se utiliza <b>Windows PowerShell</b>, ejecute:
</p>

<div class="org-src-container">
<pre class="src src-powershell">mlp_env\Scripts\Activate.ps1
</pre>
</div>

<p>
En caso de que la ejecución de scripts esté deshabilitada, habilítela
temporalmente con:
</p>

<div class="org-src-container">
<pre class="src src-powershell">Set-ExecutionPolicy -ExecutionPolicy RemoteSigned -Scope Process
</pre>
</div>

<p>
Posteriormente, vuelva a ejecutar el comando de activación.
</p>
</div>
</div>
<div id="outline-container-org6a8d374" class="outline-4">
<h4 id="org6a8d374">Windows – Git Bash</h4>
<div class="outline-text-4" id="text-org6a8d374">
<p>
Si se utiliza <b>Git Bash</b>, ejecute:
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #483d8b;">source</span> mlp_env/Scripts/activate
</pre>
</div>

<p>
Una vez activado el entorno virtual, el nombre del entorno aparecerá entre
paréntesis al inicio de la línea de comandos.
</p>
</div>
</div>
</div>
<div id="outline-container-org33d747b" class="outline-3">
<h3 id="org33d747b">Actualización del gestor de paquetes</h3>
<div class="outline-text-3" id="text-org33d747b">
<p>
Antes de instalar las librerías, se recomienda actualizar el gestor de paquetes
<code>pip</code>.
</p>

<div class="org-src-container">
<pre class="src src-bash">pip install --upgrade pip
</pre>
</div>
</div>
</div>
<div id="outline-container-org6585e96" class="outline-3">
<h3 id="org6585e96">Instalación de dependencias</h3>
<div class="outline-text-3" id="text-org6585e96">
<p>
Ejecute el siguiente comando para instalar los requerimientos del módulo
Perceptrón Multicapa <b>feedforward</b>.
</p>

<div class="org-src-container">
<pre class="src src-bash">pip install numpy matplotlib scikit-learn pygame
</pre>
</div>
</div>
</div>
<div id="outline-container-org937286a" class="outline-3">
<h3 id="org937286a">Verificación de la instalación</h3>
<div class="outline-text-3" id="text-org937286a">
<p>
Para verificar que las dependencias se instalaron correctamente, ejecute Python
en modo interactivo:
</p>

<div class="org-src-container">
<pre class="src src-bash">python
</pre>
</div>

<p>
Posteriormente, importe las librerías:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a020f0;">import</span> numpy
<span style="color: #a020f0;">import</span> matplotlib
<span style="color: #a020f0;">import</span> sklearn
<span style="color: #a020f0;">import</span> pygame
<span style="color: #483d8b;">print</span><span style="color: #707183;">(</span><span style="color: #8b2252;">"Instalaci&#243;n de requerimientos completada correctamente"</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org5b8a8b6" class="outline-3">
<h3 id="org5b8a8b6">Desactivación del entorno virtual</h3>
<div class="outline-text-3" id="text-org5b8a8b6">
<p>
Una vez finalizado el trabajo, el entorno virtual puede desactivarse con el
siguiente comando:
</p>

<div class="org-src-container">
<pre class="src src-bash">deactivate
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org60db9a4" class="outline-2">
<h2 id="org60db9a4">Manual de Entornos Virtuales en Python</h2>
<div class="outline-text-2" id="text-org60db9a4">
</div>
<div id="outline-container-orga33fe24" class="outline-3">
<h3 id="orga33fe24">Introducción</h3>
<div class="outline-text-3" id="text-orga33fe24">
<p>
El uso de entornos virtuales es esencial para mantener las
dependencias de tus proyectos aisladas. En este manual aprenderás a
gestionarlos usando el módulo estándar <code>venv</code>.
</p>
</div>
</div>
<div id="outline-container-orge7daa4a" class="outline-3">
<h3 id="orge7daa4a">Flujo de Trabajo Básico</h3>
<div class="outline-text-3" id="text-orge7daa4a">
</div>
<div id="outline-container-org9c59411" class="outline-4">
<h4 id="org9c59411">1. Creación del entorno</h4>
<div class="outline-text-4" id="text-org9c59411">
<p>
Para crear un entorno virtual, navega a la raíz de tu proyecto en la terminal (o dentro de un buffer de Emacs con <code>M-x shell</code>) y ejecuta:
</p>

<div class="org-src-container">
<pre class="src src-bash">python -m venv .venv
</pre>
</div>

<p>
<b>Nota:</b> El nombre <code>.venv</code> es una convención que hace que el directorio sea oculto en sistemas Unix.
</p>
</div>
</div>
<div id="outline-container-orge6288f5" class="outline-4">
<h4 id="orge6288f5">2. Activación</h4>
<div class="outline-text-4" id="text-orge6288f5">
<p>
La activación depende de tu sistema operativo:
</p>
</div>
<ul class="org-ul">
<li><a id="org4eef6a6"></a>En Windows (PowerShell)<br />
<div class="outline-text-5" id="text-org4eef6a6">
<div class="org-src-container">
<pre class="src src-powershell">.\.venv\Scripts\Activate.ps1
</pre>
</div>
</div>
</li>
<li><a id="org4f2404b"></a>En macOS / Linux<br />
<div class="outline-text-5" id="text-org4f2404b">
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #483d8b;">source</span> .venv/bin/activate
</pre>
</div>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-org35a2d0a" class="outline-3">
<h3 id="org35a2d0a">Gestión de paquetes</h3>
<div class="outline-text-3" id="text-org35a2d0a">
<p>
Una vez activado (verás el prefijo <code>(.venv)</code> en tu prompt), puedes instalar librerías:
</p>

<div class="org-src-container">
<pre class="src src-bash">pip install requests pandas
</pre>
</div>
</div>
</div>
<div id="outline-container-org0d2e26d" class="outline-3">
<h3 id="org0d2e26d">El archivo de Requerimientos</h3>
<div class="outline-text-3" id="text-org0d2e26d">
<p>
Es fundamental para la reproducibilidad del proyecto.
</p>
</div>
</div>
<div id="outline-container-org59b2408" class="outline-3">
<h3 id="org59b2408">Exportar dependencias</h3>
<div class="outline-text-3" id="text-org59b2408">
<div class="org-src-container">
<pre class="src src-bash">pip freeze &gt; requirements.txt
</pre>
</div>
</div>
</div>
<div id="outline-container-org6210df1" class="outline-3">
<h3 id="org6210df1">Instalar desde el archivo</h3>
<div class="outline-text-3" id="text-org6210df1">
<div class="org-src-container">
<pre class="src src-bash">pip install -r requirements.txt
</pre>
</div>
</div>
</div>
<div id="outline-container-org1fe0104" class="outline-3">
<h3 id="org1fe0104">Tips de Limpieza</h3>
<div class="outline-text-3" id="text-org1fe0104">
<p>
Para salir del entorno virtual:
</p>
<div class="org-src-container">
<pre class="src src-bash">deactivate
</pre>
</div>

<p>
Para borrar el entorno, simplemente elimina la carpeta:
</p>
<div class="org-src-container">
<pre class="src src-bash">rm -rf .venv  <span style="color: #b22222;"># </span><span style="color: #b22222;">En Linux/macOS
</span>rmdir /s /q .venv  <span style="color: #b22222;"># </span><span style="color: #b22222;">En Windows</span>
</pre>
</div>

<p>
&#x2014;
</p>
<blockquote>
<p>
"Keep your global Python clean, keep your projects isolated."
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org905da8c" class="outline-3">
<h3 id="org905da8c">Entornos Virtuales Python (Edición Windows)</h3>
</div>

<div id="outline-container-orgcbacff7" class="outline-3">
<h3 id="orgcbacff7">Requisitos Previos</h3>
<div class="outline-text-3" id="text-orgcbacff7">
<ol class="org-ol">
<li>Tener instalado Python (descargado de <a href="https://www.python.org/">python.org</a> o la Microsoft Store).</li>
<li>Durante la instalación, asegúrate de marcar la casilla: <b><b>"Add Python to PATH"</b></b>.</li>
</ol>
</div>
</div>
<div id="outline-container-org6df5084" class="outline-3">
<h3 id="org6df5084">Flujo de Trabajo en Windows</h3>
<div class="outline-text-3" id="text-org6df5084">
</div>
<div id="outline-container-org1ecaf66" class="outline-4">
<h4 id="org1ecaf66">1. Crear el Entorno Virtual</h4>
<div class="outline-text-4" id="text-org1ecaf66">
<p>
Abre tu terminal (PowerShell o CMD) en la carpeta de tu proyecto. El comando es el mismo para ambos:
</p>

<div class="org-src-container">
<pre class="src src-powershell">python -m venv venv
</pre>
</div>
</div>
</div>
<div id="outline-container-org2d2fd9a" class="outline-4">
<h4 id="org2d2fd9a">2. El Paso Crítico: La Activación</h4>
<div class="outline-text-4" id="text-org2d2fd9a">
<p>
En Windows, la activación depende de qué terminal estés usando.
</p>
</div>
<ul class="org-ul">
