readme.org
**** Opción A: PowerShell (Recomendado)
Si es la primera vez que usas scripts en Windows, podrías recibir un error de seguridad. Primero, ejecuta esto como administrador (solo una vez):
#+begin_src powershell
Set-ExecutionPolicy -ExecutionPolicy RemoteSigned -Scope CurrentUser
#+end_src

Luego, para activar el entorno:
#+begin_src powershell
.\venv\Scripts\Activate.ps1
#+end_src

**** Opción B: Símbolo del Sistema (CMD)
#+begin_src cmd
.\venv\Scripts\activate.bat
#+end_src

*** 3. Confirmación
Sabrás que el entorno está activo porque el nombre =(venv)= aparecerá a la izquierda de la ruta en tu terminal:
#+example
(venv) C:\Proyectos\MiProyecto>
#+example

** Gestión de Librerías con PIP

*** Instalación de paquetes
Una vez activo el entorno, instala lo que necesites:
#+begin_src powershell
pip install pandas requests openpyxl
#+end_src

*** Congelar dependencias (Compartir proyecto)
Para que otros participantes tengan exactamente lo mismo que tú:
#+begin_src powershell
pip freeze > requirements.txt
#+end_src

*** Instalar desde un archivo recibido
Si un compañero te pasa su =requirements.txt=:
#+begin_src powershell
pip install -r requirements.txt
#+end_src

** Uso de Entornos en Emacs (Windows)

Para que Emacs en Windows gestione bien el entorno, añade esto a tu archivo de configuración (=init.el= o =.emacs=):

*** Instalación del paquete pyvenv
#+begin_src elisp
(use-package pyvenv
  :ensure t
  :config
  (pyvenv-mode 1))
#+end_src

*** Cómo activarlo dentro de Emacs
1. Presiona =M-x pyvenv-activate=.
2. Emacs te pedirá la ruta. Navega hasta la carpeta =venv= de tu proyecto.
3. Al seleccionarla, Emacs usará ese intérprete de Python para todos los scripts que ejecutes.

** Solución de Problemas Comunes en Windows

| Error / Problema | Solución |
| :--- | :--- |
| "python" no se reconoce | Reinstala Python y marca "Add to PATH" o usa el comando `py`. |
| Error de "Execution Policy" | Ejecuta `Set-ExecutionPolicy RemoteSigned -Scope CurrentUser`. |
| No aparece el (venv) | Asegúrate de usar el comando de activación correcto para tu terminal (.ps1 vs .bat). |

** Desactivación y Limpieza
Para salir del entorno:
#+begin_src powershell
deactivate
#+end_src

Si quieres borrar el entorno por completo (para empezar de cero):
#+begin_src powershell
rmdir /s /q venv
#+end_src

---
#+BEGIN_IMPORTANT
*Recordatorio:* Nunca incluyas la carpeta =venv= en tus archivos compartidos o en tu repositorio de Git. Solo comparte el código y el archivo =requirements.txt=.
#+END_IMPORTANT








** Agregar a jupyter notebook

#+BEGIN_SRC shell
pip install ipykernel
python -m ipykernel install --user --name=redes --display-name="redes"
#+END_SRC

* Introducción a la Inteligencia Artificial (IA)
** Definición formal

La *Inteligencia Artificial* es el área de la computación que estudia
  cómo construir sistemas capaces de realizar tareas que, si fueran
  realizadas por humanos, requerirían inteligencia.

Esto incluye capacidades como:

- Aprender de la experiencia
- Razonar
- Reconocer patrones
- Tomar decisiones bajo incertidumbre

La IA no implica necesariamente consciencia; se centra en *comportamiento inteligente observable*.

** IA débil vs IA fuerte

- *IA débil*: sistemas especializados en una tarea concreta (la IA actual)
- *IA fuerte*: inteligencia general comparable a la humana (teórica)

Las redes neuronales pertenecen claramente a la IA débil.


* Machine Learning (Aprendizaje Automático)
  ** Relación entre IA y ML
  El *Machine Learning (ML)* es una subdisciplina de la IA. Mientras la IA es el objetivo general, el ML es una de las herramientas principales para alcanzarlo.

Idea clave:
#+begin_quote
En lugar de programar reglas, el sistema aprende las reglas a partir de datos.
#+end_quote

** Tipos de aprendizaje

- *Supervisado*: datos con etiqueta (clasificación, regresión)
- *No supervisado*: datos sin etiqueta (clustering, reducción de dimensión)
- *Por refuerzo*: aprendizaje mediante recompensa y castigo

Las redes neuronales pueden adaptarse a los tres esquemas.


* Historia de las Redes Neuronales
** Contexto histórico
Desde mediados del siglo XX, científicos han intentado entender si la inteligencia podía ser replicada mediante modelos matemáticos.

** McCulloch y Pitts (1943)
Propusieron la primera neurona artificial basada en lógica
booleana. Demostraron que redes de estas neuronas podían computar
cualquier función lógica.

Este trabajo sentó las bases teóricas de las redes neuronales.

** Perceptrón y optimismo inicial
En los años 50 y 60, el perceptrón generó grandes expectativas al ser uno de los primeros sistemas que *aprendía* automáticamente.

** Críticas y estancamiento
El libro *Perceptrons* (Minsky & Papert, 1969) demostró limitaciones severas del perceptrón, provocando una fuerte caída en el interés por las redes neuronales.

** Renacimiento moderno

Con mayor poder computacional, grandes bases de datos y mejores algoritmos, las redes neuronales resurgen como *Deep Learning*.





* La Neurona Artificial
