index.html
<li><a id="orgdf0f95f"></a>Opción A: PowerShell (Recomendado)<br />
<div class="outline-text-5" id="text-orgdf0f95f">
<p>
Si es la primera vez que usas scripts en Windows, podrías recibir un error de seguridad. Primero, ejecuta esto como administrador (solo una vez):
</p>
<div class="org-src-container">
<pre class="src src-powershell">Set-ExecutionPolicy -ExecutionPolicy RemoteSigned -Scope CurrentUser
</pre>
</div>

<p>
Luego, para activar el entorno:
</p>
<div class="org-src-container">
<pre class="src src-powershell">.\venv\Scripts\Activate.ps1
</pre>
</div>
</div>
</li>
<li><a id="org165c9b5"></a>Opción B: Símbolo del Sistema (CMD)<br />
<div class="outline-text-5" id="text-org165c9b5">
<div class="org-src-container">
<pre class="src src-cmd">.\venv\Scripts\activate.bat
</pre>
</div>
</div>
</li>
</ul>
</div>
<div id="outline-container-orgb732b51" class="outline-4">
<h4 id="orgb732b51">3. Confirmación</h4>
<div class="outline-text-4" id="text-orgb732b51">
<p>
Sabrás que el entorno está activo porque el nombre <code>(venv)</code> aparecerá a la izquierda de la ruta en tu terminal:
#+example
(venv) C:\Proyectos\MiProyecto&gt;
#+example
</p>
</div>
</div>
</div>
<div id="outline-container-orgd972244" class="outline-3">
<h3 id="orgd972244">Gestión de Librerías con PIP</h3>
<div class="outline-text-3" id="text-orgd972244">
</div>
<div id="outline-container-org263d455" class="outline-4">
<h4 id="org263d455">Instalación de paquetes</h4>
<div class="outline-text-4" id="text-org263d455">
<p>
Una vez activo el entorno, instala lo que necesites:
</p>
<div class="org-src-container">
<pre class="src src-powershell">pip install pandas requests openpyxl
</pre>
</div>
</div>
</div>
<div id="outline-container-org9c377df" class="outline-4">
<h4 id="org9c377df">Congelar dependencias (Compartir proyecto)</h4>
<div class="outline-text-4" id="text-org9c377df">
<p>
Para que otros participantes tengan exactamente lo mismo que tú:
</p>
<div class="org-src-container">
<pre class="src src-powershell">pip freeze &gt; requirements.txt
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd16c0b9" class="outline-4">
<h4 id="orgd16c0b9">Instalar desde un archivo recibido</h4>
<div class="outline-text-4" id="text-orgd16c0b9">
<p>
Si un compañero te pasa su <code>requirements.txt</code>:
</p>
<div class="org-src-container">
<pre class="src src-powershell">pip install -r requirements.txt
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org2d128bc" class="outline-3">
<h3 id="org2d128bc">Uso de Entornos en Emacs (Windows)</h3>
<div class="outline-text-3" id="text-org2d128bc">
<p>
Para que Emacs en Windows gestione bien el entorno, añade esto a tu archivo de configuración (<code>init.el</code> o <code>.emacs</code>):
</p>
</div>
<div id="outline-container-org59b2eff" class="outline-4">
<h4 id="org59b2eff">Instalación del paquete pyvenv</h4>
<div class="outline-text-4" id="text-org59b2eff">
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #a020f0;">use-package</span> pyvenv
  <span style="color: #483d8b;">:ensure</span> t
  <span style="color: #483d8b;">:config</span>
  <span style="color: #7388d6;">(</span>pyvenv-mode 1<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb30adea" class="outline-4">
<h4 id="orgb30adea">Cómo activarlo dentro de Emacs</h4>
<div class="outline-text-4" id="text-orgb30adea">
<ol class="org-ol">
<li>Presiona <code>M-x pyvenv-activate</code>.</li>
<li>Emacs te pedirá la ruta. Navega hasta la carpeta <code>venv</code> de tu proyecto.</li>
<li>Al seleccionarla, Emacs usará ese intérprete de Python para todos los scripts que ejecutes.</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org7867558" class="outline-3">
<h3 id="org7867558">Solución de Problemas Comunes en Windows</h3>
<div class="outline-text-3" id="text-org7867558">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Error / Problema</td>
<td class="org-left">Solución</td>
</tr>

<tr>
<td class="org-left">:---</td>
<td class="org-left">:---</td>
</tr>

<tr>
<td class="org-left">"python" no se reconoce</td>
<td class="org-left">Reinstala Python y marca "Add to PATH" o usa el comando `py`.</td>
</tr>

<tr>
<td class="org-left">Error de "Execution Policy"</td>
<td class="org-left">Ejecuta `Set-ExecutionPolicy RemoteSigned -Scope CurrentUser`.</td>
</tr>

<tr>
<td class="org-left">No aparece el (venv)</td>
<td class="org-left">Asegúrate de usar el comando de activación correcto para tu terminal (.ps1 vs .bat).</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgdffce91" class="outline-3">
<h3 id="orgdffce91">Desactivación y Limpieza</h3>
<div class="outline-text-3" id="text-orgdffce91">
<p>
Para salir del entorno:
</p>
<div class="org-src-container">
<pre class="src src-powershell">deactivate
</pre>
</div>

<p>
Si quieres borrar el entorno por completo (para empezar de cero):
</p>
<div class="org-src-container">
<pre class="src src-powershell">rmdir /s /q venv
</pre>
</div>

<p>
&#x2014;
</p>
<div class="IMPORTANT" id="org851d8d4">
<p>
<b>Recordatorio:</b> Nunca incluyas la carpeta <code>venv</code> en tus archivos compartidos o en tu repositorio de Git. Solo comparte el código y el archivo <code>requirements.txt</code>.
</p>

</div>
</div>
</div>
<div id="outline-container-org8c3ad50" class="outline-3">
<h3 id="org8c3ad50">Agregar a jupyter notebook</h3>
<div class="outline-text-3" id="text-org8c3ad50">
<div class="org-src-container">
<pre class="src src-shell">pip install ipykernel
python -m ipykernel install --user --name=redes --display-name=<span style="color: #8b2252;">"redes"</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org9e59490" class="outline-2">
<h2 id="org9e59490">Introducción a la Inteligencia Artificial (IA)</h2>
<div class="outline-text-2" id="text-org9e59490">
</div>
<div id="outline-container-orge8abd65" class="outline-3">
<h3 id="orge8abd65">Definición formal</h3>
<div class="outline-text-3" id="text-orge8abd65">
<p>
La <b>Inteligencia Artificial</b> es el área de la computación que estudia
  cómo construir sistemas capaces de realizar tareas que, si fueran
  realizadas por humanos, requerirían inteligencia.
</p>

<p>
Esto incluye capacidades como:
</p>

<ul class="org-ul">
<li>Aprender de la experiencia</li>
<li>Razonar</li>
<li>Reconocer patrones</li>
<li>Tomar decisiones bajo incertidumbre</li>
</ul>

<p>
La IA no implica necesariamente consciencia; se centra en <b>comportamiento inteligente observable</b>.
</p>
</div>
</div>
<div id="outline-container-orgc0d06be" class="outline-3">
<h3 id="orgc0d06be">IA débil vs IA fuerte</h3>
<div class="outline-text-3" id="text-orgc0d06be">
<ul class="org-ul">
<li><b>IA débil</b>: sistemas especializados en una tarea concreta (la IA actual)</li>
<li><b>IA fuerte</b>: inteligencia general comparable a la humana (teórica)</li>
</ul>

<p>
Las redes neuronales pertenecen claramente a la IA débil.
</p>
</div>
</div>
</div>
<div id="outline-container-org2ec9534" class="outline-2">
<h2 id="org2ec9534">Machine Learning (Aprendizaje Automático)</h2>
<div class="outline-text-2" id="text-org2ec9534">
<p>
<b>* Relación entre IA y ML
El *Machine Learning (ML)</b> es una subdisciplina de la IA. Mientras la IA es el objetivo general, el ML es una de las herramientas principales para alcanzarlo.
</p>

<p>
Idea clave:
</p>
<blockquote>
<p>
En lugar de programar reglas, el sistema aprende las reglas a partir de datos.
</p>
</blockquote>
</div>
<div id="outline-container-org538a1c5" class="outline-3">
<h3 id="org538a1c5">Tipos de aprendizaje</h3>
<div class="outline-text-3" id="text-org538a1c5">
<ul class="org-ul">
<li><b>Supervisado</b>: datos con etiqueta (clasificación, regresión)</li>
<li><b>No supervisado</b>: datos sin etiqueta (clustering, reducción de dimensión)</li>
<li><b>Por refuerzo</b>: aprendizaje mediante recompensa y castigo</li>
</ul>

<p>
Las redes neuronales pueden adaptarse a los tres esquemas.
</p>
</div>
</div>
</div>
<div id="outline-container-org1e9a825" class="outline-2">
<h2 id="org1e9a825">Historia de las Redes Neuronales</h2>
<div class="outline-text-2" id="text-org1e9a825">
</div>
<div id="outline-container-org41a039a" class="outline-3">
<h3 id="org41a039a">Contexto histórico</h3>
<div class="outline-text-3" id="text-org41a039a">
<p>
Desde mediados del siglo XX, científicos han intentado entender si la inteligencia podía ser replicada mediante modelos matemáticos.
</p>
</div>
</div>
<div id="outline-container-orgb7d7519" class="outline-3">
<h3 id="orgb7d7519">McCulloch y Pitts (1943)</h3>
<div class="outline-text-3" id="text-orgb7d7519">
<p>
Propusieron la primera neurona artificial basada en lógica
booleana. Demostraron que redes de estas neuronas podían computar
cualquier función lógica.
</p>

<p>
Este trabajo sentó las bases teóricas de las redes neuronales.
</p>
</div>
</div>
<div id="outline-container-orgc88900d" class="outline-3">
<h3 id="orgc88900d">Perceptrón y optimismo inicial</h3>
<div class="outline-text-3" id="text-orgc88900d">
<p>
En los años 50 y 60, el perceptrón generó grandes expectativas al ser uno de los primeros sistemas que <b>aprendía</b> automáticamente.
</p>
</div>
</div>
<div id="outline-container-org6abfff8" class="outline-3">
<h3 id="org6abfff8">Críticas y estancamiento</h3>
<div class="outline-text-3" id="text-org6abfff8">
<p>
El libro <b>Perceptrons</b> (Minsky &amp; Papert, 1969) demostró limitaciones severas del perceptrón, provocando una fuerte caída en el interés por las redes neuronales.
</p>
</div>
</div>
<div id="outline-container-orge9f6364" class="outline-3">
<h3 id="orge9f6364">Renacimiento moderno</h3>
<div class="outline-text-3" id="text-orge9f6364">
<p>
Con mayor poder computacional, grandes bases de datos y mejores algoritmos, las redes neuronales resurgen como <b>Deep Learning</b>.
</p>
</div>
</div>
</div>
<div id="outline-container-orge1d3add" class="outline-2">
<h2 id="orge1d3add">La Neurona Artificial</h2>
<div class="outline-text-2" id="text-orge1d3add">
</div>
