readme.org
** Motivación
  Una red neuronal artificial es un modelo matemático inspirado en la
  organización y conectividad de las neuronas biológicas, que abstrae
  su funcionamiento esencial para construir sistemas capaces de
  aprender representaciones a partir de datos mediante el ajuste de
  parámetros.

** Componentes

- Entradas: variables numéricas
- Pesos: importancia relativa de cada entrada
- Bias: ajuste del umbral
- Activación: decisión final

** Modelo matemático
#+begin_src text
z = w·x + b
a = f(z)
#+end_src

Este modelo es la unidad básica de todas las redes neuronales modernas.


* El Perceptrón
** Definición
  El perceptrón es una neurona artificial entrenable utilizada para clasificación binaria.

** Interpretación geométrica
El perceptrón aprende una *frontera de decisión lineal* que separa los datos en dos clases.

** Aprendizaje

Cuando el perceptrón se equivoca, ajusta sus pesos para reducir el error.

** Limitaciones
No puede aprender relaciones no lineales, como XOR.


* ¿Qué es un problema linealmente separable?

**  Intuición básica 

Un problema es linealmente separable si puedes separar las clases usando una línea recta (en 2D),
un plano (en 3D), o en general un hiperplano.
Si existe una sola frontera recta que divide perfectamente las clases, el problema es linealmente separable.



* Estructura de un Perceptrón Simple


** Entradas (Inputs)
- Representadas como $x_1, x_2, ..., x_n$.
- Son los datos brutos o características que recibe el modelo.

** Pesos Sinápticos (Weights)
- Representados como $w_1, w_2, ..., w_n$.
- Determinan la importancia o influencia de cada entrada en el resultado final.

** Suma Ponderada (Weighted Sum)
- Es la combinación lineal de las entradas y los pesos.
- La fórmula matemática es:
  $$z = \sum_{i=1}^{n} w_i x_i + b$$

  
** Sesgo (Bias)
- Representado generalmente como $b$ (o $w_0$).
- Permite desplazar la función de activación hacia la izquierda o derecha para ajustar mejor los datos.

** Función de Activación
- Decide si la neurona debe "dispararse" (activarse) o no.
- En el perceptrón original de Rosenblatt, se utiliza la *Función Escalón* (Heaviside):
  - $f(z) = 1$ si $z > 0$
  - $f(z) = 0$ en caso contrario.

** Salida (Output)
- Es el resultado final del procesamiento ($\hat{y}$).
- En un perceptrón simple, suele ser un valor binario (0 o 1).


* Ejemplo Tacos

** 1. El Escenario: La Decisión de la Cena
Para entender cómo aprende una IA, vamos a usar un ejemplo de la vida real. Queremos que nuestra neurona artificial aprenda cuándo estamos "Satisfechos" (1) o "Inconformes" (0).

*** Nuestras Entradas (Inputs)
- $x_0$: ¿Hay Tacos? (1 = Sí, 0 = No)
- $x_1$: ¿Hay Refresco? (1 = Sí, 0 = No)

*** El Peso (Weight): La Importancia
No todo nos hace igual de felices. Los **Pesos** ($w_0, w_1$) representan qué tanto nos importa cada ingrediente. 
- Si el peso del taco es alto, el taco es fundamental para nuestra felicidad.

** 2. ¿Cómo toma la decisión? (La Suma y el Sesgo)
La neurona hace un cálculo matemático simple:
$$net = (x_0 \cdot w_0) + (x_1 \cdot w_1) - \text{bias}$$

*** El Sesgo (Bias)
El **Bias** es nuestro "nivel de exigencia". Si el Bias es muy alto, necesitaremos mucha comida (pesos altos) para poder llegar a estar satisfechos.

** 3. El Descenso del Gradiente: ¿Cómo "Aprende" la Neurona?
Cuando la neurona se equivoca, necesita ajustar sus pesos. Este proceso se llama **Descenso del Gradiente**.

*** El Error: La Brújula
Si esperábamos estar felices (~target = 1~) pero la neurona dice que estamos tristes (~net = 0~), tenemos un **Error de 1**.
$$Error = Target - Net$$

*** El Ajuste (La Regla Delta)
Para corregir el error, cambiamos los pesos usando esta lógica:
1. Miramos el **Error**.
2. Miramos la **Entrada** (¿Quién tuvo la culpa? Si no había tacos, el taco no pudo causar el error).
3. Aplicamos el **Learning Rate (K)**: Que es qué tan rápido queremos aprender.

$$Nuevo\_Peso = Peso\_Actual + (K \cdot Error \cdot Entrada)$$


Imagina que $K = 0.1$ y el Peso inicial del taco es $0.5$.
1. **Situación:** Hay tacos ($x_0=1$), pero la red dice "Triste" ($net=0$). Nosotros queríamos "Feliz" ($target=1$).
2. **Cálculo del Error:** $1 - 0 = 1$.
3. **Ajuste del Peso:**
   - $Delta = 0.1 \cdot 1 \cdot 1 = 0.1$
   - $Nuevo\_Peso\_Taco = 0.5 + 0.1 = 0.6$

**Resultado:** La próxima vez que haya tacos, la neurona estará un poco más cerca de hacernos felices. ¡Eso es el aprendizaje!

Puntos importantes

- El **Gradiente** nos dice en qué dirección mover los pesos para que el error sea cero.
- El **Learning Rate** controla qué tan grandes son los pasos que damos hacia esa solución.
- Si repetimos este proceso miles de veces (Épocas), la neurona encontrará los pesos perfectos para nuestra felicidad.


** Perceptrón ejemplo (Python)

1. Recibe entradas ($x_1, x_2, \dots$).
2. Las multiplica por pesos ($w_1, w_2, \dots$).
3. Suma un sesgo ($b$).
4. Aplica una función de activación (ej. Escalón).

