index.html
<div id="outline-container-orgce9ef15" class="outline-3">
<h3 id="orgce9ef15">Motivación</h3>
<div class="outline-text-3" id="text-orgce9ef15">
<p>
Una red neuronal artificial es un modelo matemático inspirado en la
organización y conectividad de las neuronas biológicas, que abstrae
su funcionamiento esencial para construir sistemas capaces de
aprender representaciones a partir de datos mediante el ajuste de
parámetros.
</p>
</div>
</div>
<div id="outline-container-org735c33c" class="outline-3">
<h3 id="org735c33c">Componentes</h3>
<div class="outline-text-3" id="text-org735c33c">
<ul class="org-ul">
<li>Entradas: variables numéricas</li>
<li>Pesos: importancia relativa de cada entrada</li>
<li>Bias: ajuste del umbral</li>
<li>Activación: decisión final</li>
</ul>
</div>
</div>
<div id="outline-container-org76dccc7" class="outline-3">
<h3 id="org76dccc7">Modelo matemático</h3>
<div class="outline-text-3" id="text-org76dccc7">
<div class="org-src-container">
<pre class="src src-text">z = w&#183;x + b
a = f(z)
</pre>
</div>

<p>
Este modelo es la unidad básica de todas las redes neuronales modernas.
</p>
</div>
</div>
</div>
<div id="outline-container-org25a374b" class="outline-2">
<h2 id="org25a374b">El Perceptrón</h2>
<div class="outline-text-2" id="text-org25a374b">
</div>
<div id="outline-container-org4efaf09" class="outline-3">
<h3 id="org4efaf09">Definición</h3>
<div class="outline-text-3" id="text-org4efaf09">
<p>
El perceptrón es una neurona artificial entrenable utilizada para clasificación binaria.
</p>
</div>
</div>
<div id="outline-container-orgdb2daa7" class="outline-3">
<h3 id="orgdb2daa7">Interpretación geométrica</h3>
<div class="outline-text-3" id="text-orgdb2daa7">
<p>
El perceptrón aprende una <b>frontera de decisión lineal</b> que separa los datos en dos clases.
</p>
</div>
</div>
<div id="outline-container-org07749df" class="outline-3">
<h3 id="org07749df">Aprendizaje</h3>
<div class="outline-text-3" id="text-org07749df">
<p>
Cuando el perceptrón se equivoca, ajusta sus pesos para reducir el error.
</p>
</div>
</div>
<div id="outline-container-org2e136e0" class="outline-3">
<h3 id="org2e136e0">Limitaciones</h3>
<div class="outline-text-3" id="text-org2e136e0">
<p>
No puede aprender relaciones no lineales, como XOR.
</p>
</div>
</div>
</div>
<div id="outline-container-orgd2b29db" class="outline-2">
<h2 id="orgd2b29db">¿Qué es un problema linealmente separable?</h2>
<div class="outline-text-2" id="text-orgd2b29db">
</div>
<div id="outline-container-org1f2a355" class="outline-3">
<h3 id="org1f2a355">Intuición básica</h3>
<div class="outline-text-3" id="text-org1f2a355">
<p>
Un problema es linealmente separable si puedes separar las clases usando una línea recta (en 2D),
un plano (en 3D), o en general un hiperplano.
Si existe una sola frontera recta que divide perfectamente las clases, el problema es linealmente separable.
</p>
</div>
</div>
</div>
<div id="outline-container-orgcdb5810" class="outline-2">
<h2 id="orgcdb5810">Estructura de un Perceptrón Simple</h2>
<div class="outline-text-2" id="text-orgcdb5810">
</div>
<div id="outline-container-org19a7b23" class="outline-3">
<h3 id="org19a7b23">Entradas (Inputs)</h3>
<div class="outline-text-3" id="text-org19a7b23">
<ul class="org-ul">
<li>Representadas como \(x_1, x_2, ..., x_n\).</li>
<li>Son los datos brutos o características que recibe el modelo.</li>
</ul>
</div>
</div>
<div id="outline-container-org95535b6" class="outline-3">
<h3 id="org95535b6">Pesos Sinápticos (Weights)</h3>
<div class="outline-text-3" id="text-org95535b6">
<ul class="org-ul">
<li>Representados como \(w_1, w_2, ..., w_n\).</li>
<li>Determinan la importancia o influencia de cada entrada en el resultado final.</li>
</ul>
</div>
</div>
<div id="outline-container-org5ba5f1e" class="outline-3">
<h3 id="org5ba5f1e">Suma Ponderada (Weighted Sum)</h3>
<div class="outline-text-3" id="text-org5ba5f1e">
<ul class="org-ul">
<li>Es la combinación lineal de las entradas y los pesos.</li>
<li>La fórmula matemática es:
\[z = \sum_{i=1}^{n} w_i x_i + b\]</li>
</ul>
</div>
</div>
<div id="outline-container-org07f09c8" class="outline-3">
<h3 id="org07f09c8">Sesgo (Bias)</h3>
<div class="outline-text-3" id="text-org07f09c8">
<ul class="org-ul">
<li>Representado generalmente como \(b\) (o \(w_0\)).</li>
<li>Permite desplazar la función de activación hacia la izquierda o derecha para ajustar mejor los datos.</li>
</ul>
</div>
</div>
<div id="outline-container-org798af64" class="outline-3">
<h3 id="org798af64">Función de Activación</h3>
<div class="outline-text-3" id="text-org798af64">
<ul class="org-ul">
<li>Decide si la neurona debe "dispararse" (activarse) o no.</li>
<li>En el perceptrón original de Rosenblatt, se utiliza la <b>Función Escalón</b> (Heaviside):
<ul class="org-ul">
<li>\(f(z) = 1\) si \(z > 0\)</li>
<li>\(f(z) = 0\) en caso contrario.</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgb4270fd" class="outline-3">
<h3 id="orgb4270fd">Salida (Output)</h3>
<div class="outline-text-3" id="text-orgb4270fd">
<ul class="org-ul">
<li>Es el resultado final del procesamiento (\(\hat{y}\)).</li>
<li>En un perceptrón simple, suele ser un valor binario (0 o 1).</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org28e2f60" class="outline-2">
<h2 id="org28e2f60">Ejemplo Tacos</h2>
<div class="outline-text-2" id="text-org28e2f60">
</div>
<div id="outline-container-org1b5db83" class="outline-3">
<h3 id="org1b5db83">1. El Escenario: La Decisión de la Cena</h3>
<div class="outline-text-3" id="text-org1b5db83">
<p>
Para entender cómo aprende una IA, vamos a usar un ejemplo de la vida real. Queremos que nuestra neurona artificial aprenda cuándo estamos "Satisfechos" (1) o "Inconformes" (0).
</p>
</div>
<div id="outline-container-org99e45c3" class="outline-4">
<h4 id="org99e45c3">Nuestras Entradas (Inputs)</h4>
<div class="outline-text-4" id="text-org99e45c3">
<ul class="org-ul">
<li>\(x_0\): ¿Hay Tacos? (1 = Sí, 0 = No)</li>
<li>\(x_1\): ¿Hay Refresco? (1 = Sí, 0 = No)</li>
</ul>
</div>
</div>
<div id="outline-container-org011770f" class="outline-4">
<h4 id="org011770f">El Peso (Weight): La Importancia</h4>
<div class="outline-text-4" id="text-org011770f">
<p>
No todo nos hace igual de felices. Los <b><b>Pesos</b></b> (\(w_0, w_1\)) representan qué tanto nos importa cada ingrediente. 
</p>
<ul class="org-ul">
<li>Si el peso del taco es alto, el taco es fundamental para nuestra felicidad.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org439258c" class="outline-3">
<h3 id="org439258c">2. ¿Cómo toma la decisión? (La Suma y el Sesgo)</h3>
<div class="outline-text-3" id="text-org439258c">
<p>
La neurona hace un cálculo matemático simple:
\[net = (x_0 \cdot w_0) + (x_1 \cdot w_1) - \text{bias}\]
</p>
</div>
<div id="outline-container-orgc337946" class="outline-4">
<h4 id="orgc337946">El Sesgo (Bias)</h4>
<div class="outline-text-4" id="text-orgc337946">
<p>
El <b><b>Bias</b></b> es nuestro "nivel de exigencia". Si el Bias es muy alto, necesitaremos mucha comida (pesos altos) para poder llegar a estar satisfechos.
</p>
</div>
</div>
</div>
<div id="outline-container-orgcf36728" class="outline-3">
<h3 id="orgcf36728">3. El Descenso del Gradiente: ¿Cómo "Aprende" la Neurona?</h3>
<div class="outline-text-3" id="text-orgcf36728">
<p>
Cuando la neurona se equivoca, necesita ajustar sus pesos. Este proceso se llama <b><b>Descenso del Gradiente</b></b>.
</p>
</div>
<div id="outline-container-org0263ebd" class="outline-4">
<h4 id="org0263ebd">El Error: La Brújula</h4>
<div class="outline-text-4" id="text-org0263ebd">
<p>
Si esperábamos estar felices (<code>target = 1</code>) pero la neurona dice que estamos tristes (<code>net = 0</code>), tenemos un <b><b>Error de 1</b></b>.
\[Error = Target - Net\]
</p>
</div>
</div>
<div id="outline-container-orgdd207dc" class="outline-4">
<h4 id="orgdd207dc">El Ajuste (La Regla Delta)</h4>
<div class="outline-text-4" id="text-orgdd207dc">
<p>
Para corregir el error, cambiamos los pesos usando esta lógica:
</p>
<ol class="org-ol">
<li>Miramos el <b><b>Error</b></b>.</li>
<li>Miramos la <b><b>Entrada</b></b> (¿Quién tuvo la culpa? Si no había tacos, el taco no pudo causar el error).</li>
<li>Aplicamos el <b><b>Learning Rate (K)</b></b>: Que es qué tan rápido queremos aprender.</li>
</ol>

<p>
\[Nuevo\_Peso = Peso\_Actual + (K \cdot Error \cdot Entrada)\]
</p>


<p>
Imagina que \(K = 0.1\) y el Peso inicial del taco es \(0.5\).
</p>
<ol class="org-ol">
<li><b><b>Situación:</b></b> Hay tacos (\(x_0=1\)), pero la red dice "Triste" (\(net=0\)). Nosotros queríamos "Feliz" (\(target=1\)).</li>
<li><b><b>Cálculo del Error:</b></b> \(1 - 0 = 1\).</li>
<li><b><b>Ajuste del Peso:</b></b>
<ul class="org-ul">
<li>\(Delta = 0.1 \cdot 1 \cdot 1 = 0.1\)</li>
<li>\(Nuevo\_Peso\_Taco = 0.5 + 0.1 = 0.6\)</li>
</ul></li>
</ol>

<p>
<b><b>Resultado:</b></b> La próxima vez que haya tacos, la neurona estará un poco más cerca de hacernos felices. ¡Eso es el aprendizaje!
</p>

<p>
Puntos importantes
</p>

<ul class="org-ul">
<li>El <b><b>Gradiente</b></b> nos dice en qué dirección mover los pesos para que el error sea cero.</li>
<li>El <b><b>Learning Rate</b></b> controla qué tan grandes son los pasos que damos hacia esa solución.</li>
<li>Si repetimos este proceso miles de veces (Épocas), la neurona encontrará los pesos perfectos para nuestra felicidad.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org452c07a" class="outline-3">
<h3 id="org452c07a">Perceptrón ejemplo (Python)</h3>
<div class="outline-text-3" id="text-org452c07a">
<ol class="org-ol">
<li>Recibe entradas (\(x_1, x_2, \dots\)).</li>
<li>Las multiplica por pesos (\(w_1, w_2, \dots\)).</li>
<li>Suma un sesgo (\(b\)).</li>
<li>Aplica una función de activación (ej. Escalón).</li>
</ol>
</div>
