readme.org
*** Perceptrón para una compuerta "AND"
Este código simula una neurona que solo se activa si ambas entradas son 1.

#+begin_src python :results output
def perceptron_and(x1, x2):
    # 1. Definimos los Pesos y el Sesgo (Bias)
    # Estos valores normalmente se aprenden, aquí los asignamos manualmente
    w1, w2 = 0.5, 0.5
    bias = -0.7

    # 2. Suma ponderada: (x1 * w1) + (x2 * w2) + bias
    suma = (x1 * w1) + (x2 * w2) + bias

    # 3. Función de activación (Escalón de Heaviside)
    # Si la suma es mayor a 0, la neurona se dispara (1)
    if suma > 0:
        return 1
    else:
        return 0

# Prueba de la tabla de verdad AND
entradas = [(0, 0), (0, 1), (1, 0), (1, 1)]

print("Entrada | Salida")
print("--------|-------")
for e in entradas:
    resultado = perceptron_and(e[0], e[1])
    print(f" {e}  |   {resultado}")
#+end_src

#+RESULTS:
: Entrada | Salida
: --------|-------
:  (0, 0)  |   0
:  (0, 1)  |   0
:  (1, 0)  |   0
:  (1, 1)  |   1




