index.html
<div id="outline-container-org1cbff08" class="outline-4">
<h4 id="org1cbff08">Perceptrón para una compuerta "AND"</h4>
<div class="outline-text-4" id="text-org1cbff08">
<p>
Este código simula una neurona que solo se activa si ambas entradas son 1.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">perceptron_and</span><span style="color: #707183;">(</span>x1, x2<span style="color: #707183;">)</span>:
<span style="background-color: #f2f2f2;"> </span>   <span style="color: #b22222;"># </span><span style="color: #b22222;">1. Definimos los Pesos y el Sesgo (Bias)
</span><span style="background-color: #f2f2f2;"> </span>   <span style="color: #b22222;"># </span><span style="color: #b22222;">Estos valores normalmente se aprenden, aqu&#237; los asignamos manualmente
</span><span style="background-color: #f2f2f2;"> </span>   <span style="color: #a0522d;">w1</span>, <span style="color: #a0522d;">w2</span> = 0.5, 0.5
<span style="background-color: #f2f2f2;"> </span>   <span style="color: #a0522d;">bias</span> = -0.7

<span style="background-color: #f2f2f2;"> </span>   <span style="color: #b22222;"># </span><span style="color: #b22222;">2. Suma ponderada: (x1 * w1) + (x2 * w2) + bias
</span><span style="background-color: #f2f2f2;"> </span>   <span style="color: #a0522d;">suma</span> = <span style="color: #707183;">(</span>x1 * w1<span style="color: #707183;">)</span> + <span style="color: #707183;">(</span>x2 * w2<span style="color: #707183;">)</span> + bias

<span style="background-color: #f2f2f2;"> </span>   <span style="color: #b22222;"># </span><span style="color: #b22222;">3. Funci&#243;n de activaci&#243;n (Escal&#243;n de Heaviside)
</span><span style="background-color: #f2f2f2;"> </span>   <span style="color: #b22222;"># </span><span style="color: #b22222;">Si la suma es mayor a 0, la neurona se dispara (1)
</span><span style="background-color: #f2f2f2;"> </span>   <span style="color: #a020f0;">if</span> suma &gt; 0:
<span style="background-color: #f2f2f2;"> </span>   <span style="background-color: #f2f2f2;"> </span>   <span style="color: #a020f0;">return</span> 1
<span style="background-color: #f2f2f2;"> </span>   <span style="color: #a020f0;">else</span>:
<span style="background-color: #f2f2f2;"> </span>   <span style="background-color: #f2f2f2;"> </span>   <span style="color: #a020f0;">return</span> 0

<span style="color: #b22222;"># </span><span style="color: #b22222;">Prueba de la tabla de verdad AND
</span><span style="color: #a0522d;">entradas</span> = <span style="color: #707183;">[</span><span style="color: #7388d6;">(</span>0, 0<span style="color: #7388d6;">)</span>, <span style="color: #7388d6;">(</span>0, 1<span style="color: #7388d6;">)</span>, <span style="color: #7388d6;">(</span>1, 0<span style="color: #7388d6;">)</span>, <span style="color: #7388d6;">(</span>1, 1<span style="color: #7388d6;">)</span><span style="color: #707183;">]</span>

<span style="color: #483d8b;">print</span><span style="color: #707183;">(</span><span style="color: #8b2252;">"Entrada | Salida"</span><span style="color: #707183;">)</span>
<span style="color: #483d8b;">print</span><span style="color: #707183;">(</span><span style="color: #8b2252;">"--------|-------"</span><span style="color: #707183;">)</span>
<span style="color: #a020f0;">for</span> e <span style="color: #a020f0;">in</span> entradas:
<span style="background-color: #f2f2f2;"> </span>   <span style="color: #a0522d;">resultado</span> = perceptron_and<span style="color: #707183;">(</span>e<span style="color: #7388d6;">[</span>0<span style="color: #7388d6;">]</span>, e<span style="color: #7388d6;">[</span>1<span style="color: #7388d6;">]</span><span style="color: #707183;">)</span>
<span style="background-color: #f2f2f2;"> </span>   <span style="color: #483d8b;">print</span><span style="color: #707183;">(</span>f<span style="color: #8b2252;">" </span>{e}<span style="color: #8b2252;">  |   </span>{resultado}<span style="color: #8b2252;">"</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>
