readme.org
* Codigo C python

#+BEGIN_SRC python
import math
import random

EPOCAS = 300000
K = 0.03  # tasa de aprendizaje

# Pesos y bias globales (como en el código C)
Pesos = [0.0, 0.0]
bias = 0.5
Error = 0.0


def sigmoide(s: float) -> float:
    # Versión correcta de la sigmoide logística:
    # 1 / (1 + e^{-s})
    return 1.0 / (1.0 + math.exp(-s))


def pesos_initNt():
    """Inicializa los pesos de forma aleatoria en [0,1)."""
    global Pesos
    Pesos = [random.random() for _ in range(2)]


def EntNt(x0: float, x1: float, target: float) -> float:
    """
    Función de entrenamiento del perceptrón (una iteración para un patrón).
    Modifica Pesos y bias de forma global.
    """
    global Pesos, bias, Error

    # net = w0*x0 + w1*x1 - bias
    net = Pesos[0] * x0 + Pesos[1] * x1 - bias
    net = sigmoide(net)

    Error = target - net

    # Actualización de bias (se asume entrada de bias = 1)
    bias -= K * Error

    # Variación de los pesos sinápticos
    delta0 = K * Error * x0
    delta1 = K * Error * x1

    # Ajuste de pesos
    Pesos[0] += delta0
    Pesos[1] += delta1

    return net


def InitNt(x0: float, x1: float) -> float:
    """
    Función que usa pesos fijos (de ejemplo) para calcular la salida.
    Equivalente a la parte comentada en C.
    """
    # net = 70.934807*x0 + 93.935219*x1 - 187.886169;
    net = 70.934807 * x0 + 93.935219 * x1 - 187.886169
    net = sigmoide(net)
    return net


def main():
    global Pesos, bias, Error

    pesos_initNt()

    for i in range(EPOCAS):
        print("------------------------")
        print(f"Salida Entrenamiento Epoca {i}")

        apr = EntNt(1, 1, 0)
        print(f"1,1 = {apr:.6f}")

        apr = EntNt(1, 0, 1)
        print(f"1,0 = {apr:.6f}")

        apr = EntNt(0, 1, 1)
        print(f"0,1 = {apr:.6f}")

        apr = EntNt(0, 0, 0)
        print(f"0,0 = {apr:.6f}")

        print("\nPesos de cada epoca")
        print(f"Peso 0 = {Pesos[0]:.6f}")
        print(f"Peso 1 = {Pesos[1]:.6f}")
        print(f"Bias   = {bias:.6f}")
        print(f"Error  = {Error:.6f}")
        print("------------------------")

    # Si quieres probar con los pesos fijos del comentario de C:
    # print("Resultados con InitNt:")
    # print("1,1 =", InitNt(1, 1))
    # print("1,0 =", InitNt(1, 0))
    # print("0,1 =", InitNt(0, 1))
    # print("0,0 =", InitNt(0, 0))


if __name__ == "__main__":
    main()
#+END_SRC


