index.html
<div id="outline-container-orgc08eba2" class="outline-2">
<h2 id="orgc08eba2">Codigo C python</h2>
<div class="outline-text-2" id="text-orgc08eba2">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #a020f0;">import</span> math
<span style="color: #a020f0;">import</span> random

<span style="color: #a0522d;">EPOCAS</span> = 300000
<span style="color: #a0522d;">K</span> = 0.03  <span style="color: #b22222;"># </span><span style="color: #b22222;">tasa de aprendizaje
</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">Pesos y bias globales (como en el c&#243;digo C)
</span><span style="color: #a0522d;">Pesos</span> = <span style="color: #707183;">[</span>0.0, 0.0<span style="color: #707183;">]</span>
<span style="color: #a0522d;">bias</span> = 0.5
<span style="color: #a0522d;">Error</span> = 0.0


<span style="color: #a020f0;">def</span> <span style="color: #0000ff;">sigmoide</span><span style="color: #707183;">(</span>s: <span style="color: #483d8b;">float</span><span style="color: #707183;">)</span> -&gt; <span style="color: #483d8b;">float</span>:
<span style="background-color: #f2f2f2;"> </span>   <span style="color: #b22222;"># </span><span style="color: #b22222;">Versi&#243;n correcta de la sigmoide log&#237;stica:
</span><span style="background-color: #f2f2f2;"> </span>   <span style="color: #b22222;"># </span><span style="color: #b22222;">1 / (1 + e^{-s})
</span><span style="background-color: #f2f2f2;"> </span>   <span style="color: #a020f0;">return</span> 1.0 / <span style="color: #707183;">(</span>1.0 + math.exp<span style="color: #7388d6;">(</span>-s<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>


<span style="color: #a020f0;">def</span> <span style="color: #0000ff;">pesos_initNt</span><span style="color: #707183;">()</span>:
<span style="background-color: #f2f2f2;"> </span>   <span style="color: #8b2252;">"""Inicializa los pesos de forma aleatoria en [0,1)."""</span>
<span style="background-color: #f2f2f2;"> </span>   <span style="color: #a020f0;">global</span> Pesos
<span style="background-color: #f2f2f2;"> </span>   <span style="color: #a0522d;">Pesos</span> = <span style="color: #707183;">[</span>random.random<span style="color: #7388d6;">()</span> <span style="color: #a020f0;">for</span> _ <span style="color: #a020f0;">in</span> <span style="color: #483d8b;">range</span><span style="color: #7388d6;">(</span>2<span style="color: #7388d6;">)</span><span style="color: #707183;">]</span>


<span style="color: #a020f0;">def</span> <span style="color: #0000ff;">EntNt</span><span style="color: #707183;">(</span>x0: <span style="color: #483d8b;">float</span>, x1: <span style="color: #483d8b;">float</span>, target: <span style="color: #483d8b;">float</span><span style="color: #707183;">)</span> -&gt; <span style="color: #483d8b;">float</span>:
<span style="background-color: #f2f2f2;"> </span>   <span style="color: #8b2252;">"""
</span><span style="color: #8b2252; background-color: #f2f2f2;"> </span><span style="color: #8b2252;">   Funci&#243;n de entrenamiento del perceptr&#243;n (una iteraci&#243;n para un patr&#243;n).
</span><span style="color: #8b2252; background-color: #f2f2f2;"> </span><span style="color: #8b2252;">   Modifica Pesos y bias de forma global.
</span><span style="color: #8b2252; background-color: #f2f2f2;"> </span><span style="color: #8b2252;">   """</span>
<span style="background-color: #f2f2f2;"> </span>   <span style="color: #a020f0;">global</span> Pesos, bias, Error

<span style="background-color: #f2f2f2;"> </span>   <span style="color: #b22222;"># </span><span style="color: #b22222;">net = w0*x0 + w1*x1 - bias
</span><span style="background-color: #f2f2f2;"> </span>   <span style="color: #a0522d;">net</span> = Pesos<span style="color: #707183;">[</span>0<span style="color: #707183;">]</span> * x0 + Pesos<span style="color: #707183;">[</span>1<span style="color: #707183;">]</span> * x1 - bias
<span style="background-color: #f2f2f2;"> </span>   <span style="color: #a0522d;">net</span> = sigmoide<span style="color: #707183;">(</span>net<span style="color: #707183;">)</span>

<span style="background-color: #f2f2f2;"> </span>   <span style="color: #a0522d;">Error</span> = target - net

<span style="background-color: #f2f2f2;"> </span>   <span style="color: #b22222;"># </span><span style="color: #b22222;">Actualizaci&#243;n de bias (se asume entrada de bias = 1)
</span><span style="background-color: #f2f2f2;"> </span>   <span style="color: #a0522d;">bias</span> -= K * Error

<span style="background-color: #f2f2f2;"> </span>   <span style="color: #b22222;"># </span><span style="color: #b22222;">Variaci&#243;n de los pesos sin&#225;pticos
</span><span style="background-color: #f2f2f2;"> </span>   <span style="color: #a0522d;">delta0</span> = K * Error * x0
<span style="background-color: #f2f2f2;"> </span>   <span style="color: #a0522d;">delta1</span> = K * Error * x1

<span style="background-color: #f2f2f2;"> </span>   <span style="color: #b22222;"># </span><span style="color: #b22222;">Ajuste de pesos
</span><span style="background-color: #f2f2f2;"> </span>   <span style="color: #a0522d;">Pesos</span><span style="color: #707183;">[</span>0<span style="color: #707183;">]</span> += delta0
<span style="background-color: #f2f2f2;"> </span>   <span style="color: #a0522d;">Pesos</span><span style="color: #707183;">[</span>1<span style="color: #707183;">]</span> += delta1

<span style="background-color: #f2f2f2;"> </span>   <span style="color: #a020f0;">return</span> net


<span style="color: #a020f0;">def</span> <span style="color: #0000ff;">InitNt</span><span style="color: #707183;">(</span>x0: <span style="color: #483d8b;">float</span>, x1: <span style="color: #483d8b;">float</span><span style="color: #707183;">)</span> -&gt; <span style="color: #483d8b;">float</span>:
<span style="background-color: #f2f2f2;"> </span>   <span style="color: #8b2252;">"""
</span><span style="color: #8b2252; background-color: #f2f2f2;"> </span><span style="color: #8b2252;">   Funci&#243;n que usa pesos fijos (de ejemplo) para calcular la salida.
</span><span style="color: #8b2252; background-color: #f2f2f2;"> </span><span style="color: #8b2252;">   Equivalente a la parte comentada en C.
</span><span style="color: #8b2252; background-color: #f2f2f2;"> </span><span style="color: #8b2252;">   """</span>
<span style="background-color: #f2f2f2;"> </span>   <span style="color: #b22222;"># </span><span style="color: #b22222;">net = 70.934807*x0 + 93.935219*x1 - 187.886169;
</span><span style="background-color: #f2f2f2;"> </span>   <span style="color: #a0522d;">net</span> = 70.934807 * x0 + 93.935219 * x1 - 187.886169
<span style="background-color: #f2f2f2;"> </span>   <span style="color: #a0522d;">net</span> = sigmoide<span style="color: #707183;">(</span>net<span style="color: #707183;">)</span>
<span style="background-color: #f2f2f2;"> </span>   <span style="color: #a020f0;">return</span> net


<span style="color: #a020f0;">def</span> <span style="color: #0000ff;">main</span><span style="color: #707183;">()</span>:
<span style="background-color: #f2f2f2;"> </span>   <span style="color: #a020f0;">global</span> Pesos, bias, Error

<span style="background-color: #f2f2f2;"> </span>   pesos_initNt<span style="color: #707183;">()</span>

<span style="background-color: #f2f2f2;"> </span>   <span style="color: #a020f0;">for</span> i <span style="color: #a020f0;">in</span> <span style="color: #483d8b;">range</span><span style="color: #707183;">(</span>EPOCAS<span style="color: #707183;">)</span>:
<span style="background-color: #f2f2f2;"> </span>   <span style="background-color: #f2f2f2;"> </span>   <span style="color: #483d8b;">print</span><span style="color: #707183;">(</span><span style="color: #8b2252;">"------------------------"</span><span style="color: #707183;">)</span>
<span style="background-color: #f2f2f2;"> </span>   <span style="background-color: #f2f2f2;"> </span>   <span style="color: #483d8b;">print</span><span style="color: #707183;">(</span>f<span style="color: #8b2252;">"Salida Entrenamiento Epoca </span>{i}<span style="color: #8b2252;">"</span><span style="color: #707183;">)</span>

<span style="background-color: #f2f2f2;"> </span>   <span style="background-color: #f2f2f2;"> </span>   <span style="color: #a0522d;">apr</span> = EntNt<span style="color: #707183;">(</span>1, 1, 0<span style="color: #707183;">)</span>
<span style="background-color: #f2f2f2;"> </span>   <span style="background-color: #f2f2f2;"> </span>   <span style="color: #483d8b;">print</span><span style="color: #707183;">(</span>f<span style="color: #8b2252;">"1,1 = </span>{apr:.6f}<span style="color: #8b2252;">"</span><span style="color: #707183;">)</span>

<span style="background-color: #f2f2f2;"> </span>   <span style="background-color: #f2f2f2;"> </span>   <span style="color: #a0522d;">apr</span> = EntNt<span style="color: #707183;">(</span>1, 0, 1<span style="color: #707183;">)</span>
<span style="background-color: #f2f2f2;"> </span>   <span style="background-color: #f2f2f2;"> </span>   <span style="color: #483d8b;">print</span><span style="color: #707183;">(</span>f<span style="color: #8b2252;">"1,0 = </span>{apr:.6f}<span style="color: #8b2252;">"</span><span style="color: #707183;">)</span>

<span style="background-color: #f2f2f2;"> </span>   <span style="background-color: #f2f2f2;"> </span>   <span style="color: #a0522d;">apr</span> = EntNt<span style="color: #707183;">(</span>0, 1, 1<span style="color: #707183;">)</span>
<span style="background-color: #f2f2f2;"> </span>   <span style="background-color: #f2f2f2;"> </span>   <span style="color: #483d8b;">print</span><span style="color: #707183;">(</span>f<span style="color: #8b2252;">"0,1 = </span>{apr:.6f}<span style="color: #8b2252;">"</span><span style="color: #707183;">)</span>

<span style="background-color: #f2f2f2;"> </span>   <span style="background-color: #f2f2f2;"> </span>   <span style="color: #a0522d;">apr</span> = EntNt<span style="color: #707183;">(</span>0, 0, 0<span style="color: #707183;">)</span>
<span style="background-color: #f2f2f2;"> </span>   <span style="background-color: #f2f2f2;"> </span>   <span style="color: #483d8b;">print</span><span style="color: #707183;">(</span>f<span style="color: #8b2252;">"0,0 = </span>{apr:.6f}<span style="color: #8b2252;">"</span><span style="color: #707183;">)</span>

<span style="background-color: #f2f2f2;"> </span>   <span style="background-color: #f2f2f2;"> </span>   <span style="color: #483d8b;">print</span><span style="color: #707183;">(</span><span style="color: #8b2252;">"</span><span style="color: #008b8b;">\n</span><span style="color: #8b2252;">Pesos de cada epoca"</span><span style="color: #707183;">)</span>
<span style="background-color: #f2f2f2;"> </span>   <span style="background-color: #f2f2f2;"> </span>   <span style="color: #483d8b;">print</span><span style="color: #707183;">(</span>f<span style="color: #8b2252;">"Peso 0 = </span>{Pesos[0]:.6f}<span style="color: #8b2252;">"</span><span style="color: #707183;">)</span>
<span style="background-color: #f2f2f2;"> </span>   <span style="background-color: #f2f2f2;"> </span>   <span style="color: #483d8b;">print</span><span style="color: #707183;">(</span>f<span style="color: #8b2252;">"Peso 1 = </span>{Pesos[1]:.6f}<span style="color: #8b2252;">"</span><span style="color: #707183;">)</span>
<span style="background-color: #f2f2f2;"> </span>   <span style="background-color: #f2f2f2;"> </span>   <span style="color: #483d8b;">print</span><span style="color: #707183;">(</span>f<span style="color: #8b2252;">"Bias   = </span>{bias:.6f}<span style="color: #8b2252;">"</span><span style="color: #707183;">)</span>
<span style="background-color: #f2f2f2;"> </span>   <span style="background-color: #f2f2f2;"> </span>   <span style="color: #483d8b;">print</span><span style="color: #707183;">(</span>f<span style="color: #8b2252;">"Error  = </span>{Error:.6f}<span style="color: #8b2252;">"</span><span style="color: #707183;">)</span>
<span style="background-color: #f2f2f2;"> </span>   <span style="background-color: #f2f2f2;"> </span>   <span style="color: #483d8b;">print</span><span style="color: #707183;">(</span><span style="color: #8b2252;">"------------------------"</span><span style="color: #707183;">)</span>

<span style="background-color: #f2f2f2;"> </span>   <span style="color: #b22222;"># </span><span style="color: #b22222;">Si quieres probar con los pesos fijos del comentario de C:
</span><span style="background-color: #f2f2f2;"> </span>   <span style="color: #b22222;"># </span><span style="color: #b22222;">print("Resultados con InitNt:")
</span><span style="background-color: #f2f2f2;"> </span>   <span style="color: #b22222;"># </span><span style="color: #b22222;">print("1,1 =", InitNt(1, 1))
</span><span style="background-color: #f2f2f2;"> </span>   <span style="color: #b22222;"># </span><span style="color: #b22222;">print("1,0 =", InitNt(1, 0))
</span><span style="background-color: #f2f2f2;"> </span>   <span style="color: #b22222;"># </span><span style="color: #b22222;">print("0,1 =", InitNt(0, 1))
</span><span style="background-color: #f2f2f2;"> </span>   <span style="color: #b22222;"># </span><span style="color: #b22222;">print("0,0 =", InitNt(0, 0))
</span>

<span style="color: #a020f0;">if</span> <span style="color: #483d8b;">__name__</span> == <span style="color: #8b2252;">"__main__"</span>:
<span style="background-color: #f2f2f2;"> </span>   main<span style="color: #707183;">()</span>
</pre>
</div>
</div>
</div>
