index.html
<div id="outline-container-org87de320" class="outline-2">
<h2 id="org87de320">Redes Neuronales Multicapa (Multilayer Perceptron)</h2>
<div class="outline-text-2" id="text-org87de320">
</div>
<div id="outline-container-orgf04393b" class="outline-3">
<h3 id="orgf04393b">Introducción</h3>
<div class="outline-text-3" id="text-orgf04393b">
<p>
Una <b>red neuronal multicapa</b> o <b>Perceptrón Multicapa (MLP)</b> es un modelo
de aprendizaje supervisado que extiende al perceptrón simple mediante
la inclusión de <b>una o más capas ocultas</b>. Estas capas permiten modelar
<b>relaciones no lineales complejas</b> entre las variables de entrada y la salida.
</p>

<p>
Los MLP constituyen la base conceptual del <b>Deep Learning</b> moderno:
</p>

<ul class="org-ul">
<li>El perceptrón simple solo puede resolver problemas <b>linealmente separables</b>.</li>
<li>Muchos problemas reales (visión, texto, señales) son <b>no lineales</b>.</li>
<li>Agregar capas ocultas + funciones de activación no lineales permite
aproximar funciones mucho más complejas (teorema del aproximador universal).</li>
</ul>

<p>
Ejemplos clásicos (con 2 entradas):
</p>

<ul class="org-ul">
<li>AND  → ✓ separable linealmente</li>
<li>OR   → ✓ separable linealmente</li>
<li>XOR  → ✗ <b>no</b> es separable linealmente</li>
</ul>

<p>
El problema XOR demuestra la necesidad de introducir:
</p>

<ul class="org-ul">
<li><b>Capas ocultas</b> (capacidad de representar interacciones no triviales),</li>
<li><b>Funciones de activación no lineales</b>.</li>
</ul>

<p>
Un MLP típico está compuesto por:
</p>

<ol class="org-ol">
<li><b>Capa de entrada</b>  
Recibe el vector de características \(\mathbf{x}\).</li>

<li><b>Capas ocultas</b>  
Realizan transformaciones lineales + no lineales sobre las
representaciones intermedias.</li>

<li><b>Capa de salida</b>  
Produce la predicción final (clase, probabilidad, valor continuo, etc.).</li>
</ol>

<p>
Estructura conceptual:
</p>

<pre class="example" id="org6ae7235">
x → Capa Oculta 1 → Capa Oculta 2 → … → Capa de salida → ŷ
</pre>

<p>
Cada “flecha” representa una transformación lineal (multiplicación por
matriz de pesos + suma de bias) seguida de una función de activación.
</p>
</div>
</div>
<div id="outline-container-orgfa9d43f" class="outline-3">
<h3 id="orgfa9d43f">Modelo matemático</h3>
<div class="outline-text-3" id="text-orgfa9d43f">
</div>
<div id="outline-container-orgd9d565a" class="outline-4">
<h4 id="orgd9d565a">Neurona individual</h4>
<div class="outline-text-4" id="text-orgd9d565a">
<p>
Cada neurona recibe un vector de entrada \(\mathbf{x} \in \mathbb{R}^n\) y calcula:
</p>

<p>
\[
z = \sum_{i=1}^{n} w_i x_i + b
\]
</p>

<p>
\[
a = f(z)
\]
</p>

<p>
Donde:
</p>

<ul class="org-ul">
<li>\(w_i\): pesos sinápticos de la neurona,</li>
<li>\(b\): término de sesgo (bias),</li>
<li>\(f(\cdot)\): función de activación,</li>
<li>\(z\): combinación lineal de las entradas,</li>
<li>\(a\): salida (activación) de la neurona.</li>
</ul>

<p>
En forma vectorial para una neurona:
</p>

<p>
\[
z = \mathbf{w}^\top \mathbf{x} + b
\]
</p>

<p>
\[
a = f(z)
\]
</p>
</div>
</div>
<div id="outline-container-org3abb12f" class="outline-4">
<h4 id="org3abb12f">Forma matricial de una capa</h4>
<div class="outline-text-4" id="text-org3abb12f">
<p>
En una capa con múltiples neuronas, se usa notación matricial:
</p>

<ul class="org-ul">
<li>\(\mathbf{a}^{(l-1)}\): vector de activaciones de la capa anterior,</li>
<li>\(\mathbf{W}^{(l)}\): matriz de pesos de la capa \(l\),</li>
<li>\(\mathbf{b}^{(l)}\): vector de bias de la capa \(l\),</li>
<li>\(\mathbf{z}^{(l)}\): preactivaciones de la capa \(l\),</li>
<li>\(\mathbf{a}^{(l)}\): activaciones de la capa \(l\).</li>
</ul>

<p>
Cálculo:
</p>

<p>
\[
\mathbf{z}^{(l)} = \mathbf{W}^{(l)} \mathbf{a}^{(l-1)} + \mathbf{b}^{(l)}
\]
</p>

<p>
\[
\mathbf{a}^{(l)} = f(\mathbf{z}^{(l)})
\]
</p>

<p>
donde \(f\) se aplica componente a componente.
</p>

<p>
Repitiendo este proceso desde la capa de entrada hasta la salida,
obtenemos la predicción del MLP.
</p>
</div>
</div>
</div>
<div id="outline-container-org670f5f4" class="outline-3">
<h3 id="org670f5f4">Funciones de activación</h3>
<div class="outline-text-3" id="text-org670f5f4">
<p>
Las funciones de activación son componentes fundamentales en las redes
neuronales multicapa. Su función principal es introducir <b>no linealidad</b>
en el modelo.
</p>

<p>
Sin funciones de activación no lineales:
</p>

<ul class="org-ul">
<li>cada capa sería solo una transformación lineal,</li>
<li>y la composición de múltiples transformaciones lineales es <b>otra</b>
transformación lineal,</li>
<li>por lo tanto, una “red profunda” sin no linealidad se comporta como
un <b>modelo lineal simple</b>, independientemente del número de capas.</li>
</ul>
</div>
<div id="outline-container-org8ecb0d2" class="outline-4">
<h4 id="org8ecb0d2">¿Para qué sirven las funciones de activación?</h4>
<div class="outline-text-4" id="text-org8ecb0d2">
<p>
Las funciones de activación permiten:
</p>

<ul class="org-ul">
<li>Introducir <b>no linealidad</b> en la red.</li>
<li>Modelar relaciones complejas entre variables de entrada y salida.</li>
<li>Aprender fronteras de decisión no lineales en problemas de clasificación.</li>
<li>Aproximar cualquier función continua bajo ciertas condiciones
(teorema del aproximador universal).</li>
</ul>

<p>
Recordemos que una neurona realiza:
</p>

<p>
\[
z = \sum_{i=1}^{n} w_i x_i + b
\]
</p>

<p>
\[
a = f(z)
\]
</p>

<p>
Donde \(f\) es la función de activación.
</p>
</div>
</div>
</div>
<div id="outline-container-orgae9e0eb" class="outline-3">
<h3 id="orgae9e0eb">Clasificación de las funciones de activación</h3>
<div class="outline-text-3" id="text-orgae9e0eb">
<p>
Las funciones de activación pueden clasificarse según:
</p>

<ul class="org-ul">
<li>su forma (escalón, sigmoide, lineal por partes, etc.),</li>
<li>su rango de salida,</li>
<li>su uso (capas ocultas vs capa de salida),</li>
<li>su comportamiento para valores grandes de \(|z|\).</li>
</ul>
</div>
<div id="outline-container-orgbf074db" class="outline-4">
<h4 id="orgbf074db">Funciones de activación clásicas</h4>
<div class="outline-text-4" id="text-orgbf074db">
</div>
<ul class="org-ul">
<li><a id="orga0ffe04"></a>Función escalón (Step Function)<br />
<div class="outline-text-5" id="text-orga0ffe04">
<p>
\[
f(z) =
</p>
\begin{cases}
1 & \text{si } z \ge 0 \\
0 & \text{si } z < 0
\end{cases}
<p>
\]
</p>

<p>
Características:
</p>

<ul class="org-ul">
<li>Usada en el perceptrón simple original.</li>
<li>No es continua ni derivable (no adecuada para descenso de gradiente).</li>
<li>Genera salidas binarias (0/1).</li>
</ul>

<p>
Uso:
</p>

<ul class="org-ul">
<li>Modelos teóricos e históricos.</li>
<li>Introducción al concepto de neurona como “disparar / no disparar”.</li>
<li>No se utiliza en redes multicapa modernas para entrenamiento con
backpropagation.</li>
</ul>
</div>
</li>
<li><a id="orgaf1c19c"></a>Sigmoide logística<br />
<div class="outline-text-5" id="text-orgaf1c19c">
<p>
\[
f(z) = \frac{1}{1 + e^{-z}}
\]
</p>

<p>
Características:
</p>

<ul class="org-ul">
<li>Salida en el intervalo \((0, 1)\).</li>
<li>Puede interpretarse como una probabilidad.</li>
<li>Es suave y derivable en todo \(\mathbb{R}\).</li>
</ul>

<p>
Ventajas:
</p>

<ul class="org-ul">
<li>Interpretación probabilística directa.</li>
<li>Históricamente muy usada en redes neuronales tempranas.</li>
</ul>

<p>
Desventajas:
</p>

<ul class="org-ul">
<li>Para \(|z|\) grandes, la función se <b>satura</b> cerca de 0 o 1:
<ul class="org-ul">
<li>la derivada es muy pequeña,</li>
<li>aparece el problema de <b>vanishing gradient</b>,</li>
<li>el entrenamiento de redes profundas se vuelve lento o ineficaz.</li>
</ul></li>
</ul>

<p>
Uso típico actual:
</p>

<ul class="org-ul">
<li>Capa de salida en algunos modelos de clasificación binaria (aunque
en deep learning moderno también se usan otras combinaciones).</li>
</ul>
</div>
</li>
<li><a id="org8aaf227"></a>Tangente hiperbólica (tanh)<br />
<div class="outline-text-5" id="text-org8aaf227">
<p>
\[
f(z) = \tanh(z)
\]
</p>

<p>
Características:
</p>

<ul class="org-ul">
<li>Salida en el intervalo \((-1, 1)\).</li>
<li>Es simétrica alrededor de 0 (centrada en cero).</li>
</ul>

<p>
Ventajas:
</p>

<ul class="org-ul">
<li>En comparación con la sigmoide logística, su salida centrada en cero:
<ul class="org-ul">
<li>puede favorecer una convergencia algo más rápida,</li>
<li>reduce ciertos sesgos en las activaciones.</li>
</ul></li>
</ul>

<p>
Desventajas:
</p>

<ul class="org-ul">
<li>También se satura para \(|z|\) grandes.</li>
<li>Sigue presentando <b>vanishing gradient</b> en redes muy profundas.</li>
</ul>

<p>
Uso clásico:
</p>

<ul class="org-ul">
<li>Capas ocultas en redes no demasiado profundas, antes de la adopción
masiva de ReLU.</li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-orgaf0135f" class="outline-4">
<h4 id="orgaf0135f">Funciones de activación modernas</h4>
<div class="outline-text-4" id="text-orgaf0135f">
</div>
<ul class="org-ul">
