index.html
<li><a id="org0fccafc"></a>ReLU (Rectified Linear Unit)<br />
<div class="outline-text-5" id="text-org0fccafc">
<p>
\[
f(z) = \max(0, z)
\]
</p>

<p>
Características:
</p>

<ul class="org-ul">
<li>Función lineal por partes:
<ul class="org-ul">
<li>para \(z < 0\): salida 0,</li>
<li>para \(z \ge 0\): salida \(z\).</li>
</ul></li>
<li>Muy sencilla y eficiente de calcular.</li>
</ul>

<p>
Ventajas:
</p>

<ul class="org-ul">
<li>No se satura para valores positivos grandes (derivada constante 1).</li>
<li>Reduce considerablemente el problema del <b>vanishing gradient</b>.</li>
<li>Ha permitido entrenar redes profundas con muchas capas.</li>
</ul>

<p>
Desventajas:
</p>

<ul class="org-ul">
<li><b>Dead neurons</b>: si una neurona recibe valores de \(z\) siempre
negativos, su salida es siempre 0 y el gradiente puede quedar en 0
→ deja de aprender.</li>
</ul>

<p>
Uso típico:
</p>

<ul class="org-ul">
<li>Función estándar en <b>capas ocultas</b> de MLP y CNN modernos.</li>
</ul>
</div>
</li>
<li><a id="orgeabbe46"></a>Leaky ReLU<br />
<div class="outline-text-5" id="text-orgeabbe46">
<p>
\[
f(z) =
</p>
\begin{cases}
z & \text{si } z \ge 0 \\
\alpha z & \text{si } z < 0
\end{cases}
<p>
\]
</p>

<p>
donde \(\alpha\) es un pequeño número positivo (por ejemplo, 0.01).
</p>

<p>
Características:
</p>

<ul class="org-ul">
<li>Variante de ReLU que, en lugar de “apagar” totalmente la neurona para
\(z < 0\), permite un pequeño gradiente negativo.</li>
</ul>

<p>
Ventajas:
</p>

<ul class="org-ul">
<li>Reduce el problema de neuronas muertas (<b>dead ReLU</b>).</li>
<li>Mantiene muchas ventajas de ReLU.</li>
</ul>

<p>
Uso típico:
</p>

<ul class="org-ul">
<li>Alternativa a ReLU cuando se observa que muchas neuronas quedan
inactivas de manera permanente.</li>
</ul>
</div>
</li>
<li><a id="org3da542b"></a>ELU (Exponential Linear Unit)<br />
<div class="outline-text-5" id="text-org3da542b">
<p>
\[
f(z) =
</p>
\begin{cases}
z & \text{si } z \ge 0 \\
\alpha (e^{z} - 1) & \text{si } z < 0
\end{cases}
<p>
\]
</p>

<p>
Características:
</p>

<ul class="org-ul">
<li>Para \(z \ge 0\): igual que ReLU.</li>
<li>Para \(z < 0\): decae de forma exponencial, con salida negativa acotada.</li>
</ul>

<p>
Ventajas:
</p>

<ul class="org-ul">
<li>Puede acelerar la convergencia en ciertos casos.</li>
<li>Las salidas negativas ayudan a centrar la activación alrededor de 0,
lo que puede mejorar la propagación del gradiente.</li>
</ul>

<p>
Uso típico:
</p>

<ul class="org-ul">
<li>Capas ocultas, en algunos modelos donde se ha observado mejor
rendimiento que con ReLU estándar.</li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-orgff27281" class="outline-4">
<h4 id="orgff27281">Funciones de activación en la capa de salida</h4>
<div class="outline-text-4" id="text-orgff27281">
<p>
La función de activación de la <b>capa de salida</b> depende del tipo de
problema:
</p>
</div>
<ul class="org-ul">
<li><a id="org9cd33f5"></a>Clasificación binaria<br />
<div class="outline-text-5" id="text-org9cd33f5">
<p>
Se usa típicamente una función <b>sigmoide</b> para obtener una probabilidad
en \((0,1)\):
</p>

<p>
\[
\hat{y} = \sigma(z) \in (0,1)
\]
</p>

<p>
donde \(\hat{y}\) se interpreta como la probabilidad de clase “1”.
</p>
</div>
</li>
<li><a id="org0bbc1a9"></a>Clasificación multiclase (mutuamente excluyentes)<br />
<div class="outline-text-5" id="text-org0bbc1a9">
<p>
Se usa la función <b>softmax</b>:
</p>

<p>
\[
\text{softmax}(z_i) = \frac{e^{z_i}}{\sum_j e^{z_j}}
\]
</p>

<ul class="org-ul">
<li>Convierte un vector de puntajes \(\mathbf{z}\) en un vector de
probabilidades que:
<ul class="org-ul">
<li>son positivas,</li>
<li>y suman 1.</li>
</ul></li>
</ul>
</div>
</li>
<li><a id="orgdd7d8f2"></a>Regresión<br />
<div class="outline-text-5" id="text-orgdd7d8f2">
<ul class="org-ul">
<li>Se usa generalmente una función de activación <b>lineal</b> en la salida:
\[
    f(z) = z
  \]</li>
<li>La red puede entonces producir valores reales sin restricción de
rango (o con restricciones adicionales impuestas por el preprocesado).</li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-org6f63e25" class="outline-4">
<h4 id="org6f63e25">Impacto en el entrenamiento</h4>
<div class="outline-text-4" id="text-org6f63e25">
<p>
La elección de la función de activación afecta:
</p>

<ul class="org-ul">
<li>La <b>velocidad de convergencia</b>.</li>
<li>La <b>estabilidad</b> del entrenamiento.</li>
<li>El <b>flujo del gradiente</b> a través de las capas.</li>
<li>La capacidad de representar ciertas distribuciones de salida.</li>
</ul>

<p>
Una elección inadecuada:
</p>

<ul class="org-ul">
<li>puede causar vanishing/exploding gradient,</li>
<li>puede impedir que la red aprenda adecuadamente,</li>
<li>o requerir tiempos de entrenamiento excesivos.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgf0b7f33" class="outline-3">
<h3 id="orgf0b7f33">Propagación hacia adelante (Forward Propagation)</h3>
<div class="outline-text-3" id="text-orgf0b7f33">
<p>
La <b>propagación hacia adelante</b> es el proceso mediante el cual la red
calcula su salida a partir de una entrada dada.
</p>

<p>
Pasos generales:
</p>

<ol class="org-ol">
<li>Se recibe el vector de entrada \(\mathbf{x}\).</li>
<li>Se calcula sucesivamente:
<ul class="org-ul">
<li>\(\mathbf{z}^{(1)}\), \(\mathbf{a}^{(1)}\) (primera capa oculta),</li>
<li>\(\mathbf{z}^{(2)}\), \(\mathbf{a}^{(2)}\), etc.</li>
</ul></li>
<li>Se obtiene la activación de la capa de salida \(\mathbf{a}^{(L)}\),
que corresponde a la predicción \(\hat{\mathbf{y}}\).</li>
</ol>

<p>
Podemos verlo como una composición de funciones:
</p>

<p>
\[
\mathbf{a}^{(L)} = f^{(L)}\left( \mathbf{W}^{(L)} \, f^{(L-1)}\left( \dots f^{(1)}\left(\mathbf{W}^{(1)} \mathbf{x} + \mathbf{b}^{(1)}\right) \dots \right) + \mathbf{b}^{(L)} \right)
\]
</p>

<p>
o, de forma más compacta:
</p>

<p>
\[
\hat{\mathbf{y}} = F(\mathbf{x}; \theta)
\]
</p>

<p>
donde \(\theta\) denota el conjunto de todos los pesos y bias de la red.
</p>
</div>
</div>
<div id="outline-container-orge935b49" class="outline-3">
<h3 id="orge935b49">Funciones de pérdida</h3>
<div class="outline-text-3" id="text-orge935b49">
<p>
Las funciones de pérdida (o <b>funciones de coste</b>) miden el error entre:
</p>

<ul class="org-ul">
<li>la predicción del modelo \(\hat{y}\) (o \(\hat{\mathbf{y}}\)),</li>
<li>y el valor real \(y\) (o \(\mathbf{y}\)).</li>
</ul>

<p>
El objetivo del entrenamiento es encontrar parámetros \(\theta\) que
<b>minimicen</b> la pérdida promedio sobre el conjunto de entrenamiento.
</p>
</div>
<div id="outline-container-org7a0dcbd" class="outline-4">
<h4 id="org7a0dcbd">Error cuadrático medio (MSE)</h4>
<div class="outline-text-4" id="text-org7a0dcbd">
<p>
Común en problemas de regresión:
</p>

<p>
\[
\mathcal{L}_{\text{MSE}} = \frac{1}{n} \sum_{k=1}^{n} (y_k - \hat{y}_k)^2
\]
</p>

<p>
donde:
</p>

<ul class="org-ul">
<li>\(n\) es el número de muestras,</li>
<li>\(y_k\) es el valor real de la muestra \(k\),</li>
<li>\(\hat{y}_k\) es la predicción del modelo.</li>
</ul>
</div>
</div>
<div id="outline-container-org444ae6c" class="outline-4">
<h4 id="org444ae6c">Entropía cruzada (Cross-Entropy)</h4>
<div class="outline-text-4" id="text-org444ae6c">
<p>
Muy utilizada en clasificación.
</p>

<ul class="org-ul">
<li>Para clasificación binaria:</li>
</ul>

<p>
\[
\mathcal{L}_{\text{binaria}} = - \frac{1}{n} \sum_{k=1}^{n} \left[ y_k \log(\hat{y}_k) + (1 - y_k)\log(1 - \hat{y}_k) \right]
\]
</p>

<ul class="org-ul">
<li>Para clasificación multiclase (one-hot \(\mathbf{y}\) y softmax \(\hat{\mathbf{y}}\)):</li>
</ul>

<p>
\[
\mathcal{L}_{\text{multiclase}} = - \frac{1}{n} \sum_{k=1}^{n} \sum_{c=1}^{C} y_{k,c} \log(\hat{y}_{k,c})
\]
</p>

<p>
donde:
</p>

<ul class="org-ul">
<li>\(C\) es el número de clases,</li>
<li>\(y_{k,c}\) es 1 si la muestra \(k\) pertenece a la clase \(c\), y 0 en caso contrario,</li>
<li>\(\hat{y}_{k,c}\) es la probabilidad predicha para la clase \(c\).</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org8475fcb" class="outline-3">
<h3 id="org8475fcb">Backpropagation</h3>
<div class="outline-text-3" id="text-org8475fcb">
<p>
<b>Backpropagation</b> es el algoritmo fundamental para entrenar MLP. Se
basa en la aplicación sistemática de la <b>regla de la cadena</b> del cálculo
diferencial para propagar el error desde la capa de salida hacia las
capas anteriores.
</p>

<p>
Para un peso genérico \(w\), la derivada de la pérdida se expresa como:
</p>

<p>
\[
\frac{\partial \mathcal{L}}{\partial w} =
\frac{\partial \mathcal{L}}{\partial a}
\cdot \frac{\partial a}{\partial z}
\cdot \frac{\partial z}{\partial w}
\]
</p>

<p>
donde:
</p>

<ul class="org-ul">
<li>\(\frac{\partial \mathcal{L}}{\partial a}\): cuánto cambia la pérdida
si cambia la activación \(a\),</li>
<li>\(\frac{\partial a}{\partial z}\): deriva de la función de activación,</li>
<li>\(\frac{\partial z}{\partial w}\): relación lineal entre \(z\) y el
peso \(w\).</li>
</ul>

<p>
El algoritmo:
</p>

<ol class="org-ol">
<li>Calcula un <b>forward pass</b> (de entrada a salida).</li>
<li>Calcula la pérdida \(\mathcal{L}\).</li>
<li>Propaga gradientes hacia atrás usando la regla de la cadena.</li>
<li>Obtiene \(\frac{\partial \mathcal{L}}{\partial w}\) y
\(\frac{\partial \mathcal{L}}{\partial b}\) para todos los pesos y
bias de la red.</li>
<li>Usa estos gradientes para actualizar los parámetros.</li>
</ol>
</div>
</div>
