readme.org
** Descenso de gradiente

El *descenso de gradiente* (gradient descent) es la regla de
actualización básica para minimizar la función de pérdida.

Para un peso \(w\):

\[
w := w - \eta \, \frac{\partial \mathcal{L}}{\partial w}
\]

donde:

- \(\eta\) es la *tasa de aprendizaje* (learning rate),
- \(\frac{\partial \mathcal{L}}{\partial w}\) es el gradiente de la
  pérdida respecto a \(w\).

Interpretación:

- Nos movemos en la dirección *opuesta* al gradiente (descenso),
- La magnitud del paso está controlada por \(\eta\).

En la práctica:

- Se usan variantes como:
  - *Stochastic Gradient Descent (SGD)*,
  - SGD con *momentum*,
  - *Adam*, *RMSProp*, etc.
- Estas variantes mejoran:
  - la velocidad de convergencia,
  - la estabilidad numérica,
  - la capacidad de escapar de mínimos locales poco profundos.


* Ejemplo Clasificación del dataset Iris con MLP

Este apartado muestra un ejemplo completo en Python usando el dataset
clásico Iris y una red neuronal feedforward (Perceptrón Multicapa)
usando la librería scikit-learn.

El objetivo es clasificar flores Iris en tres clases:

- Setosa
- Versicolor
- Virginica


Importar librerías

#+begin_src python
import numpy as np
from sklearn.datasets import load_iris 
from sklearn.model_selection import train_test_split 
from sklearn.preprocessing import StandardScaler 
from sklearn.neural_network import MLPClassifier 
from sklearn.metrics import accuracy_score, classification_report
#+end_src

Cargar el dataset Iris

#+begin_src python
iris = load_iris()
X = iris.data # Características (150 x 4) y = iris.target # Clases (150,)
print(X.shape) print(y.shape)
#+end_src

Las 4 características son:

- Largo del sépalo
- Ancho del sépalo
- Largo del pétalo
- Ancho del pétalo

Las clases están codificadas como:

- 0 → Setosa
- 1 → Versicolor
- 2 → Virginica

El siguiente fragmento de código realiza la partición del conjunto de
datos original en dos subconjuntos disjuntos: uno destinado al
entrenamiento del modelo y otro a su evaluación.

#+begin_src python
X_train, X_test, y_train, y_test = train_test_split( X, y, test_size=0.2, random_state=42, stratify=y )
#+end_src

Propósito de la partición:

En aprendizaje automático supervisado, es fundamental evaluar la
capacidad de generalización de un modelo. Para ello, los datos
disponibles se dividen en:

- *Conjunto de entrenamiento*: utilizado para ajustar los parámetros del modelo (pesos y sesgos).
- *Conjunto de prueba*: utilizado exclusivamente para medir el desempeño del modelo sobre datos no vistos durante el entrenamiento.

Esta separación permite detectar fenómenos como overfitting y
underfitting, y proporciona una estimación más realista del
rendimiento esperado en producción.

*El parámetro*:
#+BEGIN_SRC python
test_size=0.2
#+END_SRC
indica que el 20 % del conjunto total de datos se reserva para el
conjunto de prueba, mientras que el 80 % restante se utiliza para
entrenamiento. Esta proporción es común en la práctica y representa un
compromiso razonable entre:

- disponer de suficientes datos para entrenar el modelo, y
- contar con una muestra representativa para evaluar su generalización.

** Reproducibilidad del experimento

El parámetro:

#+BEGIN_SRC python
random_state=42
#+END_SRC

fija la semilla del generador de números aleatorios utilizado durante
la partición.  Esto garantiza que la división de los datos sea
reproducible, es decir, que múltiples ejecuciones del mismo código
produzcan exactamente la misma separación entre entrenamiento y
prueba.

La reproducibilidad es un requisito esencial en entornos científicos y
académicos, ya que permite validar y comparar resultados de manera
consistente.

** Estratificación de clases

El parámetro:

#+BEGIN_SRC python
stratify=y
#+END_SRC

indica que la división debe realizarse de forma estratificada,
conservando la proporción original de cada clase en ambos
subconjuntos.

Esto es especialmente importante en problemas de clasificación, ya que
una división aleatoria sin estratificación podría provocar:

- conjuntos de entrenamiento o prueba con clases desbalanceadas,
- métricas de desempeño engañosas,
- modelos que no aprendan adecuadamente clases minoritarias.

Mediante la estratificación, se asegura que tanto el conjunto de
entrenamiento como el de prueba sean representativos de la
distribución real de las clases.

** Importancia en redes neuronales

En el contexto de redes neuronales (incluyendo MLP):

- el entrenamiento ajusta los pesos minimizando una función de pérdida
  sobre X_train,

- la evaluación sobre X_test permite medir la capacidad del modelo
  para generalizar,

- una mala partición puede conducir a conclusiones erróneas sobre el
  desempeño del modelo.

Por esta razón, la división adecuada del conjunto de datos constituye
un paso crítico previo al entrenamiento y no debe considerarse un
detalle menor de implementación.


