index.html
<div id="outline-container-orgcfa3523" class="outline-3">
<h3 id="orgcfa3523">Descenso de gradiente</h3>
<div class="outline-text-3" id="text-orgcfa3523">
<p>
El <b>descenso de gradiente</b> (gradient descent) es la regla de
actualización básica para minimizar la función de pérdida.
</p>

<p>
Para un peso \(w\):
</p>

<p>
\[
w := w - \eta \, \frac{\partial \mathcal{L}}{\partial w}
\]
</p>

<p>
donde:
</p>

<ul class="org-ul">
<li>\(\eta\) es la <b>tasa de aprendizaje</b> (learning rate),</li>
<li>\(\frac{\partial \mathcal{L}}{\partial w}\) es el gradiente de la
pérdida respecto a \(w\).</li>
</ul>

<p>
Interpretación:
</p>

<ul class="org-ul">
<li>Nos movemos en la dirección <b>opuesta</b> al gradiente (descenso),</li>
<li>La magnitud del paso está controlada por \(\eta\).</li>
</ul>

<p>
En la práctica:
</p>

<ul class="org-ul">
<li>Se usan variantes como:
<ul class="org-ul">
<li><b>Stochastic Gradient Descent (SGD)</b>,</li>
<li>SGD con <b>momentum</b>,</li>
<li><b>Adam</b>, <b>RMSProp</b>, etc.</li>
</ul></li>
<li>Estas variantes mejoran:
<ul class="org-ul">
<li>la velocidad de convergencia,</li>
<li>la estabilidad numérica,</li>
<li>la capacidad de escapar de mínimos locales poco profundos.</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orga982b53" class="outline-2">
<h2 id="orga982b53">Ejemplo Clasificación del dataset Iris con MLP</h2>
<div class="outline-text-2" id="text-orga982b53">
<p>
Este apartado muestra un ejemplo completo en Python usando el dataset
clásico Iris y una red neuronal feedforward (Perceptrón Multicapa)
usando la librería scikit-learn.
</p>

<p>
El objetivo es clasificar flores Iris en tres clases:
</p>

<ul class="org-ul">
<li>Setosa</li>
<li>Versicolor</li>
<li>Virginica</li>
</ul>


<p>
Importar librerías
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a020f0;">import</span> numpy <span style="color: #a020f0;">as</span> np
<span style="color: #a020f0;">from</span> sklearn.datasets <span style="color: #a020f0;">import</span> load_iris 
<span style="color: #a020f0;">from</span> sklearn.model_selection <span style="color: #a020f0;">import</span> train_test_split 
<span style="color: #a020f0;">from</span> sklearn.preprocessing <span style="color: #a020f0;">import</span> StandardScaler 
<span style="color: #a020f0;">from</span> sklearn.neural_network <span style="color: #a020f0;">import</span> MLPClassifier 
<span style="color: #a020f0;">from</span> sklearn.metrics <span style="color: #a020f0;">import</span> accuracy_score, classification_report
</pre>
</div>

<p>
Cargar el dataset Iris
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">iris</span> = load_iris<span style="color: #707183;">()</span>
<span style="color: #a0522d;">X</span> = iris.data <span style="color: #b22222;"># </span><span style="color: #b22222;">Caracter&#237;sticas (150 x 4) y = iris.target # Clases (150,)
</span><span style="color: #483d8b;">print</span><span style="color: #707183;">(</span>X.shape<span style="color: #707183;">)</span> <span style="color: #483d8b;">print</span><span style="color: #707183;">(</span>y.shape<span style="color: #707183;">)</span>
</pre>
</div>

<p>
Las 4 características son:
</p>

<ul class="org-ul">
<li>Largo del sépalo</li>
<li>Ancho del sépalo</li>
<li>Largo del pétalo</li>
<li>Ancho del pétalo</li>
</ul>

<p>
Las clases están codificadas como:
</p>

<ul class="org-ul">
<li>0 → Setosa</li>
<li>1 → Versicolor</li>
<li>2 → Virginica</li>
</ul>

<p>
El siguiente fragmento de código realiza la partición del conjunto de
datos original en dos subconjuntos disjuntos: uno destinado al
entrenamiento del modelo y otro a su evaluación.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">X_train</span>, <span style="color: #a0522d;">X_test</span>, <span style="color: #a0522d;">y_train</span>, <span style="color: #a0522d;">y_test</span> = train_test_split<span style="color: #707183;">(</span> X, y, test_size=0.2, random_state=42, stratify=y <span style="color: #707183;">)</span>
</pre>
</div>

<p>
Propósito de la partición:
</p>

<p>
En aprendizaje automático supervisado, es fundamental evaluar la
capacidad de generalización de un modelo. Para ello, los datos
disponibles se dividen en:
</p>

<ul class="org-ul">
<li><b>Conjunto de entrenamiento</b>: utilizado para ajustar los parámetros del modelo (pesos y sesgos).</li>
<li><b>Conjunto de prueba</b>: utilizado exclusivamente para medir el desempeño del modelo sobre datos no vistos durante el entrenamiento.</li>
</ul>

<p>
Esta separación permite detectar fenómenos como overfitting y
underfitting, y proporciona una estimación más realista del
rendimiento esperado en producción.
</p>

<p>
<b>El parámetro</b>:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">test_size</span>=0.2
</pre>
</div>
<p>
indica que el 20 % del conjunto total de datos se reserva para el
conjunto de prueba, mientras que el 80 % restante se utiliza para
entrenamiento. Esta proporción es común en la práctica y representa un
compromiso razonable entre:
</p>

<ul class="org-ul">
<li>disponer de suficientes datos para entrenar el modelo, y</li>
<li>contar con una muestra representativa para evaluar su generalización.</li>
</ul>
</div>
<div id="outline-container-org9025bea" class="outline-3">
<h3 id="org9025bea">Reproducibilidad del experimento</h3>
<div class="outline-text-3" id="text-org9025bea">
<p>
El parámetro:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">random_state</span>=42
</pre>
</div>

<p>
fija la semilla del generador de números aleatorios utilizado durante
la partición.  Esto garantiza que la división de los datos sea
reproducible, es decir, que múltiples ejecuciones del mismo código
produzcan exactamente la misma separación entre entrenamiento y
prueba.
</p>

<p>
La reproducibilidad es un requisito esencial en entornos científicos y
académicos, ya que permite validar y comparar resultados de manera
consistente.
</p>
</div>
</div>
<div id="outline-container-orga02ff76" class="outline-3">
<h3 id="orga02ff76">Estratificación de clases</h3>
<div class="outline-text-3" id="text-orga02ff76">
<p>
El parámetro:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">stratify</span>=y
</pre>
</div>

<p>
indica que la división debe realizarse de forma estratificada,
conservando la proporción original de cada clase en ambos
subconjuntos.
</p>

<p>
Esto es especialmente importante en problemas de clasificación, ya que
una división aleatoria sin estratificación podría provocar:
</p>

<ul class="org-ul">
<li>conjuntos de entrenamiento o prueba con clases desbalanceadas,</li>
<li>métricas de desempeño engañosas,</li>
<li>modelos que no aprendan adecuadamente clases minoritarias.</li>
</ul>

<p>
Mediante la estratificación, se asegura que tanto el conjunto de
entrenamiento como el de prueba sean representativos de la
distribución real de las clases.
</p>
</div>
</div>
<div id="outline-container-orgea407f1" class="outline-3">
<h3 id="orgea407f1">Importancia en redes neuronales</h3>
<div class="outline-text-3" id="text-orgea407f1">
<p>
En el contexto de redes neuronales (incluyendo MLP):
</p>

<ul class="org-ul">
<li>el entrenamiento ajusta los pesos minimizando una función de pérdida
sobre X<sub>train</sub>,</li>

<li>la evaluación sobre X<sub>test</sub> permite medir la capacidad del modelo
para generalizar,</li>

<li>una mala partición puede conducir a conclusiones erróneas sobre el
desempeño del modelo.</li>
</ul>

<p>
Por esta razón, la división adecuada del conjunto de datos constituye
un paso crítico previo al entrenamiento y no debe considerarse un
detalle menor de implementación.
</p>
</div>
</div>
