readme.org
** Normalización de los datos

La normalización de los datos de entrada es un paso crítico en el
entrenamiento de redes neuronales, ya que influye directamente en la
estabilidad numérica, la velocidad de convergencia y la eficacia del
aprendizaje.

En una red neuronal, los pesos se ajustan mediante métodos de
optimización basados en gradientes. Si las variables de entrada
presentan escalas muy diferentes, el proceso de entrenamiento puede
volverse ineficiente o inestable.

En muchos conjuntos de datos, las características pueden tener rangos muy distintos. Por ejemplo:

- una variable puede tomar valores entre 0 y 1,
- otra entre 0 y 10⁶,
- otra puede incluir valores negativos.

Cuando estos datos se introducen directamente en una red neuronal:

- los gradientes asociados a variables de gran escala dominan la actualización de los pesos,
- las funciones de activación pueden saturarse,
- el descenso por gradiente se vuelve lento o errático.

La normalización busca homogeneizar la escala de las entradas,
permitiendo que todas las características contribuyan de manera
equilibrada al aprendizaje.


Una de las técnicas más utilizadas es la estandarización, implementada
en scikit-learn mediante la clase StandardScaler.

#+begin_src python
scaler = StandardScaler()
X_train = scaler.fit_transform(X_train) X_test = scaler.transform(X_test)
#+end_src

Este procedimiento transforma cada característica \(x\) según la siguiente expresión:

\[
x' = \frac{x - \mu}{\sigma}
\]

donde:

- \( \mu \) es la media de la característica,
- \( \sigma \) es la desviación estándar de la característica.

Como resultado de esta transformación, cada variable queda con:

- media aproximadamente igual a 0,
- desviación estándar igual a 1.

** Definir el Perceptrón Multicapa (MLP)


El siguiente fragmento de código define un *Perceptrón Multicapa* (Multilayer Perceptron, MLP)
para un problema de clasificación multiclase, utilizando la implementación provista por
la biblioteca *scikit-learn*.

#+begin_src python
mlp = MLPClassifier(
    hidden_layer_sizes=(10, 10),
    activation='relu',
    solver='adam',
    learning_rate_init=0.001,
    max_iter=2000,
    random_state=42
)
#+end_src

Este modelo corresponde a una red neuronal *feedforward completamente conectada*,
entrenada mediante *backpropagation* y optimizada usando métodos de descenso por gradiente.

*** Arquitectura de la red neuronal

La arquitectura del MLP queda determinada por el número de características de entrada,
las capas ocultas definidas explícitamente y el número de neuronas en la capa de salida.

*** Capa de entrada

- La capa de entrada está compuesta por *4 neuronas*.
- Cada neurona representa una característica del vector de entrada.
- Esta capa no aplica transformaciones, únicamente propaga los valores hacia la primera capa oculta.

Formalmente, el vector de entrada se expresa como:

\[
\mathbf{x} = (x_1, x_2, x_3, x_4)
\]

*** Capas ocultas

El parámetro:

#+begin_src python
hidden_layer_sizes=(10, 10)
#+end_src

define *dos capas ocultas*, cada una con *10 neuronas*.

Características principales:

- Son capas *densas (fully connected)*.
- Cada neurona recibe como entrada la salida de *todas* las neuronas de la capa anterior.
- Permiten aprender representaciones no lineales del espacio de características.

Cada capa oculta implementa la transformación:

\[
\mathbf{h}^{(l)} = f\left( \mathbf{W}^{(l)} \mathbf{h}^{(l-1)} + \mathbf{b}^{(l)} \right)
\]

donde:

- \( \mathbf{W}^{(l)} \) es la matriz de pesos,
- \( \mathbf{b}^{(l)} \) es el vector de sesgos,
- \( f(\cdot) \) es la función de activación.

*** Función de activación

El parámetro:

#+begin_src python
activation='relu'
#+end_src

indica el uso de la función *ReLU (Rectified Linear Unit)*, definida como:

\[
\text{ReLU}(z) = \max(0, z)
\]

Esta función se utiliza porque:

- introduce no linealidad,
- reduce el problema del *vanishing gradient*,
- mejora la estabilidad del entrenamiento,
- es computacionalmente eficiente.

*** Capa de salida

- La capa de salida está compuesta por *3 neuronas*.
- Cada neurona corresponde a una de las clases del problema.
- Internamente, el modelo utiliza una función *softmax* para obtener probabilidades.

La clase predicha se obtiene mediante la operación *argmax* sobre las salidas.

*** Entrenamiento del modelo

El entrenamiento se realiza mediante el optimizador *Adam*:

#+begin_src python
solver='adam'
#+end_src

Adam combina:
- momentum
- tasas de aprendizaje adaptativas

lo que permite una convergencia más rápida y estable en redes con múltiples capas.

La tasa de aprendizaje inicial se define como:

\[
\eta = 0.001
\]

controlando el tamaño de los pasos durante la actualización de los pesos.

** Número de iteraciones

El parámetro:

#+begin_src python
max_iter=2000
#+end_src

establece el número máximo de épocas de entrenamiento.
Una época corresponde a un pase completo sobre el conjunto de entrenamiento.

Un número elevado de épocas favorece la convergencia, aunque incrementa el riesgo de *overfitting*.

** Reproducibilidad

El parámetro:

#+begin_src python
random_state=42
#+end_src

fija la semilla del generador de números aleatorios, garantizando resultados reproducibles
en la inicialización de los pesos y el proceso de entrenamiento.



** Entrenamiento del modelo

El entrenamiento deñ Perceptrón Multicapa (MLP) consiste en ajustar
los pesos y sesgos de la red para minimizar el error de predicción
sobre los datos de entrenamiento.

#+begin_src python
mlp.fit(X_train, y_train)
#+end_src

Durante este proceso ocurren los siguientes pasos fundamentales:

*** Propagación hacia adelante (forward pass)

Cada muestra de entrada x atraviesa la red capa por capa.

En cada neurona se calcula una combinación lineal y se aplica una función de activación.

Se obtiene una salida y que representa la predicción del modelo.

