index.html
<div id="outline-container-org9e61ba4" class="outline-3">
<h3 id="org9e61ba4">Normalización de los datos</h3>
<div class="outline-text-3" id="text-org9e61ba4">
<p>
La normalización de los datos de entrada es un paso crítico en el
entrenamiento de redes neuronales, ya que influye directamente en la
estabilidad numérica, la velocidad de convergencia y la eficacia del
aprendizaje.
</p>

<p>
En una red neuronal, los pesos se ajustan mediante métodos de
optimización basados en gradientes. Si las variables de entrada
presentan escalas muy diferentes, el proceso de entrenamiento puede
volverse ineficiente o inestable.
</p>

<p>
En muchos conjuntos de datos, las características pueden tener rangos muy distintos. Por ejemplo:
</p>

<ul class="org-ul">
<li>una variable puede tomar valores entre 0 y 1,</li>
<li>otra entre 0 y 10⁶,</li>
<li>otra puede incluir valores negativos.</li>
</ul>

<p>
Cuando estos datos se introducen directamente en una red neuronal:
</p>

<ul class="org-ul">
<li>los gradientes asociados a variables de gran escala dominan la actualización de los pesos,</li>
<li>las funciones de activación pueden saturarse,</li>
<li>el descenso por gradiente se vuelve lento o errático.</li>
</ul>

<p>
La normalización busca homogeneizar la escala de las entradas,
permitiendo que todas las características contribuyan de manera
equilibrada al aprendizaje.
</p>


<p>
Una de las técnicas más utilizadas es la estandarización, implementada
en scikit-learn mediante la clase StandardScaler.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">scaler</span> = StandardScaler<span style="color: #707183;">()</span>
<span style="color: #a0522d;">X_train</span> = scaler.fit_transform<span style="color: #707183;">(</span>X_train<span style="color: #707183;">)</span> <span style="color: #a0522d;">X_test</span> = scaler.transform<span style="color: #707183;">(</span>X_test<span style="color: #707183;">)</span>
</pre>
</div>

<p>
Este procedimiento transforma cada característica \(x\) según la siguiente expresión:
</p>

<p>
\[
x' = \frac{x - \mu}{\sigma}
\]
</p>

<p>
donde:
</p>

<ul class="org-ul">
<li>\( \mu \) es la media de la característica,</li>
<li>\( \sigma \) es la desviación estándar de la característica.</li>
</ul>

<p>
Como resultado de esta transformación, cada variable queda con:
</p>

<ul class="org-ul">
<li>media aproximadamente igual a 0,</li>
<li>desviación estándar igual a 1.</li>
</ul>
</div>
</div>
<div id="outline-container-org6433828" class="outline-3">
<h3 id="org6433828">Definir el Perceptrón Multicapa (MLP)</h3>
<div class="outline-text-3" id="text-org6433828">
<p>
El siguiente fragmento de código define un <b>Perceptrón Multicapa</b> (Multilayer Perceptron, MLP)
para un problema de clasificación multiclase, utilizando la implementación provista por
la biblioteca <b>scikit-learn</b>.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">mlp</span> = MLPClassifier<span style="color: #707183;">(</span>
<span style="background-color: #f2f2f2;"> </span>   hidden_layer_sizes=<span style="color: #7388d6;">(</span>10, 10<span style="color: #7388d6;">)</span>,
<span style="background-color: #f2f2f2;"> </span>   activation=<span style="color: #8b2252;">'relu'</span>,
<span style="background-color: #f2f2f2;"> </span>   solver=<span style="color: #8b2252;">'adam'</span>,
<span style="background-color: #f2f2f2;"> </span>   learning_rate_init=0.001,
<span style="background-color: #f2f2f2;"> </span>   max_iter=2000,
<span style="background-color: #f2f2f2;"> </span>   random_state=42
<span style="color: #707183;">)</span>
</pre>
</div>

<p>
Este modelo corresponde a una red neuronal <b>feedforward completamente conectada</b>,
entrenada mediante <b>backpropagation</b> y optimizada usando métodos de descenso por gradiente.
</p>
</div>
<div id="outline-container-org3730d02" class="outline-4">
<h4 id="org3730d02">Arquitectura de la red neuronal</h4>
<div class="outline-text-4" id="text-org3730d02">
<p>
La arquitectura del MLP queda determinada por el número de características de entrada,
las capas ocultas definidas explícitamente y el número de neuronas en la capa de salida.
</p>
</div>
</div>
<div id="outline-container-orgb5fb5e7" class="outline-4">
<h4 id="orgb5fb5e7">Capa de entrada</h4>
<div class="outline-text-4" id="text-orgb5fb5e7">
<ul class="org-ul">
<li>La capa de entrada está compuesta por <b>4 neuronas</b>.</li>
<li>Cada neurona representa una característica del vector de entrada.</li>
<li>Esta capa no aplica transformaciones, únicamente propaga los valores hacia la primera capa oculta.</li>
</ul>

<p>
Formalmente, el vector de entrada se expresa como:
</p>

<p>
\[
\mathbf{x} = (x_1, x_2, x_3, x_4)
\]
</p>
</div>
</div>
<div id="outline-container-org63eaffa" class="outline-4">
<h4 id="org63eaffa">Capas ocultas</h4>
<div class="outline-text-4" id="text-org63eaffa">
<p>
El parámetro:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">hidden_layer_sizes</span>=<span style="color: #707183;">(</span>10, 10<span style="color: #707183;">)</span>
</pre>
</div>

<p>
define <b>dos capas ocultas</b>, cada una con <b>10 neuronas</b>.
</p>

<p>
Características principales:
</p>

<ul class="org-ul">
<li>Son capas <b>densas (fully connected)</b>.</li>
<li>Cada neurona recibe como entrada la salida de <b>todas</b> las neuronas de la capa anterior.</li>
<li>Permiten aprender representaciones no lineales del espacio de características.</li>
</ul>

<p>
Cada capa oculta implementa la transformación:
</p>

<p>
\[
\mathbf{h}^{(l)} = f\left( \mathbf{W}^{(l)} \mathbf{h}^{(l-1)} + \mathbf{b}^{(l)} \right)
\]
</p>

<p>
donde:
</p>

<ul class="org-ul">
<li>\( \mathbf{W}^{(l)} \) es la matriz de pesos,</li>
<li>\( \mathbf{b}^{(l)} \) es el vector de sesgos,</li>
<li>\( f(\cdot) \) es la función de activación.</li>
</ul>
</div>
</div>
<div id="outline-container-org22e573d" class="outline-4">
<h4 id="org22e573d">Función de activación</h4>
<div class="outline-text-4" id="text-org22e573d">
<p>
El parámetro:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">activation</span>=<span style="color: #8b2252;">'relu'</span>
</pre>
</div>

<p>
indica el uso de la función <b>ReLU (Rectified Linear Unit)</b>, definida como:
</p>

<p>
\[
\text{ReLU}(z) = \max(0, z)
\]
</p>

<p>
Esta función se utiliza porque:
</p>

<ul class="org-ul">
<li>introduce no linealidad,</li>
<li>reduce el problema del <b>vanishing gradient</b>,</li>
<li>mejora la estabilidad del entrenamiento,</li>
<li>es computacionalmente eficiente.</li>
</ul>
</div>
</div>
<div id="outline-container-org0e249b3" class="outline-4">
<h4 id="org0e249b3">Capa de salida</h4>
<div class="outline-text-4" id="text-org0e249b3">
<ul class="org-ul">
<li>La capa de salida está compuesta por <b>3 neuronas</b>.</li>
<li>Cada neurona corresponde a una de las clases del problema.</li>
<li>Internamente, el modelo utiliza una función <b>softmax</b> para obtener probabilidades.</li>
</ul>

<p>
La clase predicha se obtiene mediante la operación <b>argmax</b> sobre las salidas.
</p>
</div>
</div>
<div id="outline-container-org828ab5a" class="outline-4">
<h4 id="org828ab5a">Entrenamiento del modelo</h4>
<div class="outline-text-4" id="text-org828ab5a">
<p>
El entrenamiento se realiza mediante el optimizador <b>Adam</b>:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">solver</span>=<span style="color: #8b2252;">'adam'</span>
</pre>
</div>

<p>
Adam combina:
</p>
<ul class="org-ul">
<li>momentum</li>
<li>tasas de aprendizaje adaptativas</li>
</ul>

<p>
lo que permite una convergencia más rápida y estable en redes con múltiples capas.
</p>

<p>
La tasa de aprendizaje inicial se define como:
</p>

<p>
\[
\eta = 0.001
\]
</p>

<p>
controlando el tamaño de los pasos durante la actualización de los pesos.
</p>
</div>
</div>
</div>
<div id="outline-container-orge103146" class="outline-3">
<h3 id="orge103146">Número de iteraciones</h3>
<div class="outline-text-3" id="text-orge103146">
<p>
El parámetro:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">max_iter</span>=2000
</pre>
</div>

<p>
establece el número máximo de épocas de entrenamiento.
Una época corresponde a un pase completo sobre el conjunto de entrenamiento.
</p>

<p>
Un número elevado de épocas favorece la convergencia, aunque incrementa el riesgo de <b>overfitting</b>.
</p>
</div>
</div>
<div id="outline-container-orge20e603" class="outline-3">
<h3 id="orge20e603">Reproducibilidad</h3>
<div class="outline-text-3" id="text-orge20e603">
<p>
El parámetro:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">random_state</span>=42
</pre>
</div>

<p>
fija la semilla del generador de números aleatorios, garantizando resultados reproducibles
en la inicialización de los pesos y el proceso de entrenamiento.
</p>
</div>
</div>
<div id="outline-container-org6e589ec" class="outline-3">
<h3 id="org6e589ec">Entrenamiento del modelo</h3>
<div class="outline-text-3" id="text-org6e589ec">
<p>
El entrenamiento deñ Perceptrón Multicapa (MLP) consiste en ajustar
los pesos y sesgos de la red para minimizar el error de predicción
sobre los datos de entrenamiento.
</p>

<div class="org-src-container">
<pre class="src src-python">mlp.fit<span style="color: #707183;">(</span>X_train, y_train<span style="color: #707183;">)</span>
</pre>
</div>

<p>
Durante este proceso ocurren los siguientes pasos fundamentales:
</p>
</div>
<div id="outline-container-org7fec327" class="outline-4">
<h4 id="org7fec327">Propagación hacia adelante (forward pass)</h4>
<div class="outline-text-4" id="text-org7fec327">
<p>
Cada muestra de entrada x atraviesa la red capa por capa.
</p>

<p>
En cada neurona se calcula una combinación lineal y se aplica una función de activación.
</p>

<p>
Se obtiene una salida y que representa la predicción del modelo.
</p>
</div>
</div>
