readme.org
*** Cálculo del error

La salida predicha se compara con la etiqueta real 𝑦.
Se utiliza una función de pérdida (por ejemplo, log-loss para clasificación multiclase).

*** Backpropagation

El error se propaga desde la capa de salida hacia las capas
anteriores. Se calculan los gradientes del error respecto a cada peso
y sesgo. Se aplica la regla de la cadena del cálculo diferencial.

*** Descenso de gradiente con Adam

- Adam combina Momentum y RMSProp.
- Ajusta automáticamente la tasa de aprendizaje para cada parámetro.
- Proporciona convergencia rápida y estable.

** Evaluación del modelo

Una vez entrenado el modelo, se evalúa su desempeño usando datos no vistos durante el entrenamiento.

#+begin_src python
y_pred = mlp.predict(X_test)
print("Accuracy:", accuracy_score(y_test, y_pred)) print("\nReporte de clasificación:\n") print(classification_report(y_test, y_pred, target_names=iris.target_names))
#+end_src

*** Métricas utilizadas

- Accuracy: proporción total de predicciones correctas.
- Precision: qué tan confiables son las predicciones positivas.
- Recall: capacidad del modelo para encontrar todos los ejemplos de una clase.
- F1-score: balance entre precisión y recall.

En el dataset Iris, el accuracy suele estar en el rango del 95% al
100%, debido a su baja dimensionalidad y buena separación entre
clases.

** Predicción con una nueva flor

El modelo entrenado puede utilizarse para predecir nuevas muestras.

#+begin_src python

#[largo_sepalo, ancho_sepalo, largo_petalo, ancho_petalo]

flor_nueva = np.array([[5.1, 3.5, 1.4, 0.2]])
#Normalización con el mismo scaler del entrenamiento
flor_nueva = scaler.transform(flor_nueva)
prediccion = mlp.predict(flor_nueva) print("Clase predicha:", iris.target_names[prediccion[0]])
#+end_src

Es fundamental aplicar la misma normalización usada en el entrenamiento para mantener coherencia en las escalas.

** Interpretación matemática del MLP

Cada neurona de la red realiza el siguiente cálculo:

#+begin_example
z = w · x + b a = f(z)
#+end_example

Donde: 𝑤 es el vector de pesos 𝑥 es el vector de entradas 𝑏 es el sesgo (bias) 𝑓
es la función de activación (ReLU en las capas ocultas). La capa de salida utiliza la función Softmax:

#+begin_latex
\text{softmax}(z_i) = \frac{e^{z_i}}{\sum_j e^{z_j}}
#+end_latex

Esto permite interpretar las salidas como probabilidades para cada clase.

* Ejemplo Clasificación de Cáncer de Mama con MLP 

Este apartado muestra un ejemplo completo en Python usando el dataset
*Breast Cancer Wisconsin (Diagnostic)* y un *Perceptrón Multicapa (MLP)*
usando la librería scikit-learn.

El objetivo es clasificar tumores en dos categorías:

- 0 → Maligno
- 1 → Benigno

Este problema es un caso típico de **clasificación binaria** en el
ámbito médico, donde es crucial:

- minimizar falsos negativos (tumor maligno clasificado como benigno),
- mantener una buena precisión general del modelo.

** Importar librerías

#+begin_src python
import numpy as np
from sklearn.datasets import load_breast_cancer
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import StandardScaler
from sklearn.neural_network import MLPClassifier
from sklearn.metrics import accuracy_score, classification_report
#+end_src

En este bloque:

- =load_breast_cancer=: carga el dataset de cáncer de mama.
- =train_test_split=: divide en entrenamiento y prueba.
- =StandardScaler=: aplica estandarización a las características.
- =MLPClassifier=: implementa un Perceptrón Multicapa (MLP).
- =accuracy_score= y =classification_report=: permiten evaluar el modelo.

** Cargar el dataset Breast Cancer

#+begin_src python
data = load_breast_cancer()
X = data.data      # Características (569 x 30)
y = data.target    # Etiquetas (569,)

print("Dimensiones de X:", X.shape)
print("Clases numéricas:", np.unique(y))
print("Nombres de clases:", data.target_names)
#+end_src

Este dataset contiene:

- 569 muestras (pacientes).
- 30 características numéricas que describen propiedades de los tumores
  (radio, textura, perímetro, área, suavidad, compacidad, etc.).
- 2 clases:
  - 0 → malignant (maligno)
  - 1 → benign (benigno)

Cada muestra corresponde a una imagen de tejido mamario analizada
digitalmente. Las 30 características se derivan de medidas estadísticas
de la forma, textura y estructura del tumor.

*** Importancia del dominio

En aplicaciones médicas, la interpretación de las predicciones es muy
sensible:

- un *falso negativo* (maligno etiquetado como benigno) puede retrasar
  un diagnóstico crítico;
- un *falso positivo* (benigno etiquetado como maligno) puede generar
  ansiedad y procedimientos innecesarios.

Por ello, además de la *accuracy*, suelen analizarse:

- sensibilidad (*recall*) para la clase “maligno”,
- especificidad,
- matriz de confusión, etc.

