index.html
<div id="outline-container-org28b16b6" class="outline-4">
<h4 id="org28b16b6">Cálculo del error</h4>
<div class="outline-text-4" id="text-org28b16b6">
<p>
La salida predicha se compara con la etiqueta real 𝑦.
Se utiliza una función de pérdida (por ejemplo, log-loss para clasificación multiclase).
</p>
</div>
</div>
<div id="outline-container-orgcec415a" class="outline-4">
<h4 id="orgcec415a">Backpropagation</h4>
<div class="outline-text-4" id="text-orgcec415a">
<p>
El error se propaga desde la capa de salida hacia las capas
anteriores. Se calculan los gradientes del error respecto a cada peso
y sesgo. Se aplica la regla de la cadena del cálculo diferencial.
</p>
</div>
</div>
<div id="outline-container-org0baa450" class="outline-4">
<h4 id="org0baa450">Descenso de gradiente con Adam</h4>
<div class="outline-text-4" id="text-org0baa450">
<ul class="org-ul">
<li>Adam combina Momentum y RMSProp.</li>
<li>Ajusta automáticamente la tasa de aprendizaje para cada parámetro.</li>
<li>Proporciona convergencia rápida y estable.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org121ba4e" class="outline-3">
<h3 id="org121ba4e">Evaluación del modelo</h3>
<div class="outline-text-3" id="text-org121ba4e">
<p>
Una vez entrenado el modelo, se evalúa su desempeño usando datos no vistos durante el entrenamiento.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">y_pred</span> = mlp.predict<span style="color: #707183;">(</span>X_test<span style="color: #707183;">)</span>
<span style="color: #483d8b;">print</span><span style="color: #707183;">(</span><span style="color: #8b2252;">"Accuracy:"</span>, accuracy_score<span style="color: #7388d6;">(</span>y_test, y_pred<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span> <span style="color: #483d8b;">print</span><span style="color: #707183;">(</span><span style="color: #8b2252;">"</span><span style="color: #008b8b;">\n</span><span style="color: #8b2252;">Reporte de clasificaci&#243;n:</span><span style="color: #008b8b;">\n</span><span style="color: #8b2252;">"</span><span style="color: #707183;">)</span> <span style="color: #483d8b;">print</span><span style="color: #707183;">(</span>classification_report<span style="color: #7388d6;">(</span>y_test, y_pred, target_names=iris.target_names<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
<div id="outline-container-org43e7442" class="outline-4">
<h4 id="org43e7442">Métricas utilizadas</h4>
<div class="outline-text-4" id="text-org43e7442">
<ul class="org-ul">
<li>Accuracy: proporción total de predicciones correctas.</li>
<li>Precision: qué tan confiables son las predicciones positivas.</li>
<li>Recall: capacidad del modelo para encontrar todos los ejemplos de una clase.</li>
<li>F1-score: balance entre precisión y recall.</li>
</ul>

<p>
En el dataset Iris, el accuracy suele estar en el rango del 95% al
100%, debido a su baja dimensionalidad y buena separación entre
clases.
</p>
</div>
</div>
</div>
<div id="outline-container-org7842ef7" class="outline-3">
<h3 id="org7842ef7">Predicción con una nueva flor</h3>
<div class="outline-text-3" id="text-org7842ef7">
<p>
El modelo entrenado puede utilizarse para predecir nuevas muestras.
</p>

<div class="org-src-container">
<pre class="src src-python">
<span style="color: #b22222;">#</span><span style="color: #b22222;">[largo_sepalo, ancho_sepalo, largo_petalo, ancho_petalo]
</span>
<span style="color: #a0522d;">flor_nueva</span> = np.array<span style="color: #707183;">(</span><span style="color: #7388d6;">[</span><span style="color: #909183;">[</span>5.1, 3.5, 1.4, 0.2<span style="color: #909183;">]</span><span style="color: #7388d6;">]</span><span style="color: #707183;">)</span>
<span style="color: #b22222;">#</span><span style="color: #b22222;">Normalizaci&#243;n con el mismo scaler del entrenamiento
</span><span style="color: #a0522d;">flor_nueva</span> = scaler.transform<span style="color: #707183;">(</span>flor_nueva<span style="color: #707183;">)</span>
<span style="color: #a0522d;">prediccion</span> = mlp.predict<span style="color: #707183;">(</span>flor_nueva<span style="color: #707183;">)</span> <span style="color: #483d8b;">print</span><span style="color: #707183;">(</span><span style="color: #8b2252;">"Clase predicha:"</span>, iris.target_names<span style="color: #7388d6;">[</span>prediccion<span style="color: #909183;">[</span>0<span style="color: #909183;">]</span><span style="color: #7388d6;">]</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
Es fundamental aplicar la misma normalización usada en el entrenamiento para mantener coherencia en las escalas.
</p>
</div>
</div>
<div id="outline-container-org6c53864" class="outline-3">
<h3 id="org6c53864">Interpretación matemática del MLP</h3>
<div class="outline-text-3" id="text-org6c53864">
<p>
Cada neurona de la red realiza el siguiente cálculo:
</p>

<pre class="example" id="orgfcdd098">
z = w · x + b a = f(z)
</pre>

<p>
Donde: 𝑤 es el vector de pesos 𝑥 es el vector de entradas 𝑏 es el sesgo (bias) 𝑓
es la función de activación (ReLU en las capas ocultas). La capa de salida utiliza la función Softmax:
</p>

<div class="latex" id="org6aeed83">
<p>
\text{softmax}(z<sub>i</sub>) = \frac{e<sup>z<sub>i</sub></sup>}{&sum;<sub>j</sub> e<sup>z<sub>j</sub></sup>}
</p>

</div>

<p>
Esto permite interpretar las salidas como probabilidades para cada clase.
</p>
</div>
</div>
</div>
<div id="outline-container-org301fabc" class="outline-2">
<h2 id="org301fabc">Ejemplo Clasificación de Cáncer de Mama con MLP</h2>
<div class="outline-text-2" id="text-org301fabc">
<p>
Este apartado muestra un ejemplo completo en Python usando el dataset
<b>Breast Cancer Wisconsin (Diagnostic)</b> y un <b>Perceptrón Multicapa (MLP)</b>
usando la librería scikit-learn.
</p>

<p>
El objetivo es clasificar tumores en dos categorías:
</p>

<ul class="org-ul">
<li>0 → Maligno</li>
<li>1 → Benigno</li>
</ul>

<p>
Este problema es un caso típico de <b><b>clasificación binaria</b></b> en el
ámbito médico, donde es crucial:
</p>

<ul class="org-ul">
<li>minimizar falsos negativos (tumor maligno clasificado como benigno),</li>
<li>mantener una buena precisión general del modelo.</li>
</ul>
</div>
<div id="outline-container-org5462d3d" class="outline-3">
<h3 id="org5462d3d">Importar librerías</h3>
<div class="outline-text-3" id="text-org5462d3d">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #a020f0;">import</span> numpy <span style="color: #a020f0;">as</span> np
<span style="color: #a020f0;">from</span> sklearn.datasets <span style="color: #a020f0;">import</span> load_breast_cancer
<span style="color: #a020f0;">from</span> sklearn.model_selection <span style="color: #a020f0;">import</span> train_test_split
<span style="color: #a020f0;">from</span> sklearn.preprocessing <span style="color: #a020f0;">import</span> StandardScaler
<span style="color: #a020f0;">from</span> sklearn.neural_network <span style="color: #a020f0;">import</span> MLPClassifier
<span style="color: #a020f0;">from</span> sklearn.metrics <span style="color: #a020f0;">import</span> accuracy_score, classification_report
</pre>
</div>

<p>
En este bloque:
</p>

<ul class="org-ul">
<li><code>load_breast_cancer</code>: carga el dataset de cáncer de mama.</li>
<li><code>train_test_split</code>: divide en entrenamiento y prueba.</li>
<li><code>StandardScaler</code>: aplica estandarización a las características.</li>
<li><code>MLPClassifier</code>: implementa un Perceptrón Multicapa (MLP).</li>
<li><code>accuracy_score</code> y <code>classification_report</code>: permiten evaluar el modelo.</li>
</ul>
</div>
</div>
<div id="outline-container-org807d152" class="outline-3">
<h3 id="org807d152">Cargar el dataset Breast Cancer</h3>
<div class="outline-text-3" id="text-org807d152">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">data</span> = load_breast_cancer<span style="color: #707183;">()</span>
<span style="color: #a0522d;">X</span> = data.data      <span style="color: #b22222;"># </span><span style="color: #b22222;">Caracter&#237;sticas (569 x 30)
</span><span style="color: #a0522d;">y</span> = data.target    <span style="color: #b22222;"># </span><span style="color: #b22222;">Etiquetas (569,)
</span>
<span style="color: #483d8b;">print</span><span style="color: #707183;">(</span><span style="color: #8b2252;">"Dimensiones de X:"</span>, X.shape<span style="color: #707183;">)</span>
<span style="color: #483d8b;">print</span><span style="color: #707183;">(</span><span style="color: #8b2252;">"Clases num&#233;ricas:"</span>, np.unique<span style="color: #7388d6;">(</span>y<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #483d8b;">print</span><span style="color: #707183;">(</span><span style="color: #8b2252;">"Nombres de clases:"</span>, data.target_names<span style="color: #707183;">)</span>
</pre>
</div>

<p>
Este dataset contiene:
</p>

<ul class="org-ul">
<li>569 muestras (pacientes).</li>
<li>30 características numéricas que describen propiedades de los tumores
(radio, textura, perímetro, área, suavidad, compacidad, etc.).</li>
<li>2 clases:
<ul class="org-ul">
<li>0 → malignant (maligno)</li>
<li>1 → benign (benigno)</li>
</ul></li>
</ul>

<p>
Cada muestra corresponde a una imagen de tejido mamario analizada
digitalmente. Las 30 características se derivan de medidas estadísticas
de la forma, textura y estructura del tumor.
</p>
</div>
<div id="outline-container-org01fd31f" class="outline-4">
<h4 id="org01fd31f">Importancia del dominio</h4>
<div class="outline-text-4" id="text-org01fd31f">
<p>
En aplicaciones médicas, la interpretación de las predicciones es muy
sensible:
</p>

<ul class="org-ul">
<li>un <b>falso negativo</b> (maligno etiquetado como benigno) puede retrasar
un diagnóstico crítico;</li>
<li>un <b>falso positivo</b> (benigno etiquetado como maligno) puede generar
ansiedad y procedimientos innecesarios.</li>
</ul>

<p>
Por ello, además de la <b>accuracy</b>, suelen analizarse:
</p>

<ul class="org-ul">
<li>sensibilidad (<b>recall</b>) para la clase “maligno”,</li>
<li>especificidad,</li>
<li>matriz de confusión, etc.</li>
</ul>
</div>
</div>
</div>
