readme.org
** Partición del conjunto de datos

Dividimos el dataset en entrenamiento y prueba:

#+begin_src python
X_train, X_test, y_train, y_test = train_test_split(
    X,
    y,
    test_size=0.3,
    random_state=42,
    stratify=y
)
#+end_src

*** Significado de los parámetros

- =test_size=0.3=:
  - 30 % de los datos se reservan para el *conjunto de prueba*.
  - 70 % se usan para entrenar el modelo.
  - En este caso:
    - Entrenamiento: ≈ 398 muestras.
    - Prueba: ≈ 171 muestras.

- =random_state=42=:
  - Fija la semilla del generador de números aleatorios.
  - Permite que la partición sea reproducible: el mismo código genera
    siempre la misma división.

- =stratify=y=:
  - Asegura que la proporción de clases (maligno/benigno) sea similar
    tanto en entrenamiento como en prueba.
  - Esto es crucial en problemas médicos, donde el balance de clases
    puede influir fuertemente en las métricas.

*** Propósito de la partición

En aprendizaje automático supervisado:

- El *conjunto de entrenamiento* se usa para ajustar los parámetros
  (pesos y sesgos) del modelo.
- El *conjunto de prueba* se usa *solo* para evaluar la capacidad de
  generalización sobre datos no vistos.

Esta separación es esencial para:

- detectar *overfitting* (el modelo memoriza el entrenamiento pero
  generaliza mal),
- obtener una estimación realista del rendimiento.

** Normalización (Estandarización)

Las características tienen escalas muy diferentes (áreas grandes,
texturas pequeñas, etc.). Esto puede causar:

- problemas numéricos,
- gradientes desbalanceados,
- convergencia lenta o inestable.

Por ello, aplicamos estandarización:

#+begin_src python
scaler = StandardScaler()
X_train = scaler.fit_transform(X_train)
X_test = scaler.transform(X_test)
#+end_src

Este procedimiento transforma cada característica \(x\) según:

#+begin_latex
x' = \frac{x - \mu}{\sigma}
#+end_latex

donde:

- \(\mu\) es la media de la característica calculada sobre el conjunto
  de entrenamiento,
- \(\sigma\) es la desviación estándar de dicha característica.

Después de la transformación:

- cada variable tiene media aproximadamente 0,
- y desviación estándar aproximadamente 1.

*** Importante

- Solo se llama a =fit_transform= en =X_train=:
  - =fit= calcula \(\mu\) y \(\sigma\) usando *solo entrenamiento*.
  - =transform= aplica la transformación.
- Para =X_test= se usa únicamente =transform=:
  - se reescalan los datos de prueba con los mismos parámetros
    (\(\mu\) y \(\sigma\)) obtenidos del entrenamiento.
- Esto evita *filtrar información del conjunto de prueba* hacia el
  proceso de entrenamiento (data leakage).

** Definición del Perceptrón Multicapa (MLP)

Definimos un MLP para clasificación binaria:

#+begin_src python
mlp = MLPClassifier(
    hidden_layer_sizes=(30, 15),
    activation='relu',
    solver='adam',
    max_iter=1000,
    random_state=42
)
#+end_src

*** Arquitectura del modelo

El MLP es una red neuronal *feedforward* completamente conectada.

- *Capa de entrada*:
  - Tiene tantas neuronas como características de entrada: 30.
  - Cada componente del vector \(\mathbf{x} \in \mathbb{R}^{30}\)
    representa una característica del tumor.

- *Capas ocultas*:
  - Primer capa oculta: 30 neuronas.
  - Segunda capa oculta: 15 neuronas.
  - Se especifican con el parámetro:
    #+begin_src python
hidden_layer_sizes = (30, 15)
    #+end_src

  Cada neurona en una capa oculta:
  - recibe como entrada la salida de todas las neuronas de la capa
    anterior (capas densas),
  - aplica una transformación lineal seguida de una función de
    activación no lineal.

- *Capa de salida*:
  - Para clasificación binaria, internamente el MLP de scikit-learn
    puede usar:
    - 1 neurona con activación logística (sigmoide),
    - o una representación equivalente a 2 clases.
  - La salida se interpreta como una probabilidad de pertenecer a la
    clase “1” (benigno).

*** Función de activación ReLU

El parámetro:

#+begin_src python
activation = 'relu'
#+end_src

indica el uso de la función *ReLU (Rectified Linear Unit)* en las capas
ocultas:

#+begin_latex
\text{ReLU}(z) = \max(0, z)
#+end_latex

Ventajas de ReLU:

- Introduce no linealidad (permite aproximar funciones no lineales).
- Reduce el problema del *vanishing gradient* en comparación con
  funciones como sigmoide o tanh.
- Es simple y eficiente de calcular.

*** Optimizador Adam

El parámetro:

#+begin_src python
solver = 'adam'
#+end_src

selecciona el optimizador *Adam* (Adaptive Moment Estimation), que:

- combina ideas de Momentum y RMSProp,
- mantiene promedios móviles de:
  - los gradientes,
  - los gradientes al cuadrado,
- adapta la tasa de aprendizaje para cada parámetro.

Esto suele producir:

- convergencia rápida,
- estabilidad numérica,
- buen desempeño sin necesidad de mucha sintonía manual.

*** Número máximo de iteraciones

#+begin_src python
max_iter = 1000
#+end_src

- Indica el número máximo de épocas (o iteraciones sobre los datos)
  para entrenar la red.
- Un valor alto permite que el modelo converja, aunque si es excesivo
  puede aumentar el riesgo de *overfitting* (la red se ajusta demasiado
  al entrenamiento).

*** Reproducibilidad

#+begin_src python
random_state = 42
#+end_src

- Fija la semilla para la inicialización de pesos y el muestreo interno.
- Permite reproducir exactamente los mismos resultados entre ejecuciones.

