index.html
<div id="outline-container-orgcb899b9" class="outline-3">
<h3 id="orgcb899b9">Partición del conjunto de datos</h3>
<div class="outline-text-3" id="text-orgcb899b9">
<p>
Dividimos el dataset en entrenamiento y prueba:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">X_train</span>, <span style="color: #a0522d;">X_test</span>, <span style="color: #a0522d;">y_train</span>, <span style="color: #a0522d;">y_test</span> = train_test_split<span style="color: #707183;">(</span>
<span style="background-color: #f2f2f2;"> </span>   X,
<span style="background-color: #f2f2f2;"> </span>   y,
<span style="background-color: #f2f2f2;"> </span>   test_size=0.3,
<span style="background-color: #f2f2f2;"> </span>   random_state=42,
<span style="background-color: #f2f2f2;"> </span>   stratify=y
<span style="color: #707183;">)</span>
</pre>
</div>
</div>
<div id="outline-container-orgfd2a90d" class="outline-4">
<h4 id="orgfd2a90d">Significado de los parámetros</h4>
<div class="outline-text-4" id="text-orgfd2a90d">
<ul class="org-ul">
<li><code>test_size=0.3</code>:
<ul class="org-ul">
<li>30 % de los datos se reservan para el <b>conjunto de prueba</b>.</li>
<li>70 % se usan para entrenar el modelo.</li>
<li>En este caso:
<ul class="org-ul">
<li>Entrenamiento: ≈ 398 muestras.</li>
<li>Prueba: ≈ 171 muestras.</li>
</ul></li>
</ul></li>

<li><code>random_state=42</code>:
<ul class="org-ul">
<li>Fija la semilla del generador de números aleatorios.</li>
<li>Permite que la partición sea reproducible: el mismo código genera
siempre la misma división.</li>
</ul></li>

<li><code>stratify=y</code>:
<ul class="org-ul">
<li>Asegura que la proporción de clases (maligno/benigno) sea similar
tanto en entrenamiento como en prueba.</li>
<li>Esto es crucial en problemas médicos, donde el balance de clases
puede influir fuertemente en las métricas.</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgf8e5d55" class="outline-4">
<h4 id="orgf8e5d55">Propósito de la partición</h4>
<div class="outline-text-4" id="text-orgf8e5d55">
<p>
En aprendizaje automático supervisado:
</p>

<ul class="org-ul">
<li>El <b>conjunto de entrenamiento</b> se usa para ajustar los parámetros
(pesos y sesgos) del modelo.</li>
<li>El <b>conjunto de prueba</b> se usa <b>solo</b> para evaluar la capacidad de
generalización sobre datos no vistos.</li>
</ul>

<p>
Esta separación es esencial para:
</p>

<ul class="org-ul">
<li>detectar <b>overfitting</b> (el modelo memoriza el entrenamiento pero
generaliza mal),</li>
<li>obtener una estimación realista del rendimiento.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org387d5ce" class="outline-3">
<h3 id="org387d5ce">Normalización (Estandarización)</h3>
<div class="outline-text-3" id="text-org387d5ce">
<p>
Las características tienen escalas muy diferentes (áreas grandes,
texturas pequeñas, etc.). Esto puede causar:
</p>

<ul class="org-ul">
<li>problemas numéricos,</li>
<li>gradientes desbalanceados,</li>
<li>convergencia lenta o inestable.</li>
</ul>

<p>
Por ello, aplicamos estandarización:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">scaler</span> = StandardScaler<span style="color: #707183;">()</span>
<span style="color: #a0522d;">X_train</span> = scaler.fit_transform<span style="color: #707183;">(</span>X_train<span style="color: #707183;">)</span>
<span style="color: #a0522d;">X_test</span> = scaler.transform<span style="color: #707183;">(</span>X_test<span style="color: #707183;">)</span>
</pre>
</div>

<p>
Este procedimiento transforma cada característica \(x\) según:
</p>

<div class="latex" id="orgf3a852d">
<p>
x' = \frac{x - \mu}{\sigma}
</p>

</div>

<p>
donde:
</p>

<ul class="org-ul">
<li>\(\mu\) es la media de la característica calculada sobre el conjunto
de entrenamiento,</li>
<li>\(\sigma\) es la desviación estándar de dicha característica.</li>
</ul>

<p>
Después de la transformación:
</p>

<ul class="org-ul">
<li>cada variable tiene media aproximadamente 0,</li>
<li>y desviación estándar aproximadamente 1.</li>
</ul>
</div>
<div id="outline-container-org9d1cac6" class="outline-4">
<h4 id="org9d1cac6">Importante</h4>
<div class="outline-text-4" id="text-org9d1cac6">
<ul class="org-ul">
<li>Solo se llama a <code>fit_transform</code> en <code>X_train</code>:
<ul class="org-ul">
<li><code>fit</code> calcula \(\mu\) y \(\sigma\) usando <b>solo entrenamiento</b>.</li>
<li><code>transform</code> aplica la transformación.</li>
</ul></li>
<li>Para <code>X_test</code> se usa únicamente <code>transform</code>:
<ul class="org-ul">
<li>se reescalan los datos de prueba con los mismos parámetros
(\(\mu\) y \(\sigma\)) obtenidos del entrenamiento.</li>
</ul></li>
<li>Esto evita <b>filtrar información del conjunto de prueba</b> hacia el
proceso de entrenamiento (data leakage).</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org1aff302" class="outline-3">
<h3 id="org1aff302">Definición del Perceptrón Multicapa (MLP)</h3>
<div class="outline-text-3" id="text-org1aff302">
<p>
Definimos un MLP para clasificación binaria:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">mlp</span> = MLPClassifier<span style="color: #707183;">(</span>
<span style="background-color: #f2f2f2;"> </span>   hidden_layer_sizes=<span style="color: #7388d6;">(</span>30, 15<span style="color: #7388d6;">)</span>,
<span style="background-color: #f2f2f2;"> </span>   activation=<span style="color: #8b2252;">'relu'</span>,
<span style="background-color: #f2f2f2;"> </span>   solver=<span style="color: #8b2252;">'adam'</span>,
<span style="background-color: #f2f2f2;"> </span>   max_iter=1000,
<span style="background-color: #f2f2f2;"> </span>   random_state=42
<span style="color: #707183;">)</span>
</pre>
</div>
</div>
<div id="outline-container-org5d317ee" class="outline-4">
<h4 id="org5d317ee">Arquitectura del modelo</h4>
<div class="outline-text-4" id="text-org5d317ee">
<p>
El MLP es una red neuronal <b>feedforward</b> completamente conectada.
</p>

<ul class="org-ul">
<li><b>Capa de entrada</b>:
<ul class="org-ul">
<li>Tiene tantas neuronas como características de entrada: 30.</li>
<li>Cada componente del vector \(\mathbf{x} \in \mathbb{R}^{30}\)
representa una característica del tumor.</li>
</ul></li>

<li><p>
<b>Capas ocultas</b>:
</p>
<ul class="org-ul">
<li>Primer capa oculta: 30 neuronas.</li>
<li>Segunda capa oculta: 15 neuronas.</li>
<li><p>
Se especifican con el parámetro:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">hidden_layer_sizes</span> = <span style="color: #707183;">(</span>30, 15<span style="color: #707183;">)</span>
</pre>
</div></li>
</ul>

<p>
Cada neurona en una capa oculta:
</p>
<ul class="org-ul">
<li>recibe como entrada la salida de todas las neuronas de la capa
anterior (capas densas),</li>
<li>aplica una transformación lineal seguida de una función de
activación no lineal.</li>
</ul></li>

<li><b>Capa de salida</b>:
<ul class="org-ul">
<li>Para clasificación binaria, internamente el MLP de scikit-learn
puede usar:
<ul class="org-ul">
<li>1 neurona con activación logística (sigmoide),</li>
<li>o una representación equivalente a 2 clases.</li>
</ul></li>
<li>La salida se interpreta como una probabilidad de pertenecer a la
clase “1” (benigno).</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org7269d85" class="outline-4">
<h4 id="org7269d85">Función de activación ReLU</h4>
<div class="outline-text-4" id="text-org7269d85">
<p>
El parámetro:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">activation</span> = <span style="color: #8b2252;">'relu'</span>
</pre>
</div>

<p>
indica el uso de la función <b>ReLU (Rectified Linear Unit)</b> en las capas
ocultas:
</p>

<div class="latex" id="orgc4ee903">
<p>
\text{ReLU}(z) = max(0, z)
</p>

</div>

<p>
Ventajas de ReLU:
</p>

<ul class="org-ul">
<li>Introduce no linealidad (permite aproximar funciones no lineales).</li>
<li>Reduce el problema del <b>vanishing gradient</b> en comparación con
funciones como sigmoide o tanh.</li>
<li>Es simple y eficiente de calcular.</li>
</ul>
</div>
</div>
<div id="outline-container-org3d3fc36" class="outline-4">
<h4 id="org3d3fc36">Optimizador Adam</h4>
<div class="outline-text-4" id="text-org3d3fc36">
<p>
El parámetro:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">solver</span> = <span style="color: #8b2252;">'adam'</span>
</pre>
</div>

<p>
selecciona el optimizador <b>Adam</b> (Adaptive Moment Estimation), que:
</p>

<ul class="org-ul">
<li>combina ideas de Momentum y RMSProp,</li>
<li>mantiene promedios móviles de:
<ul class="org-ul">
<li>los gradientes,</li>
<li>los gradientes al cuadrado,</li>
</ul></li>
<li>adapta la tasa de aprendizaje para cada parámetro.</li>
</ul>

<p>
Esto suele producir:
</p>

<ul class="org-ul">
<li>convergencia rápida,</li>
<li>estabilidad numérica,</li>
<li>buen desempeño sin necesidad de mucha sintonía manual.</li>
</ul>
</div>
</div>
<div id="outline-container-orgf9cbc31" class="outline-4">
<h4 id="orgf9cbc31">Número máximo de iteraciones</h4>
<div class="outline-text-4" id="text-orgf9cbc31">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">max_iter</span> = 1000
</pre>
</div>

<ul class="org-ul">
<li>Indica el número máximo de épocas (o iteraciones sobre los datos)
para entrenar la red.</li>
<li>Un valor alto permite que el modelo converja, aunque si es excesivo
puede aumentar el riesgo de <b>overfitting</b> (la red se ajusta demasiado
al entrenamiento).</li>
</ul>
</div>
</div>
<div id="outline-container-org394ef21" class="outline-4">
<h4 id="org394ef21">Reproducibilidad</h4>
<div class="outline-text-4" id="text-org394ef21">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">random_state</span> = 42
</pre>
</div>

<ul class="org-ul">
<li>Fija la semilla para la inicialización de pesos y el muestreo interno.</li>
<li>Permite reproducir exactamente los mismos resultados entre ejecuciones.</li>
</ul>
</div>
</div>
</div>
