readme.org
** Entrenamiento del modelo

Entrenamos el MLP ajustando pesos y sesgos para minimizar el error de
clasificación en el conjunto de entrenamiento:

#+begin_src python
mlp.fit(X_train, y_train)
#+end_src

*** Proceso interno (visión conceptual)

1. *Propagación hacia adelante*:
   - Cada muestra \(\mathbf{x}\) pasa por las capas:
     \[
       \mathbf{h}^{(1)} = f_1(W^{(1)} \mathbf{x} + \mathbf{b}^{(1)})
     \]
     \[
       \mathbf{h}^{(2)} = f_2(W^{(2)} \mathbf{h}^{(1)} + \mathbf{b}^{(2)})
     \]
     \[
       \hat{y} = \sigma(W^{(3)} \mathbf{h}^{(2)} + \mathbf{b}^{(3)})
     \]
   - \(\hat{y}\) es la probabilidad estimada de que el tumor sea benigno
     (clase 1).

2. *Cálculo del error*:
   - La salida \(\hat{y}\) se compara con la etiqueta real \(y \in \{0, 1\}\).
   - En problemas binarios, se usa típicamente la *entropía cruzada
     binaria* (o log-loss):
     \[
       L(y, \hat{y}) = -\left[y \log(\hat{y}) + (1 - y)\log(1 - \hat{y})\right]
     \]

3. *Backpropagation*:
   - Se calculan las derivadas parciales de la pérdida con respecto a
     todos los pesos y sesgos mediante la regla de la cadena.
   - Se propaga el error desde la capa de salida hacia las capas
     ocultas.

4. *Actualización de pesos*:
   - El optimizador Adam actualiza cada parámetro en la dirección que
     reduce la pérdida:
     \[
       \theta \leftarrow \theta - \eta \cdot \hat{g}
     \]
     donde \(\hat{g}\) es una versión adaptada del gradiente, y
     \(\eta\) la tasa de aprendizaje efectiva.

** Evaluación del modelo

Una vez entrenado, evaluamos el modelo sobre el conjunto de prueba:

#+begin_src python
# Predicción
y_pred = mlp.predict(X_test)

# Métricas
print("Accuracy:", accuracy_score(y_test, y_pred))
print("\nReporte de clasificación:\n")
print(classification_report(y_test, y_pred, target_names=data.target_names))
#+end_src

*** Métricas principales

- *Accuracy*:
  - Proporción de predicciones correctas:
    \[
      \text{Accuracy} = \frac{\text{número de aciertos}}{\text{número total de muestras}}
    \]
- *Precision*:
  - De todos los ejemplos predichos como positivos, qué fracción son
    realmente positivos.
  - Importante para evitar falsos positivos.

- *Recall (Sensibilidad)*:
  - De todos los ejemplos realmente positivos, qué fracción se detecta
    correctamente.
  - En diagnóstico médico, el recall para la clase “maligno” es crítico
    (minimizar falsos negativos).

- *F1-score*:
  - Media armónica de precision y recall:
    \[
      F1 = 2 \cdot \frac{\text{precision} \cdot \text{recall}}{\text{precision} + \text{recall}}
    \]
  - Útil cuando hay cierto desbalance entre clases.

El dataset Breast Cancer suele producir *accuracy* muy altas (por
encima de 95 %) con modelos bien entrenados, debido a que las
características están relativamente bien separadas.

** Interpretación matemática de la salida binaria

En este modelo binario, la capa de salida puede verse como una neurona
con activación *sigmoide (logística)*:

#+begin_latex
\sigma(z) = \frac{1}{1 + e^{-z}}
#+end_latex

donde:

- \(z = \mathbf{w} \cdot \mathbf{h} + b\),
- \(\mathbf{h}\) es el vector de activaciones de la última capa oculta.

La salida \(\sigma(z)\) se interpreta como:

- \(\sigma(z) \approx 1\): alta probabilidad de clase 1 (benigno),
- \(\sigma(z) \approx 0\): alta probabilidad de clase 0 (maligno).

En scikit-learn, la predicción de clase se realiza típicamente como:

- Si \(\sigma(z) \geq 0.5\) → clase 1 (benigno).
- Si \(\sigma(z) < 0.5\) → clase 0 (maligno).

Este umbral puede modificarse en contextos médicos, por ejemplo:

- usar un umbral menor que 0.5 para aumentar la sensibilidad a tumores
  malignos (aceptando más falsos positivos).

** Predicción de una nueva muestra

Podemos usar el modelo entrenado para predecir el diagnóstico de un
nuevo paciente.

En este ejemplo, tomamos la primera muestra del set de prueba (ya
normalizada) y realizamos la predicción:

#+begin_src python
# Ejemplo con la primera fila del set de prueba
nuevo_paciente = X_test[0:1]     # forma (1, 30)
pred = mlp.predict(nuevo_paciente)
print("Resultado del diagnóstico:", data.target_names[pred[0]])
#+end_src

*** Comentarios importantes

- Es fundamental que la nueva muestra haya sido procesada con el mismo:

  1. Conjunto de características (mismas columnas y orden).
  2. Mismo procedimiento de normalización (mismo =scaler=, con las
     medias y desviaciones aprendidas en el entrenamiento).

- En la práctica, se suele:

  - guardar el modelo entrenado (por ejemplo con =joblib=),
  - guardar también el objeto =StandardScaler=,
  - aplicar ambos de manera coherente a los nuevos datos.

** Resumen conceptual

Este ejemplo ilustra varios conceptos clave en el uso de redes
neuronales (MLP) para clasificación binaria en un contexto médico:

- Importancia de:
  - Partición entrenamiento/prueba estratificada.
  - Normalización de características.
  - Arquitectura de red (capas y neuronas).
  - Función de activación (ReLU).
  - Optimizador (Adam) y número de iteraciones.

- Interpretación de la salida:
  - Probabilidad generada por una función sigmoide.
  - Decisión de clase basada en un umbral.

- Evaluación:
  - No basta con accuracy: hay que considerar precision, recall y F1,
    especialmente para la clase de interés (por ejemplo, “maligno”).

Este mismo flujo (carga, partición, normalización, definición de modelo,
entrenamiento, evaluación, predicción) puede adaptarse a otros modelos
(árboles, SVM, LSTM, etc.) y a otros datasets de clasificación binaria
o multiclase.


