index.html
<div id="outline-container-orgb9a0145" class="outline-3">
<h3 id="orgb9a0145">Entrenamiento del modelo</h3>
<div class="outline-text-3" id="text-orgb9a0145">
<p>
Entrenamos el MLP ajustando pesos y sesgos para minimizar el error de
clasificación en el conjunto de entrenamiento:
</p>

<div class="org-src-container">
<pre class="src src-python">mlp.fit<span style="color: #707183;">(</span>X_train, y_train<span style="color: #707183;">)</span>
</pre>
</div>
</div>
<div id="outline-container-orgfaf18f7" class="outline-4">
<h4 id="orgfaf18f7">Proceso interno (visión conceptual)</h4>
<div class="outline-text-4" id="text-orgfaf18f7">
<ol class="org-ol">
<li><b>Propagación hacia adelante</b>:
<ul class="org-ul">
<li>Cada muestra \(\mathbf{x}\) pasa por las capas:
\[
       \mathbf{h}^{(1)} = f_1(W^{(1)} \mathbf{x} + \mathbf{b}^{(1)})
     \]
\[
       \mathbf{h}^{(2)} = f_2(W^{(2)} \mathbf{h}^{(1)} + \mathbf{b}^{(2)})
     \]
\[
       \hat{y} = \sigma(W^{(3)} \mathbf{h}^{(2)} + \mathbf{b}^{(3)})
     \]</li>
<li>\(\hat{y}\) es la probabilidad estimada de que el tumor sea benigno
(clase 1).</li>
</ul></li>

<li><b>Cálculo del error</b>:
<ul class="org-ul">
<li>La salida \(\hat{y}\) se compara con la etiqueta real \(y \in \{0, 1\}\).</li>
<li>En problemas binarios, se usa típicamente la <b>entropía cruzada
binaria</b> (o log-loss):
\[
       L(y, \hat{y}) = -\left[y \log(\hat{y}) + (1 - y)\log(1 - \hat{y})\right]
     \]</li>
</ul></li>

<li><b>Backpropagation</b>:
<ul class="org-ul">
<li>Se calculan las derivadas parciales de la pérdida con respecto a
todos los pesos y sesgos mediante la regla de la cadena.</li>
<li>Se propaga el error desde la capa de salida hacia las capas
ocultas.</li>
</ul></li>

<li><b>Actualización de pesos</b>:
<ul class="org-ul">
<li>El optimizador Adam actualiza cada parámetro en la dirección que
reduce la pérdida:
\[
       \theta \leftarrow \theta - \eta \cdot \hat{g}
     \]
donde \(\hat{g}\) es una versión adaptada del gradiente, y
\(\eta\) la tasa de aprendizaje efectiva.</li>
</ul></li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org145d8c8" class="outline-3">
<h3 id="org145d8c8">Evaluación del modelo</h3>
<div class="outline-text-3" id="text-org145d8c8">
<p>
Una vez entrenado, evaluamos el modelo sobre el conjunto de prueba:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #b22222;"># </span><span style="color: #b22222;">Predicci&#243;n
</span><span style="color: #a0522d;">y_pred</span> = mlp.predict<span style="color: #707183;">(</span>X_test<span style="color: #707183;">)</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">M&#233;tricas
</span><span style="color: #483d8b;">print</span><span style="color: #707183;">(</span><span style="color: #8b2252;">"Accuracy:"</span>, accuracy_score<span style="color: #7388d6;">(</span>y_test, y_pred<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #483d8b;">print</span><span style="color: #707183;">(</span><span style="color: #8b2252;">"</span><span style="color: #008b8b;">\n</span><span style="color: #8b2252;">Reporte de clasificaci&#243;n:</span><span style="color: #008b8b;">\n</span><span style="color: #8b2252;">"</span><span style="color: #707183;">)</span>
<span style="color: #483d8b;">print</span><span style="color: #707183;">(</span>classification_report<span style="color: #7388d6;">(</span>y_test, y_pred, target_names=data.target_names<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
<div id="outline-container-org629df3e" class="outline-4">
<h4 id="org629df3e">Métricas principales</h4>
<div class="outline-text-4" id="text-org629df3e">
<ul class="org-ul">
<li><b>Accuracy</b>:
<ul class="org-ul">
<li>Proporción de predicciones correctas:
\[
      \text{Accuracy} = \frac{\text{número de aciertos}}{\text{número total de muestras}}
    \]</li>
</ul></li>
<li><b>Precision</b>:
<ul class="org-ul">
<li>De todos los ejemplos predichos como positivos, qué fracción son
realmente positivos.</li>
<li>Importante para evitar falsos positivos.</li>
</ul></li>

<li><b>Recall (Sensibilidad)</b>:
<ul class="org-ul">
<li>De todos los ejemplos realmente positivos, qué fracción se detecta
correctamente.</li>
<li>En diagnóstico médico, el recall para la clase “maligno” es crítico
(minimizar falsos negativos).</li>
</ul></li>

<li><b>F1-score</b>:
<ul class="org-ul">
<li>Media armónica de precision y recall:
\[
      F1 = 2 \cdot \frac{\text{precision} \cdot \text{recall}}{\text{precision} + \text{recall}}
    \]</li>
<li>Útil cuando hay cierto desbalance entre clases.</li>
</ul></li>
</ul>

<p>
El dataset Breast Cancer suele producir <b>accuracy</b> muy altas (por
encima de 95 %) con modelos bien entrenados, debido a que las
características están relativamente bien separadas.
</p>
</div>
</div>
</div>
<div id="outline-container-orgf110795" class="outline-3">
<h3 id="orgf110795">Interpretación matemática de la salida binaria</h3>
<div class="outline-text-3" id="text-orgf110795">
<p>
En este modelo binario, la capa de salida puede verse como una neurona
con activación <b>sigmoide (logística)</b>:
</p>

<div class="latex" id="orge581e6e">
<p>
&sigma;(z) = \frac{1}{1 + e<sup>-z</sup>}
</p>

</div>

<p>
donde:
</p>

<ul class="org-ul">
<li>\(z = \mathbf{w} \cdot \mathbf{h} + b\),</li>
<li>\(\mathbf{h}\) es el vector de activaciones de la última capa oculta.</li>
</ul>

<p>
La salida \(\sigma(z)\) se interpreta como:
</p>

<ul class="org-ul">
<li>\(\sigma(z) \approx 1\): alta probabilidad de clase 1 (benigno),</li>
<li>\(\sigma(z) \approx 0\): alta probabilidad de clase 0 (maligno).</li>
</ul>

<p>
En scikit-learn, la predicción de clase se realiza típicamente como:
</p>

<ul class="org-ul">
<li>Si \(\sigma(z) \geq 0.5\) → clase 1 (benigno).</li>
<li>Si \(\sigma(z) < 0.5\) → clase 0 (maligno).</li>
</ul>

<p>
Este umbral puede modificarse en contextos médicos, por ejemplo:
</p>

<ul class="org-ul">
<li>usar un umbral menor que 0.5 para aumentar la sensibilidad a tumores
malignos (aceptando más falsos positivos).</li>
</ul>
</div>
</div>
<div id="outline-container-org8cf5958" class="outline-3">
<h3 id="org8cf5958">Predicción de una nueva muestra</h3>
<div class="outline-text-3" id="text-org8cf5958">
<p>
Podemos usar el modelo entrenado para predecir el diagnóstico de un
nuevo paciente.
</p>

<p>
En este ejemplo, tomamos la primera muestra del set de prueba (ya
normalizada) y realizamos la predicción:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #b22222;"># </span><span style="color: #b22222;">Ejemplo con la primera fila del set de prueba
</span><span style="color: #a0522d;">nuevo_paciente</span> = X_test<span style="color: #707183;">[</span>0:1<span style="color: #707183;">]</span>     <span style="color: #b22222;"># </span><span style="color: #b22222;">forma (1, 30)
</span><span style="color: #a0522d;">pred</span> = mlp.predict<span style="color: #707183;">(</span>nuevo_paciente<span style="color: #707183;">)</span>
<span style="color: #483d8b;">print</span><span style="color: #707183;">(</span><span style="color: #8b2252;">"Resultado del diagn&#243;stico:"</span>, data.target_names<span style="color: #7388d6;">[</span>pred<span style="color: #909183;">[</span>0<span style="color: #909183;">]</span><span style="color: #7388d6;">]</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
<div id="outline-container-orgb7cbcbf" class="outline-4">
<h4 id="orgb7cbcbf">Comentarios importantes</h4>
<div class="outline-text-4" id="text-orgb7cbcbf">
<ul class="org-ul">
<li>Es fundamental que la nueva muestra haya sido procesada con el mismo:

<ol class="org-ol">
<li>Conjunto de características (mismas columnas y orden).</li>
<li>Mismo procedimiento de normalización (mismo <code>scaler</code>, con las
medias y desviaciones aprendidas en el entrenamiento).</li>
</ol></li>

<li>En la práctica, se suele:

<ul class="org-ul">
<li>guardar el modelo entrenado (por ejemplo con <code>joblib</code>),</li>
<li>guardar también el objeto <code>StandardScaler</code>,</li>
<li>aplicar ambos de manera coherente a los nuevos datos.</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgd775baa" class="outline-3">
<h3 id="orgd775baa">Resumen conceptual</h3>
<div class="outline-text-3" id="text-orgd775baa">
<p>
Este ejemplo ilustra varios conceptos clave en el uso de redes
neuronales (MLP) para clasificación binaria en un contexto médico:
</p>

<ul class="org-ul">
<li>Importancia de:
<ul class="org-ul">
<li>Partición entrenamiento/prueba estratificada.</li>
<li>Normalización de características.</li>
<li>Arquitectura de red (capas y neuronas).</li>
<li>Función de activación (ReLU).</li>
<li>Optimizador (Adam) y número de iteraciones.</li>
</ul></li>

<li>Interpretación de la salida:
<ul class="org-ul">
<li>Probabilidad generada por una función sigmoide.</li>
<li>Decisión de clase basada en un umbral.</li>
</ul></li>

<li>Evaluación:
<ul class="org-ul">
<li>No basta con accuracy: hay que considerar precision, recall y F1,
especialmente para la clase de interés (por ejemplo, “maligno”).</li>
</ul></li>
</ul>

<p>
Este mismo flujo (carga, partición, normalización, definición de modelo,
entrenamiento, evaluación, predicción) puede adaptarse a otros modelos
(árboles, SVM, LSTM, etc.) y a otros datasets de clasificación binaria
o multiclase.
</p>
</div>
</div>
</div>
