readme.org
* Redes Neuronales LSTM (Long Short-Term Memory)

Las redes neuronales LSTM (*Long Short-Term Memory*) son un tipo especial
de **Red Neuronal Recurrente (RNN)** diseñada para trabajar con datos
**secuenciales** y, en particular, para **recordar dependencias a largo
plazo**.

Se utilizan cuando el *orden* de los datos importa:

- Texto (oraciones, párrafos, documentos).
- Series temporales (precios, temperatura, señales).
- Audio y voz.
- Secuencias de eventos (logs, clics, acciones de usuario, etc.).

Su principal aporte es resolver (o al menos mitigar fuertemente) el
problema del **desvanecimiento del gradiente (vanishing gradient)** que
afecta a las RNN simples cuando manejan secuencias largas.

** Estructura general de una RNN

En una RNN “simple”, en cada paso temporal \(t\):

- Se recibe una entrada \(x_t\).
- Se tiene un estado oculto anterior \(h_{t-1}\).
- Se actualiza el estado oculto actual \(h_t\) con:

#+begin_latex
h_t = \phi(W_{xh} x_t + W_{hh} h_{t-1} + b_h)
#+end_latex

donde:

- \(W_{xh}\) y \(W_{hh}\) son matrices de pesos,
- \(b_h\) es el sesgo,
- \(\phi\) es una función de activación (típicamente =tanh= o =ReLU=).

El estado final (o todos los estados) se usan para hacer predicciones.

*** Problema: vanishing y exploding gradients

Durante el entrenamiento, se aplica *Backpropagation Through Time (BPTT)*,
es decir, se retropropagan los gradientes a través de todos los pasos
temporales.

En secuencias largas:

- Los gradientes pueden volverse **muy pequeños** → la red “olvida” las
  dependencias lejanas (problema de *vanishing gradient*).
- O volverse **muy grandes** → inestabilidad numérica (problema de
  *exploding gradient*).

Consecuencia: las RNN simples tienen dificultades para **aprender
relaciones de largo plazo**, por ejemplo, la dependencia entre una
palabra al principio de una oración y otra al final.

** Motivación de las LSTM

Las LSTM fueron propuestas para permitir que la red:

- **Mantenga información relevante durante muchos pasos temporales**.
- **Controle qué recordar y qué olvidar**.
- Facilite el flujo de gradiente a través del tiempo, reduciendo el
  problema del desvanecimiento.

La idea principal es introducir una **celda de memoria** y un sistema de
**puertas (gates)** que regulan el flujo de información.

** Arquitectura interna de una celda LSTM

En lugar de solo tener el estado oculto \(h_t\), la LSTM mantiene:

- un **estado de memoria** \(c_t\) (a veces llamado *cell state*),
- un **estado oculto** \(h_t\) (la “salida” en ese paso).

En cada paso temporal \(t\), la LSTM procesa:

- la entrada actual \(x_t\),
- el estado oculto anterior \(h_{t-1}\),
- el estado de memoria anterior \(c_{t-1}\).

Y calcula:

- una *puerta de olvido* \(f_t\),
- una *puerta de entrada* \(i_t\),
- una *candidata de memoria* \(\tilde{c}_t\),
- una *puerta de salida* \(o_t\),
- el nuevo estado de memoria \(c_t\),
- el nuevo estado oculto \(h_t\).

*** Ecuaciones de la LSTM

Típicamente, las ecuaciones de una LSTM (versión “estándar”) son:

#+begin_latex
\begin{aligned}
f_t &= \sigma(W_f [h_{t-1}, x_t] + b_f) \\
i_t &= \sigma(W_i [h_{t-1}, x_t] + b_i) \\
\tilde{c}_t &= \tanh(W_c [h_{t-1}, x_t] + b_c) \\
c_t &= f_t \odot c_{t-1} + i_t \odot \tilde{c}_t \\
o_t &= \sigma(W_o [h_{t-1}, x_t] + b_o) \\
h_t &= o_t \odot \tanh(c_t)
\end{aligned}
#+end_latex

donde:

- \(\sigma\) es la función sigmoide,
- \(\tanh\) es la tangente hiperbólica,
- \(\odot\) es el producto elemento a elemento,
- \([h_{t-1}, x_t]\) indica la concatenación de vectores.

*** Interpretación de las puertas

- \(f_t\) (*forget gate* o puerta de olvido):  
  - Toma valores en \([0,1]\) (por la sigmoide).
  - Decide cuánto de la memoria anterior \(c_{t-1}\) se conserva.
  - Si \(f_t \approx 1\) → se mantiene casi toda la memoria anterior.
  - Si \(f_t \approx 0\) → se olvida casi todo.

- \(i_t\) (*input gate* o puerta de entrada):  
  - Controla cuánta de la nueva información candidata \(\tilde{c}_t\) se
    incorpora a la memoria.
  - Valores cercanos a 1 permiten “escribir” nueva información; valores
    cercanos a 0 bloquean escritura.

- \(\tilde{c}_t\) (candidata de memoria):  
  - Es el nuevo contenido potencial para la memoria.
  - Se combina con \(i_t\) para actualizar \(c_t\).

- \(c_t\) (*cell state*):  
  - Es la memoria principal de la LSTM.
  - Se actualiza como:
    \[
      c_t = f_t \odot c_{t-1} + i_t \odot \tilde{c}_t
    \]
  - Puede transportar información durante muchos pasos, ya que el
    gradiente puede fluir a lo largo de \(c_t\) con menos atenuación.

- \(o_t\) (*output gate* o puerta de salida):  
  - Controla qué parte de la memoria \(c_t\) se expone como salida \(h_t\).

- \(h_t\) (estado oculto / salida):  
  - Es la “representación” que se usa para producir salidas en cada
    paso, o para alimentar capas posteriores.

** Intuición conceptual

Una forma intuitiva de entender una LSTM es verla como una **celda de
memoria con una “llave de escritura”, una “llave de borrado” y una
“llave de lectura”**:

- *Olvido*: la red decide qué partes de la memoria vieja ya no son
  relevantes y las borra parcialmente (puerta \(f_t\)).
- *Escritura*: la red decide qué nueva información vale la pena guardar
  (puerta \(i_t\) y candidata \(\tilde{c}_t\)).
- *Lectura*: la red decide qué parte de la memoria compartir como salida
  (puerta \(o_t\)).

Esto permite que la red conserve información importante durante muchos
pasos temporales, por ejemplo:

- el tema general de una oración,
- la tendencia de una serie temporal,
- el contexto de una conversación, etc.

