index.html
<div id="outline-container-org65b2102" class="outline-2">
<h2 id="org65b2102">Redes Neuronales LSTM (Long Short-Term Memory)</h2>
<div class="outline-text-2" id="text-org65b2102">
<p>
Las redes neuronales LSTM (<b>Long Short-Term Memory</b>) son un tipo especial
de <b><b>Red Neuronal Recurrente (RNN)</b></b> diseñada para trabajar con datos
<b><b>secuenciales</b></b> y, en particular, para <b><b>recordar dependencias a largo
plazo</b></b>.
</p>

<p>
Se utilizan cuando el <b>orden</b> de los datos importa:
</p>

<ul class="org-ul">
<li>Texto (oraciones, párrafos, documentos).</li>
<li>Series temporales (precios, temperatura, señales).</li>
<li>Audio y voz.</li>
<li>Secuencias de eventos (logs, clics, acciones de usuario, etc.).</li>
</ul>

<p>
Su principal aporte es resolver (o al menos mitigar fuertemente) el
problema del <b><b>desvanecimiento del gradiente (vanishing gradient)</b></b> que
afecta a las RNN simples cuando manejan secuencias largas.
</p>
</div>
<div id="outline-container-orgedd8f1f" class="outline-3">
<h3 id="orgedd8f1f">Estructura general de una RNN</h3>
<div class="outline-text-3" id="text-orgedd8f1f">
<p>
En una RNN “simple”, en cada paso temporal \(t\):
</p>

<ul class="org-ul">
<li>Se recibe una entrada \(x_t\).</li>
<li>Se tiene un estado oculto anterior \(h_{t-1}\).</li>
<li>Se actualiza el estado oculto actual \(h_t\) con:</li>
</ul>

<div class="latex" id="org2a15dfc">
<p>
h<sub>t</sub> = &phi;(W<sub>xh</sub> x<sub>t</sub> + W<sub>hh</sub> h<sub>t-1</sub> + b<sub>h</sub>)
</p>

</div>

<p>
donde:
</p>

<ul class="org-ul">
<li>\(W_{xh}\) y \(W_{hh}\) son matrices de pesos,</li>
<li>\(b_h\) es el sesgo,</li>
<li>\(\phi\) es una función de activación (típicamente <code>tanh</code> o <code>ReLU</code>).</li>
</ul>

<p>
El estado final (o todos los estados) se usan para hacer predicciones.
</p>
</div>
<div id="outline-container-org56bc796" class="outline-4">
<h4 id="org56bc796">Problema: vanishing y exploding gradients</h4>
<div class="outline-text-4" id="text-org56bc796">
<p>
Durante el entrenamiento, se aplica <b>Backpropagation Through Time (BPTT)</b>,
es decir, se retropropagan los gradientes a través de todos los pasos
temporales.
</p>

<p>
En secuencias largas:
</p>

<ul class="org-ul">
<li>Los gradientes pueden volverse <b><b>muy pequeños</b></b> → la red “olvida” las
dependencias lejanas (problema de <b>vanishing gradient</b>).</li>
<li>O volverse <b><b>muy grandes</b></b> → inestabilidad numérica (problema de
<b>exploding gradient</b>).</li>
</ul>

<p>
Consecuencia: las RNN simples tienen dificultades para <b><b>aprender
relaciones de largo plazo</b></b>, por ejemplo, la dependencia entre una
palabra al principio de una oración y otra al final.
</p>
</div>
</div>
</div>
<div id="outline-container-org733e479" class="outline-3">
<h3 id="org733e479">Motivación de las LSTM</h3>
<div class="outline-text-3" id="text-org733e479">
<p>
Las LSTM fueron propuestas para permitir que la red:
</p>

<ul class="org-ul">
<li><b><b>Mantenga información relevante durante muchos pasos temporales</b></b>.</li>
<li><b><b>Controle qué recordar y qué olvidar</b></b>.</li>
<li>Facilite el flujo de gradiente a través del tiempo, reduciendo el
problema del desvanecimiento.</li>
</ul>

<p>
La idea principal es introducir una <b><b>celda de memoria</b></b> y un sistema de
<b><b>puertas (gates)</b></b> que regulan el flujo de información.
</p>
</div>
</div>
<div id="outline-container-orgea859ac" class="outline-3">
<h3 id="orgea859ac">Arquitectura interna de una celda LSTM</h3>
<div class="outline-text-3" id="text-orgea859ac">
<p>
En lugar de solo tener el estado oculto \(h_t\), la LSTM mantiene:
</p>

<ul class="org-ul">
<li>un <b><b>estado de memoria</b></b> \(c_t\) (a veces llamado <b>cell state</b>),</li>
<li>un <b><b>estado oculto</b></b> \(h_t\) (la “salida” en ese paso).</li>
</ul>

<p>
En cada paso temporal \(t\), la LSTM procesa:
</p>

<ul class="org-ul">
<li>la entrada actual \(x_t\),</li>
<li>el estado oculto anterior \(h_{t-1}\),</li>
<li>el estado de memoria anterior \(c_{t-1}\).</li>
</ul>

<p>
Y calcula:
</p>

<ul class="org-ul">
<li>una <b>puerta de olvido</b> \(f_t\),</li>
<li>una <b>puerta de entrada</b> \(i_t\),</li>
<li>una <b>candidata de memoria</b> \(\tilde{c}_t\),</li>
<li>una <b>puerta de salida</b> \(o_t\),</li>
<li>el nuevo estado de memoria \(c_t\),</li>
<li>el nuevo estado oculto \(h_t\).</li>
</ul>
</div>
<div id="outline-container-org9a47d58" class="outline-4">
<h4 id="org9a47d58">Ecuaciones de la LSTM</h4>
<div class="outline-text-4" id="text-org9a47d58">
<p>
Típicamente, las ecuaciones de una LSTM (versión “estándar”) son:
</p>

<div class="latex" id="org741dea7">
\begin{aligned}
f_t &= \sigma(W_f [h_{t-1}, x_t] + b_f) \\
i_t &= \sigma(W_i [h_{t-1}, x_t] + b_i) \\
\tilde{c}_t &= \tanh(W_c [h_{t-1}, x_t] + b_c) \\
c_t &= f_t \odot c_{t-1} + i_t \odot \tilde{c}_t \\
o_t &= \sigma(W_o [h_{t-1}, x_t] + b_o) \\
h_t &= o_t \odot \tanh(c_t)
\end{aligned}

</div>

<p>
donde:
</p>

<ul class="org-ul">
<li>\(\sigma\) es la función sigmoide,</li>
<li>\(\tanh\) es la tangente hiperbólica,</li>
<li>\(\odot\) es el producto elemento a elemento,</li>
<li>\([h_{t-1}, x_t]\) indica la concatenación de vectores.</li>
</ul>
</div>
</div>
<div id="outline-container-org35be279" class="outline-4">
<h4 id="org35be279">Interpretación de las puertas</h4>
<div class="outline-text-4" id="text-org35be279">
<ul class="org-ul">
<li>\(f_t\) (<b>forget gate</b> o puerta de olvido):  
<ul class="org-ul">
<li>Toma valores en \([0,1]\) (por la sigmoide).</li>
<li>Decide cuánto de la memoria anterior \(c_{t-1}\) se conserva.</li>
<li>Si \(f_t \approx 1\) → se mantiene casi toda la memoria anterior.</li>
<li>Si \(f_t \approx 0\) → se olvida casi todo.</li>
</ul></li>

<li>\(i_t\) (<b>input gate</b> o puerta de entrada):  
<ul class="org-ul">
<li>Controla cuánta de la nueva información candidata \(\tilde{c}_t\) se
incorpora a la memoria.</li>
<li>Valores cercanos a 1 permiten “escribir” nueva información; valores
cercanos a 0 bloquean escritura.</li>
</ul></li>

<li>\(\tilde{c}_t\) (candidata de memoria):  
<ul class="org-ul">
<li>Es el nuevo contenido potencial para la memoria.</li>
<li>Se combina con \(i_t\) para actualizar \(c_t\).</li>
</ul></li>

<li>\(c_t\) (<b>cell state</b>):  
<ul class="org-ul">
<li>Es la memoria principal de la LSTM.</li>
<li>Se actualiza como:
\[
      c_t = f_t \odot c_{t-1} + i_t \odot \tilde{c}_t
    \]</li>
<li>Puede transportar información durante muchos pasos, ya que el
gradiente puede fluir a lo largo de \(c_t\) con menos atenuación.</li>
</ul></li>

<li>\(o_t\) (<b>output gate</b> o puerta de salida):  
<ul class="org-ul">
<li>Controla qué parte de la memoria \(c_t\) se expone como salida \(h_t\).</li>
</ul></li>

<li>\(h_t\) (estado oculto / salida):  
<ul class="org-ul">
<li>Es la “representación” que se usa para producir salidas en cada
paso, o para alimentar capas posteriores.</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgac392d3" class="outline-3">
<h3 id="orgac392d3">Intuición conceptual</h3>
<div class="outline-text-3" id="text-orgac392d3">
<p>
Una forma intuitiva de entender una LSTM es verla como una <b><b>celda de
memoria con una “llave de escritura”, una “llave de borrado” y una
“llave de lectura”</b></b>:
</p>

<ul class="org-ul">
<li><b>Olvido</b>: la red decide qué partes de la memoria vieja ya no son
relevantes y las borra parcialmente (puerta \(f_t\)).</li>
<li><b>Escritura</b>: la red decide qué nueva información vale la pena guardar
(puerta \(i_t\) y candidata \(\tilde{c}_t\)).</li>
<li><b>Lectura</b>: la red decide qué parte de la memoria compartir como salida
(puerta \(o_t\)).</li>
</ul>

<p>
Esto permite que la red conserve información importante durante muchos
pasos temporales, por ejemplo:
</p>

<ul class="org-ul">
<li>el tema general de una oración,</li>
<li>la tendencia de una serie temporal,</li>
<li>el contexto de una conversación, etc.</li>
</ul>
</div>
</div>
