readme.org
** Entrenamiento de una LSTM

El entrenamiento de una LSTM sigue el mismo esquema general que otras
redes neuronales:

1. **Forward pass**:
   - La secuencia completa \((x_1, x_2, \dots, x_T)\) se ingresa paso a
     paso.
   - En cada paso se actualizan \(c_t\) y \(h_t\).
   - Se produce una salida (por ejemplo, en cada paso o solo al final).

2. **Cálculo de la pérdida**:
   - Se compara la salida de la red con la etiqueta real.
   - Se usa una función de pérdida acorde al problema:
     - Clasificación: entropía cruzada (multiclase o binaria).
     - Regresión: error cuadrático medio (MSE), etc.

3. **Backpropagation Through Time (BPTT)**:
   - Se retropropaga el gradiente desde el último paso hacia los
     primeros.
   - Se actualizan los pesos de todas las puertas y conexiones.

4. **Actualización de parámetros**:
   - Se utilizan optimizadores como SGD, Adam, RMSprop.
   - En la práctica, Adam y RMSprop son muy populares en LSTM.

Gracias a la estructura de memoria, los gradientes a través de \(c_t\)
tienden a **no desaparecer tan rápido** como en una RNN simple.

** Tipos de tareas típicas con LSTM

Las LSTM se aplican a muchas tareas de secuencia:

- *Modelado de lenguaje*:
  - Predecir la siguiente palabra de una oración.
  - Asignar probabilidad a una secuencia de palabras.

- *Traducción automática*:
  - Modelos encoder–decoder (LSTM para codificar una oración, otra LSTM
    para decodificar en otro idioma).

- *Etiquetado secuencial*:
  - Etiquetado de partes del habla (POS tagging).
  - Reconocimiento de entidades nombradas (NER).

- *Series temporales*:
  - Predicción de valores futuros (ej. precios de acciones).
  - Detección de anomalías en señales.

- *Procesamiento de audio / voz*:
  - Reconocimiento de voz.
  - Síntesis de voz (en combinación con otras arquitecturas).

** Variantes y extensiones de LSTM

A partir de la LSTM estándar, han surgido múltiples variantes:

- *LSTM bidireccional (Bidirectional LSTM)*:
  - Procesa la secuencia en dos direcciones:
    - de izquierda a derecha (forward),
    - de derecha a izquierda (backward).
  - Se concatena la información de ambos sentidos.
  - Útil cuando se tiene acceso a la secuencia completa (texto, frases).

- *Pilado de LSTMs (Stacked LSTM)*:
  - Varias capas LSTM apiladas una sobre otra.
  - Las salidas de una capa sirven de entradas a la siguiente.
  - Permite aprender representaciones más complejas.

- *LSTM con atención (Attention)*:
  - Combinación de LSTM con mecanismos de atención.
  - El modelo decide a qué partes de la secuencia “prestar más atención”
    al hacer una predicción.

- *GRU (Gated Recurrent Unit)*:
  - Variante simplificada de LSTM (menos puertas, menos parámetros).
  - Suele tener rendimiento comparable en muchos problemas.

** Implementación básica en Python (Keras)

A modo de ejemplo muy simple (no ligado a un dataset específico):

#+begin_src python
import numpy as np
import tensorflow as tf
from tensorflow.keras.models import Sequential
from tensorflow.keras.layers import LSTM, Dense

# Supongamos una secuencia de longitud 10 con 5 features por timestep
timesteps = 10
features = 5
num_samples = 100
num_classes = 3

# Datos aleatorios de ejemplo (solo para ilustrar la forma)
X = np.random.randn(num_samples, timesteps, features)
y = np.random.randint(0, num_classes, size=(num_samples,))

# One-hot encoding
y_onehot = tf.keras.utils.to_categorical(y, num_classes=num_classes)

# Definir modelo LSTM
model = Sequential([
    LSTM(32, input_shape=(timesteps, features)),
    Dense(num_classes, activation='softmax')
])

model.compile(
    loss='categorical_crossentropy',
    optimizer='adam',
    metrics=['accuracy']
)

model.summary()

# Entrenamiento de ejemplo
model.fit(X, y_onehot, epochs=10, batch_size=16)
#+end_src

En este ejemplo:

- La entrada tiene forma =(num_samples, timesteps, features)=.
- La LSTM devuelve un vector (el último estado oculto).
- La capa =Dense= con softmax produce una distribución de probabilidad
  sobre las clases.

** Ventajas y limitaciones de LSTM

*** Ventajas

- Manejan mejor dependencias de largo plazo que las RNN simples.
- Funcionan bien en problemas donde el orden y el contexto importan.
- Son muy flexibles y pueden combinarse con otras arquitecturas
  (convolucionales, atención, etc.).

*** Limitaciones

- Entrenamiento relativamente costoso (más parámetros que RNN simple).
- Difíciles de paralelizar completamente debido a su naturaleza
  secuencial.
- En tareas muy complejas y con grandes volúmenes de datos, han sido en
  muchos casos superadas por arquitecturas basadas en *transformers*.

** Conclusión

Las LSTM representan un paso fundamental en la historia de las redes
neuronales para secuencias:

- resolvieron en gran medida el problema del desvanecimiento del
  gradiente en RNN,
- permitieron avances significativos en NLP, series temporales y voz,
- siguen siendo una herramienta muy útil y educativa para entender cómo
  las redes pueden “recordar” información a lo largo del tiempo.

Aun cuando hoy en día los *transformers* dominen muchas aplicaciones de
NLP, las LSTM siguen siendo:

- una excelente base conceptual,
- útiles en problemas con secuencias pequeñas o recursos limitados,
- y una parte importante de la “caja de herramientas” de cualquier
  persona que trabaja con aprendizaje profundo y datos secuenciales.


