index.html
<div id="outline-container-org4934aae" class="outline-3">
<h3 id="org4934aae">Entrenamiento de una LSTM</h3>
<div class="outline-text-3" id="text-org4934aae">
<p>
El entrenamiento de una LSTM sigue el mismo esquema general que otras
redes neuronales:
</p>

<ol class="org-ol">
<li><b><b>Forward pass</b></b>:
<ul class="org-ul">
<li>La secuencia completa \((x_1, x_2, \dots, x_T)\) se ingresa paso a
paso.</li>
<li>En cada paso se actualizan \(c_t\) y \(h_t\).</li>
<li>Se produce una salida (por ejemplo, en cada paso o solo al final).</li>
</ul></li>

<li><b><b>Cálculo de la pérdida</b></b>:
<ul class="org-ul">
<li>Se compara la salida de la red con la etiqueta real.</li>
<li>Se usa una función de pérdida acorde al problema:
<ul class="org-ul">
<li>Clasificación: entropía cruzada (multiclase o binaria).</li>
<li>Regresión: error cuadrático medio (MSE), etc.</li>
</ul></li>
</ul></li>

<li><b><b>Backpropagation Through Time (BPTT)</b></b>:
<ul class="org-ul">
<li>Se retropropaga el gradiente desde el último paso hacia los
primeros.</li>
<li>Se actualizan los pesos de todas las puertas y conexiones.</li>
</ul></li>

<li><b><b>Actualización de parámetros</b></b>:
<ul class="org-ul">
<li>Se utilizan optimizadores como SGD, Adam, RMSprop.</li>
<li>En la práctica, Adam y RMSprop son muy populares en LSTM.</li>
</ul></li>
</ol>

<p>
Gracias a la estructura de memoria, los gradientes a través de \(c_t\)
tienden a <b><b>no desaparecer tan rápido</b></b> como en una RNN simple.
</p>
</div>
</div>
<div id="outline-container-org6d42adf" class="outline-3">
<h3 id="org6d42adf">Tipos de tareas típicas con LSTM</h3>
<div class="outline-text-3" id="text-org6d42adf">
<p>
Las LSTM se aplican a muchas tareas de secuencia:
</p>

<ul class="org-ul">
<li><b>Modelado de lenguaje</b>:
<ul class="org-ul">
<li>Predecir la siguiente palabra de una oración.</li>
<li>Asignar probabilidad a una secuencia de palabras.</li>
</ul></li>

<li><b>Traducción automática</b>:
<ul class="org-ul">
<li>Modelos encoder–decoder (LSTM para codificar una oración, otra LSTM
para decodificar en otro idioma).</li>
</ul></li>

<li><b>Etiquetado secuencial</b>:
<ul class="org-ul">
<li>Etiquetado de partes del habla (POS tagging).</li>
<li>Reconocimiento de entidades nombradas (NER).</li>
</ul></li>

<li><b>Series temporales</b>:
<ul class="org-ul">
<li>Predicción de valores futuros (ej. precios de acciones).</li>
<li>Detección de anomalías en señales.</li>
</ul></li>

<li><b>Procesamiento de audio / voz</b>:
<ul class="org-ul">
<li>Reconocimiento de voz.</li>
<li>Síntesis de voz (en combinación con otras arquitecturas).</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org25992bb" class="outline-3">
<h3 id="org25992bb">Variantes y extensiones de LSTM</h3>
<div class="outline-text-3" id="text-org25992bb">
<p>
A partir de la LSTM estándar, han surgido múltiples variantes:
</p>

<ul class="org-ul">
<li><b>LSTM bidireccional (Bidirectional LSTM)</b>:
<ul class="org-ul">
<li>Procesa la secuencia en dos direcciones:
<ul class="org-ul">
<li>de izquierda a derecha (forward),</li>
<li>de derecha a izquierda (backward).</li>
</ul></li>
<li>Se concatena la información de ambos sentidos.</li>
<li>Útil cuando se tiene acceso a la secuencia completa (texto, frases).</li>
</ul></li>

<li><b>Pilado de LSTMs (Stacked LSTM)</b>:
<ul class="org-ul">
<li>Varias capas LSTM apiladas una sobre otra.</li>
<li>Las salidas de una capa sirven de entradas a la siguiente.</li>
<li>Permite aprender representaciones más complejas.</li>
</ul></li>

<li><b>LSTM con atención (Attention)</b>:
<ul class="org-ul">
<li>Combinación de LSTM con mecanismos de atención.</li>
<li>El modelo decide a qué partes de la secuencia “prestar más atención”
al hacer una predicción.</li>
</ul></li>

<li><b>GRU (Gated Recurrent Unit)</b>:
<ul class="org-ul">
<li>Variante simplificada de LSTM (menos puertas, menos parámetros).</li>
<li>Suele tener rendimiento comparable en muchos problemas.</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org54b1845" class="outline-3">
<h3 id="org54b1845">Implementación básica en Python (Keras)</h3>
<div class="outline-text-3" id="text-org54b1845">
<p>
A modo de ejemplo muy simple (no ligado a un dataset específico):
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a020f0;">import</span> numpy <span style="color: #a020f0;">as</span> np
<span style="color: #a020f0;">import</span> tensorflow <span style="color: #a020f0;">as</span> tf
<span style="color: #a020f0;">from</span> tensorflow.keras.models <span style="color: #a020f0;">import</span> Sequential
<span style="color: #a020f0;">from</span> tensorflow.keras.layers <span style="color: #a020f0;">import</span> LSTM, Dense

<span style="color: #b22222;"># </span><span style="color: #b22222;">Supongamos una secuencia de longitud 10 con 5 features por timestep
</span><span style="color: #a0522d;">timesteps</span> = 10
<span style="color: #a0522d;">features</span> = 5
<span style="color: #a0522d;">num_samples</span> = 100
<span style="color: #a0522d;">num_classes</span> = 3

<span style="color: #b22222;"># </span><span style="color: #b22222;">Datos aleatorios de ejemplo (solo para ilustrar la forma)
</span><span style="color: #a0522d;">X</span> = np.random.randn<span style="color: #707183;">(</span>num_samples, timesteps, features<span style="color: #707183;">)</span>
<span style="color: #a0522d;">y</span> = np.random.randint<span style="color: #707183;">(</span>0, num_classes, size=<span style="color: #7388d6;">(</span>num_samples,<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">One-hot encoding
</span><span style="color: #a0522d;">y_onehot</span> = tf.keras.utils.to_categorical<span style="color: #707183;">(</span>y, num_classes=num_classes<span style="color: #707183;">)</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">Definir modelo LSTM
</span><span style="color: #a0522d;">model</span> = Sequential<span style="color: #707183;">(</span><span style="color: #7388d6;">[</span>
<span style="background-color: #f2f2f2;"> </span>   LSTM<span style="color: #909183;">(</span>32, input_shape=<span style="color: #709870;">(</span>timesteps, features<span style="color: #709870;">)</span><span style="color: #909183;">)</span>,
<span style="background-color: #f2f2f2;"> </span>   Dense<span style="color: #909183;">(</span>num_classes, activation=<span style="color: #8b2252;">'softmax'</span><span style="color: #909183;">)</span>
<span style="color: #7388d6;">]</span><span style="color: #707183;">)</span>

model.<span style="color: #483d8b;">compile</span><span style="color: #707183;">(</span>
<span style="background-color: #f2f2f2;"> </span>   loss=<span style="color: #8b2252;">'categorical_crossentropy'</span>,
<span style="background-color: #f2f2f2;"> </span>   optimizer=<span style="color: #8b2252;">'adam'</span>,
<span style="background-color: #f2f2f2;"> </span>   metrics=<span style="color: #7388d6;">[</span><span style="color: #8b2252;">'accuracy'</span><span style="color: #7388d6;">]</span>
<span style="color: #707183;">)</span>

model.summary<span style="color: #707183;">()</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">Entrenamiento de ejemplo
</span>model.fit<span style="color: #707183;">(</span>X, y_onehot, epochs=10, batch_size=16<span style="color: #707183;">)</span>
</pre>
</div>

<p>
En este ejemplo:
</p>

<ul class="org-ul">
<li>La entrada tiene forma <code>(num_samples, timesteps, features)</code>.</li>
<li>La LSTM devuelve un vector (el último estado oculto).</li>
<li>La capa <code>Dense</code> con softmax produce una distribución de probabilidad
sobre las clases.</li>
</ul>
</div>
</div>
<div id="outline-container-org04b2937" class="outline-3">
<h3 id="org04b2937">Ventajas y limitaciones de LSTM</h3>
<div class="outline-text-3" id="text-org04b2937">
</div>
<div id="outline-container-orgf7b42e6" class="outline-4">
<h4 id="orgf7b42e6">Ventajas</h4>
<div class="outline-text-4" id="text-orgf7b42e6">
<ul class="org-ul">
<li>Manejan mejor dependencias de largo plazo que las RNN simples.</li>
<li>Funcionan bien en problemas donde el orden y el contexto importan.</li>
<li>Son muy flexibles y pueden combinarse con otras arquitecturas
(convolucionales, atención, etc.).</li>
</ul>
</div>
</div>
<div id="outline-container-org6ed38ed" class="outline-4">
<h4 id="org6ed38ed">Limitaciones</h4>
<div class="outline-text-4" id="text-org6ed38ed">
<ul class="org-ul">
<li>Entrenamiento relativamente costoso (más parámetros que RNN simple).</li>
<li>Difíciles de paralelizar completamente debido a su naturaleza
secuencial.</li>
<li>En tareas muy complejas y con grandes volúmenes de datos, han sido en
muchos casos superadas por arquitecturas basadas en <b>transformers</b>.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgb90b09c" class="outline-3">
<h3 id="orgb90b09c">Conclusión</h3>
<div class="outline-text-3" id="text-orgb90b09c">
<p>
Las LSTM representan un paso fundamental en la historia de las redes
neuronales para secuencias:
</p>

<ul class="org-ul">
<li>resolvieron en gran medida el problema del desvanecimiento del
gradiente en RNN,</li>
<li>permitieron avances significativos en NLP, series temporales y voz,</li>
<li>siguen siendo una herramienta muy útil y educativa para entender cómo
las redes pueden “recordar” información a lo largo del tiempo.</li>
</ul>

<p>
Aun cuando hoy en día los <b>transformers</b> dominen muchas aplicaciones de
NLP, las LSTM siguen siendo:
</p>

<ul class="org-ul">
<li>una excelente base conceptual,</li>
<li>útiles en problemas con secuencias pequeñas o recursos limitados,</li>
<li>y una parte importante de la “caja de herramientas” de cualquier
persona que trabaja con aprendizaje profundo y datos secuenciales.</li>
</ul>
</div>
</div>
</div>
