readme.org
* Ejemplo Clasificación del dataset Iris con una red LSTM

Este apartado muestra un ejemplo completo en Python usando el dataset
clásico Iris y una red neuronal recurrente del tipo *LSTM* (Long Short-Term Memory)
usando la librería *Keras* (TensorFlow).

El objetivo es clasificar flores Iris en tres clases:

- Setosa
- Versicolor
- Virginica

A diferencia del MLP (Perceptrón Multicapa), la LSTM está diseñada
para procesar datos *secuenciales*. En este ejemplo, forzamos la
estructura secuencial tratando las 4 características de Iris como una
secuencia de 4 pasos temporales.

** Importar librerías

#+begin_src python
import numpy as np

from sklearn.datasets import load_iris
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import StandardScaler
from sklearn.metrics import accuracy_score, classification_report

import tensorflow as tf
from tensorflow.keras.models import Sequential
from tensorflow.keras.layers import LSTM, Dense
from tensorflow.keras.utils import to_categorical
#+end_src

** Cargar el dataset Iris

#+begin_src python
iris = load_iris()
X = iris.data      # Características (150 x 4)
y = iris.target    # Clases (150,)

print(X.shape)     # (150, 4)
print(y.shape)     # (150,)
#+end_src

Las 4 características son:

- Largo del sépalo
- Ancho del sépalo
- Largo del pétalo
- Ancho del pétalo

Las clases están codificadas como:

- 0 → Setosa
- 1 → Versicolor
- 2 → Virginica

** Partición entrenamiento / prueba

El siguiente fragmento de código realiza la partición del conjunto de
datos original en dos subconjuntos disjuntos: uno destinado al
entrenamiento del modelo y otro a su evaluación.

#+begin_src python
X_train, X_test, y_train, y_test = train_test_split(
    X,
    y,
    test_size=0.2,
    random_state=42,
    stratify=y
)
#+end_src

*** Propósito de la partición

En aprendizaje automático supervisado, es fundamental evaluar la
capacidad de generalización de un modelo. Para ello, los datos
disponibles se dividen en:

- *Conjunto de entrenamiento*: utilizado para ajustar los parámetros del modelo (pesos y sesgos).
- *Conjunto de prueba*: utilizado exclusivamente para medir el desempeño del modelo sobre datos no vistos durante el entrenamiento.

Esta separación permite detectar fenómenos como overfitting y
underfitting, y proporciona una estimación más realista del
rendimiento esperado en producción.

*** Parámetro test_size

#+begin_src python
test_size = 0.2
#+end_src

indica que el 20 % del conjunto total de datos se reserva para el
conjunto de prueba, mientras que el 80 % restante se utiliza para
entrenamiento.

*** Reproducibilidad del experimento

El parámetro:

#+begin_src python
random_state = 42
#+end_src

fija la semilla del generador de números aleatorios utilizado durante
la partición. Esto garantiza que la división de los datos sea
reproducible.

*** Estratificación de clases

El parámetro:

#+begin_src python
stratify = y
#+end_src

indica que la división debe realizarse de forma estratificada,
conservando la proporción original de cada clase en ambos
subconjuntos.

** Normalización de los datos

La normalización de los datos de entrada es un paso crítico en el
entrenamiento de redes neuronales (incluyendo LSTM), ya que influye
directamente en la estabilidad numérica, la velocidad de convergencia
y la eficacia del aprendizaje.

Usaremos estandarización con =StandardScaler=:

#+begin_src python
scaler = StandardScaler()
X_train = scaler.fit_transform(X_train)
X_test = scaler.transform(X_test)
#+end_src

Cada característica \(x\) se transforma según:

#+begin_latex
x' = \frac{x - \mu}{\sigma}
#+end_latex

donde:

- \( \mu \) es la media de la característica,
- \( \sigma \) es la desviación estándar.

El resultado es:

- media aproximadamente 0,
- desviación estándar aproximadamente 1.

** Preparar los datos para LSTM

Las LSTM en Keras esperan entradas con forma:

- \((n\_muestras, n\_timesteps, n\_features)\)

En Iris, tenemos 4 características. Una forma simple de usar LSTM es:

- considerar una secuencia de longitud 4 (=timesteps=4=),
- con 1 característica por paso (=features=1=).

Esto implica reestructurar cada muestra de forma (4,) a (4, 1):

#+begin_src python
# Reshape para LSTM: (n_muestras, timesteps=4, features=1)
X_train_lstm = X_train.reshape((X_train.shape[0], 4, 1))
X_test_lstm = X_test.reshape((X_test.shape[0], 4, 1))

print(X_train_lstm.shape)  # (120, 4, 1)
print(X_test_lstm.shape)   # (30, 4, 1)
#+end_src

Además, para clasificación multiclase con Keras, se suele usar
one-hot encoding de las etiquetas:

#+begin_src python
num_classes = len(np.unique(y))
y_train_cat = to_categorical(y_train, num_classes=num_classes)
y_test_cat = to_categorical(y_test, num_classes=num_classes)
#+end_src

