index.html
<div id="outline-container-org24358f0" class="outline-2">
<h2 id="org24358f0">Ejemplo Clasificación del dataset Iris con una red LSTM</h2>
<div class="outline-text-2" id="text-org24358f0">
<p>
Este apartado muestra un ejemplo completo en Python usando el dataset
clásico Iris y una red neuronal recurrente del tipo <b>LSTM</b> (Long Short-Term Memory)
usando la librería <b>Keras</b> (TensorFlow).
</p>

<p>
El objetivo es clasificar flores Iris en tres clases:
</p>

<ul class="org-ul">
<li>Setosa</li>
<li>Versicolor</li>
<li>Virginica</li>
</ul>

<p>
A diferencia del MLP (Perceptrón Multicapa), la LSTM está diseñada
para procesar datos <b>secuenciales</b>. En este ejemplo, forzamos la
estructura secuencial tratando las 4 características de Iris como una
secuencia de 4 pasos temporales.
</p>
</div>
<div id="outline-container-org98267e0" class="outline-3">
<h3 id="org98267e0">Importar librerías</h3>
<div class="outline-text-3" id="text-org98267e0">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #a020f0;">import</span> numpy <span style="color: #a020f0;">as</span> np

<span style="color: #a020f0;">from</span> sklearn.datasets <span style="color: #a020f0;">import</span> load_iris
<span style="color: #a020f0;">from</span> sklearn.model_selection <span style="color: #a020f0;">import</span> train_test_split
<span style="color: #a020f0;">from</span> sklearn.preprocessing <span style="color: #a020f0;">import</span> StandardScaler
<span style="color: #a020f0;">from</span> sklearn.metrics <span style="color: #a020f0;">import</span> accuracy_score, classification_report

<span style="color: #a020f0;">import</span> tensorflow <span style="color: #a020f0;">as</span> tf
<span style="color: #a020f0;">from</span> tensorflow.keras.models <span style="color: #a020f0;">import</span> Sequential
<span style="color: #a020f0;">from</span> tensorflow.keras.layers <span style="color: #a020f0;">import</span> LSTM, Dense
<span style="color: #a020f0;">from</span> tensorflow.keras.utils <span style="color: #a020f0;">import</span> to_categorical
</pre>
</div>
</div>
</div>
<div id="outline-container-org2347246" class="outline-3">
<h3 id="org2347246">Cargar el dataset Iris</h3>
<div class="outline-text-3" id="text-org2347246">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">iris</span> = load_iris<span style="color: #707183;">()</span>
<span style="color: #a0522d;">X</span> = iris.data      <span style="color: #b22222;"># </span><span style="color: #b22222;">Caracter&#237;sticas (150 x 4)
</span><span style="color: #a0522d;">y</span> = iris.target    <span style="color: #b22222;"># </span><span style="color: #b22222;">Clases (150,)
</span>
<span style="color: #483d8b;">print</span><span style="color: #707183;">(</span>X.shape<span style="color: #707183;">)</span>     <span style="color: #b22222;"># </span><span style="color: #b22222;">(150, 4)
</span><span style="color: #483d8b;">print</span><span style="color: #707183;">(</span>y.shape<span style="color: #707183;">)</span>     <span style="color: #b22222;"># </span><span style="color: #b22222;">(150,)</span>
</pre>
</div>

<p>
Las 4 características son:
</p>

<ul class="org-ul">
<li>Largo del sépalo</li>
<li>Ancho del sépalo</li>
<li>Largo del pétalo</li>
<li>Ancho del pétalo</li>
</ul>

<p>
Las clases están codificadas como:
</p>

<ul class="org-ul">
<li>0 → Setosa</li>
<li>1 → Versicolor</li>
<li>2 → Virginica</li>
</ul>
</div>
</div>
<div id="outline-container-orgb69b738" class="outline-3">
<h3 id="orgb69b738">Partición entrenamiento / prueba</h3>
<div class="outline-text-3" id="text-orgb69b738">
<p>
El siguiente fragmento de código realiza la partición del conjunto de
datos original en dos subconjuntos disjuntos: uno destinado al
entrenamiento del modelo y otro a su evaluación.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">X_train</span>, <span style="color: #a0522d;">X_test</span>, <span style="color: #a0522d;">y_train</span>, <span style="color: #a0522d;">y_test</span> = train_test_split<span style="color: #707183;">(</span>
<span style="background-color: #f2f2f2;"> </span>   X,
<span style="background-color: #f2f2f2;"> </span>   y,
<span style="background-color: #f2f2f2;"> </span>   test_size=0.2,
<span style="background-color: #f2f2f2;"> </span>   random_state=42,
<span style="background-color: #f2f2f2;"> </span>   stratify=y
<span style="color: #707183;">)</span>
</pre>
</div>
</div>
<div id="outline-container-org70ba70b" class="outline-4">
<h4 id="org70ba70b">Propósito de la partición</h4>
<div class="outline-text-4" id="text-org70ba70b">
<p>
En aprendizaje automático supervisado, es fundamental evaluar la
capacidad de generalización de un modelo. Para ello, los datos
disponibles se dividen en:
</p>

<ul class="org-ul">
<li><b>Conjunto de entrenamiento</b>: utilizado para ajustar los parámetros del modelo (pesos y sesgos).</li>
<li><b>Conjunto de prueba</b>: utilizado exclusivamente para medir el desempeño del modelo sobre datos no vistos durante el entrenamiento.</li>
</ul>

<p>
Esta separación permite detectar fenómenos como overfitting y
underfitting, y proporciona una estimación más realista del
rendimiento esperado en producción.
</p>
</div>
</div>
<div id="outline-container-org28a6d1e" class="outline-4">
<h4 id="org28a6d1e">Parámetro test<sub>size</sub></h4>
<div class="outline-text-4" id="text-org28a6d1e">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">test_size</span> = 0.2
</pre>
</div>

<p>
indica que el 20 % del conjunto total de datos se reserva para el
conjunto de prueba, mientras que el 80 % restante se utiliza para
entrenamiento.
</p>
</div>
</div>
<div id="outline-container-org4596a3f" class="outline-4">
<h4 id="org4596a3f">Reproducibilidad del experimento</h4>
<div class="outline-text-4" id="text-org4596a3f">
<p>
El parámetro:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">random_state</span> = 42
</pre>
</div>

<p>
fija la semilla del generador de números aleatorios utilizado durante
la partición. Esto garantiza que la división de los datos sea
reproducible.
</p>
</div>
</div>
<div id="outline-container-org371bdbe" class="outline-4">
<h4 id="org371bdbe">Estratificación de clases</h4>
<div class="outline-text-4" id="text-org371bdbe">
<p>
El parámetro:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">stratify</span> = y
</pre>
</div>

<p>
indica que la división debe realizarse de forma estratificada,
conservando la proporción original de cada clase en ambos
subconjuntos.
</p>
</div>
</div>
</div>
<div id="outline-container-orgea57be5" class="outline-3">
<h3 id="orgea57be5">Normalización de los datos</h3>
<div class="outline-text-3" id="text-orgea57be5">
<p>
La normalización de los datos de entrada es un paso crítico en el
entrenamiento de redes neuronales (incluyendo LSTM), ya que influye
directamente en la estabilidad numérica, la velocidad de convergencia
y la eficacia del aprendizaje.
</p>

<p>
Usaremos estandarización con <code>StandardScaler</code>:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">scaler</span> = StandardScaler<span style="color: #707183;">()</span>
<span style="color: #a0522d;">X_train</span> = scaler.fit_transform<span style="color: #707183;">(</span>X_train<span style="color: #707183;">)</span>
<span style="color: #a0522d;">X_test</span> = scaler.transform<span style="color: #707183;">(</span>X_test<span style="color: #707183;">)</span>
</pre>
</div>

<p>
Cada característica \(x\) se transforma según:
</p>

<div class="latex" id="org1ea0600">
<p>
x' = \frac{x - \mu}{\sigma}
</p>

</div>

<p>
donde:
</p>

<ul class="org-ul">
<li>\( \mu \) es la media de la característica,</li>
<li>\( \sigma \) es la desviación estándar.</li>
</ul>

<p>
El resultado es:
</p>

<ul class="org-ul">
<li>media aproximadamente 0,</li>
<li>desviación estándar aproximadamente 1.</li>
</ul>
</div>
</div>
<div id="outline-container-orgbb3f71f" class="outline-3">
<h3 id="orgbb3f71f">Preparar los datos para LSTM</h3>
<div class="outline-text-3" id="text-orgbb3f71f">
<p>
Las LSTM en Keras esperan entradas con forma:
</p>

<ul class="org-ul">
<li>\((n\_muestras, n\_timesteps, n\_features)\)</li>
</ul>

<p>
En Iris, tenemos 4 características. Una forma simple de usar LSTM es:
</p>

<ul class="org-ul">
<li>considerar una secuencia de longitud 4 (<code>timesteps=4</code>),</li>
<li>con 1 característica por paso (<code>features=1</code>).</li>
</ul>

<p>
Esto implica reestructurar cada muestra de forma (4,) a (4, 1):
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #b22222;"># </span><span style="color: #b22222;">Reshape para LSTM: (n_muestras, timesteps=4, features=1)
</span><span style="color: #a0522d;">X_train_lstm</span> = X_train.reshape<span style="color: #707183;">(</span><span style="color: #7388d6;">(</span>X_train.shape<span style="color: #909183;">[</span>0<span style="color: #909183;">]</span>, 4, 1<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #a0522d;">X_test_lstm</span> = X_test.reshape<span style="color: #707183;">(</span><span style="color: #7388d6;">(</span>X_test.shape<span style="color: #909183;">[</span>0<span style="color: #909183;">]</span>, 4, 1<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #483d8b;">print</span><span style="color: #707183;">(</span>X_train_lstm.shape<span style="color: #707183;">)</span>  <span style="color: #b22222;"># </span><span style="color: #b22222;">(120, 4, 1)
</span><span style="color: #483d8b;">print</span><span style="color: #707183;">(</span>X_test_lstm.shape<span style="color: #707183;">)</span>   <span style="color: #b22222;"># </span><span style="color: #b22222;">(30, 4, 1)</span>
</pre>
</div>

<p>
Además, para clasificación multiclase con Keras, se suele usar
one-hot encoding de las etiquetas:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">num_classes</span> = <span style="color: #483d8b;">len</span><span style="color: #707183;">(</span>np.unique<span style="color: #7388d6;">(</span>y<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #a0522d;">y_train_cat</span> = to_categorical<span style="color: #707183;">(</span>y_train, num_classes=num_classes<span style="color: #707183;">)</span>
<span style="color: #a0522d;">y_test_cat</span> = to_categorical<span style="color: #707183;">(</span>y_test, num_classes=num_classes<span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
