readme.org
** Definir la red LSTM

Definimos un modelo secuencial con una capa LSTM y una capa densa de
salida con softmax:

#+begin_src python
model = Sequential([
    LSTM(
        units=16,           # número de unidades LSTM
        activation='tanh',  # activación interna
        input_shape=(4, 1)  # (timesteps=4, features=1)
    ),
    Dense(num_classes, activation='softmax')
])
#+end_src

*** Arquitectura de la red

- *Capa de entrada*:
  - Forma: (4, 1)
  - 4 pasos "temporales" (cada uno con 1 valor), derivados de las 4 características.

- *Capa LSTM*:
  - =units=16=: 16 unidades de memoria.
  - Procesa la secuencia \((x_1, x_2, x_3, x_4)\) y genera una representación que captura
    dependencias entre pasos.

- *Capa de salida (Dense + softmax)*:
  - 3 neuronas (una por clase).
  - Activación softmax para obtener probabilidades.

** Compilación del modelo

Escogemos una función de pérdida apropiada para clasificación
multiclase y un optimizador:

#+begin_src python
model.compile(
    loss='categorical_crossentropy',
    optimizer=tf.keras.optimizers.Adam(learning_rate=0.001),
    metrics=['accuracy']
)
#+end_src

- =categorical_crossentropy=: log-loss multiclase.
- *Adam*: optimizador basado en descenso de gradiente con momento y tasas
  de aprendizaje adaptativas.
- Tasa de aprendizaje inicial \(\eta = 0.001\).

** Entrenamiento del modelo LSTM

#+begin_src python
history = model.fit(
    X_train_lstm,
    y_train_cat,
    epochs=200,         # número de épocas
    batch_size=16,
    validation_split=0.1,
    verbose=1
)
#+end_src

Durante el entrenamiento:

*** Propagación hacia adelante (forward pass)

- Cada muestra de entrada se considera como una secuencia de 4 pasos.
- En cada paso, la LSTM actualiza su:
  - estado oculto \(h_t\),
  - estado de memoria \(c_t\).

*** Cálculo del error

- La salida softmax se compara con la etiqueta real codificada en one-hot.
- Se calcula la pérdida mediante entropía cruzada categórica.

*** Backpropagation Through Time (BPTT)

- El error se propaga hacia atrás a lo largo del tiempo (sobre los 4 pasos).
- Se calculan los gradientes de los pesos de la LSTM y de la capa de salida.

*** Descenso de gradiente con Adam

- Adam combina Momentum y RMSProp.
- Ajusta automáticamente la tasa de aprendizaje para cada parámetro.
- Proporciona convergencia rápida y estable.

** Evaluación del modelo

Una vez entrenado el modelo, se evalúa su desempeño usando datos no
vistos (conjunto de prueba).

#+begin_src python
# Probabilidades por clase
y_pred_proba = model.predict(X_test_lstm)

# Clase predicha = índice de la probabilidad máxima
y_pred = np.argmax(y_pred_proba, axis=1)

print("Accuracy:", accuracy_score(y_test, y_pred))
print("\nReporte de clasificación:\n")
print(classification_report(y_test, y_pred, target_names=iris.target_names))
#+end_src

*** Métricas utilizadas

- *Accuracy*: proporción total de predicciones correctas.
- *Precision*: qué tan confiables son las predicciones positivas.
- *Recall*: capacidad del modelo para encontrar todos los ejemplos de una clase.
- *F1-score*: balance entre precisión y recall.

En el dataset Iris, el accuracy también suele estar en el rango del
95 % al 100 %.

** Predicción con una nueva flor

El modelo entrenado puede utilizarse para predecir nuevas muestras.
Es importante repetir el mismo preprocesamiento: normalización y
reshape para LSTM.

#+begin_src python
# [largo_sepalo, ancho_sepalo, largo_petalo, ancho_petalo]
flor_nueva = np.array([[5.1, 3.5, 1.4, 0.2]])

# 1) Normalización con el mismo scaler del entrenamiento
flor_nueva_scaled = scaler.transform(flor_nueva)

# 2) Reshape para LSTM: (1, timesteps=4, features=1)
flor_nueva_lstm = flor_nueva_scaled.reshape((1, 4, 1))

# 3) Predicción
proba = model.predict(flor_nueva_lstm)
prediccion = np.argmax(proba, axis=1)

print("Clase predicha:", iris.target_names[prediccion[0]])
#+end_src

Es fundamental aplicar la misma normalización y la misma estructura de
entrada (forma (1, 4, 1)) que se usaron en el entrenamiento.

