index.html
<div id="outline-container-orgc5f326b" class="outline-3">
<h3 id="orgc5f326b">Definir la red LSTM</h3>
<div class="outline-text-3" id="text-orgc5f326b">
<p>
Definimos un modelo secuencial con una capa LSTM y una capa densa de
salida con softmax:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">model</span> = Sequential<span style="color: #707183;">(</span><span style="color: #7388d6;">[</span>
<span style="background-color: #f2f2f2;"> </span>   LSTM<span style="color: #909183;">(</span>
<span style="background-color: #f2f2f2;"> </span>   <span style="background-color: #f2f2f2;"> </span>   units=16,           <span style="color: #b22222;"># </span><span style="color: #b22222;">n&#250;mero de unidades LSTM
</span><span style="background-color: #f2f2f2;"> </span>   <span style="background-color: #f2f2f2;"> </span>   activation=<span style="color: #8b2252;">'tanh'</span>,  <span style="color: #b22222;"># </span><span style="color: #b22222;">activaci&#243;n interna
</span><span style="background-color: #f2f2f2;"> </span>   <span style="background-color: #f2f2f2;"> </span>   input_shape=<span style="color: #709870;">(</span>4, 1<span style="color: #709870;">)</span>  <span style="color: #b22222;"># </span><span style="color: #b22222;">(timesteps=4, features=1)
</span><span style="background-color: #f2f2f2;"> </span>   <span style="color: #909183;">)</span>,
<span style="background-color: #f2f2f2;"> </span>   Dense<span style="color: #909183;">(</span>num_classes, activation=<span style="color: #8b2252;">'softmax'</span><span style="color: #909183;">)</span>
<span style="color: #7388d6;">]</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
<div id="outline-container-org8c6df01" class="outline-4">
<h4 id="org8c6df01">Arquitectura de la red</h4>
<div class="outline-text-4" id="text-org8c6df01">
<ul class="org-ul">
<li><b>Capa de entrada</b>:
<ul class="org-ul">
<li>Forma: (4, 1)</li>
<li>4 pasos "temporales" (cada uno con 1 valor), derivados de las 4 características.</li>
</ul></li>

<li><b>Capa LSTM</b>:
<ul class="org-ul">
<li><code>units=16</code>: 16 unidades de memoria.</li>
<li>Procesa la secuencia \((x_1, x_2, x_3, x_4)\) y genera una representación que captura
dependencias entre pasos.</li>
</ul></li>

<li><b>Capa de salida (Dense + softmax)</b>:
<ul class="org-ul">
<li>3 neuronas (una por clase).</li>
<li>Activación softmax para obtener probabilidades.</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org633b9e9" class="outline-3">
<h3 id="org633b9e9">Compilación del modelo</h3>
<div class="outline-text-3" id="text-org633b9e9">
<p>
Escogemos una función de pérdida apropiada para clasificación
multiclase y un optimizador:
</p>

<div class="org-src-container">
<pre class="src src-python">model.<span style="color: #483d8b;">compile</span><span style="color: #707183;">(</span>
<span style="background-color: #f2f2f2;"> </span>   loss=<span style="color: #8b2252;">'categorical_crossentropy'</span>,
<span style="background-color: #f2f2f2;"> </span>   optimizer=tf.keras.optimizers.Adam<span style="color: #7388d6;">(</span>learning_rate=0.001<span style="color: #7388d6;">)</span>,
<span style="background-color: #f2f2f2;"> </span>   metrics=<span style="color: #7388d6;">[</span><span style="color: #8b2252;">'accuracy'</span><span style="color: #7388d6;">]</span>
<span style="color: #707183;">)</span>
</pre>
</div>

<ul class="org-ul">
<li><code>categorical_crossentropy</code>: log-loss multiclase.</li>
<li><b>Adam</b>: optimizador basado en descenso de gradiente con momento y tasas
de aprendizaje adaptativas.</li>
<li>Tasa de aprendizaje inicial \(\eta = 0.001\).</li>
</ul>
</div>
</div>
<div id="outline-container-org5871aca" class="outline-3">
<h3 id="org5871aca">Entrenamiento del modelo LSTM</h3>
<div class="outline-text-3" id="text-org5871aca">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">history</span> = model.fit<span style="color: #707183;">(</span>
<span style="background-color: #f2f2f2;"> </span>   X_train_lstm,
<span style="background-color: #f2f2f2;"> </span>   y_train_cat,
<span style="background-color: #f2f2f2;"> </span>   epochs=200,         <span style="color: #b22222;"># </span><span style="color: #b22222;">n&#250;mero de &#233;pocas
</span><span style="background-color: #f2f2f2;"> </span>   batch_size=16,
<span style="background-color: #f2f2f2;"> </span>   validation_split=0.1,
<span style="background-color: #f2f2f2;"> </span>   verbose=1
<span style="color: #707183;">)</span>
</pre>
</div>

<p>
Durante el entrenamiento:
</p>
</div>
<div id="outline-container-orgf67a0b1" class="outline-4">
<h4 id="orgf67a0b1">Propagación hacia adelante (forward pass)</h4>
<div class="outline-text-4" id="text-orgf67a0b1">
<ul class="org-ul">
<li>Cada muestra de entrada se considera como una secuencia de 4 pasos.</li>
<li>En cada paso, la LSTM actualiza su:
<ul class="org-ul">
<li>estado oculto \(h_t\),</li>
<li>estado de memoria \(c_t\).</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org33f7fe5" class="outline-4">
<h4 id="org33f7fe5">Cálculo del error</h4>
<div class="outline-text-4" id="text-org33f7fe5">
<ul class="org-ul">
<li>La salida softmax se compara con la etiqueta real codificada en one-hot.</li>
<li>Se calcula la pérdida mediante entropía cruzada categórica.</li>
</ul>
</div>
</div>
<div id="outline-container-org6f85fbd" class="outline-4">
<h4 id="org6f85fbd">Backpropagation Through Time (BPTT)</h4>
<div class="outline-text-4" id="text-org6f85fbd">
<ul class="org-ul">
<li>El error se propaga hacia atrás a lo largo del tiempo (sobre los 4 pasos).</li>
<li>Se calculan los gradientes de los pesos de la LSTM y de la capa de salida.</li>
</ul>
</div>
</div>
<div id="outline-container-orgd5fb814" class="outline-4">
<h4 id="orgd5fb814">Descenso de gradiente con Adam</h4>
<div class="outline-text-4" id="text-orgd5fb814">
<ul class="org-ul">
<li>Adam combina Momentum y RMSProp.</li>
<li>Ajusta automáticamente la tasa de aprendizaje para cada parámetro.</li>
<li>Proporciona convergencia rápida y estable.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orga44f5b8" class="outline-3">
<h3 id="orga44f5b8">Evaluación del modelo</h3>
<div class="outline-text-3" id="text-orga44f5b8">
<p>
Una vez entrenado el modelo, se evalúa su desempeño usando datos no
vistos (conjunto de prueba).
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #b22222;"># </span><span style="color: #b22222;">Probabilidades por clase
</span><span style="color: #a0522d;">y_pred_proba</span> = model.predict<span style="color: #707183;">(</span>X_test_lstm<span style="color: #707183;">)</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">Clase predicha = &#237;ndice de la probabilidad m&#225;xima
</span><span style="color: #a0522d;">y_pred</span> = np.argmax<span style="color: #707183;">(</span>y_pred_proba, axis=1<span style="color: #707183;">)</span>

<span style="color: #483d8b;">print</span><span style="color: #707183;">(</span><span style="color: #8b2252;">"Accuracy:"</span>, accuracy_score<span style="color: #7388d6;">(</span>y_test, y_pred<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #483d8b;">print</span><span style="color: #707183;">(</span><span style="color: #8b2252;">"</span><span style="color: #008b8b;">\n</span><span style="color: #8b2252;">Reporte de clasificaci&#243;n:</span><span style="color: #008b8b;">\n</span><span style="color: #8b2252;">"</span><span style="color: #707183;">)</span>
<span style="color: #483d8b;">print</span><span style="color: #707183;">(</span>classification_report<span style="color: #7388d6;">(</span>y_test, y_pred, target_names=iris.target_names<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
<div id="outline-container-orgc6f9d34" class="outline-4">
<h4 id="orgc6f9d34">Métricas utilizadas</h4>
<div class="outline-text-4" id="text-orgc6f9d34">
<ul class="org-ul">
<li><b>Accuracy</b>: proporción total de predicciones correctas.</li>
<li><b>Precision</b>: qué tan confiables son las predicciones positivas.</li>
<li><b>Recall</b>: capacidad del modelo para encontrar todos los ejemplos de una clase.</li>
<li><b>F1-score</b>: balance entre precisión y recall.</li>
</ul>

<p>
En el dataset Iris, el accuracy también suele estar en el rango del
95 % al 100 %.
</p>
</div>
</div>
</div>
<div id="outline-container-orgcadf24e" class="outline-3">
<h3 id="orgcadf24e">Predicción con una nueva flor</h3>
<div class="outline-text-3" id="text-orgcadf24e">
<p>
El modelo entrenado puede utilizarse para predecir nuevas muestras.
Es importante repetir el mismo preprocesamiento: normalización y
reshape para LSTM.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #b22222;"># </span><span style="color: #b22222;">[largo_sepalo, ancho_sepalo, largo_petalo, ancho_petalo]
</span><span style="color: #a0522d;">flor_nueva</span> = np.array<span style="color: #707183;">(</span><span style="color: #7388d6;">[</span><span style="color: #909183;">[</span>5.1, 3.5, 1.4, 0.2<span style="color: #909183;">]</span><span style="color: #7388d6;">]</span><span style="color: #707183;">)</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">1) Normalizaci&#243;n con el mismo scaler del entrenamiento
</span><span style="color: #a0522d;">flor_nueva_scaled</span> = scaler.transform<span style="color: #707183;">(</span>flor_nueva<span style="color: #707183;">)</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">2) Reshape para LSTM: (1, timesteps=4, features=1)
</span><span style="color: #a0522d;">flor_nueva_lstm</span> = flor_nueva_scaled.reshape<span style="color: #707183;">(</span><span style="color: #7388d6;">(</span>1, 4, 1<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">3) Predicci&#243;n
</span><span style="color: #a0522d;">proba</span> = model.predict<span style="color: #707183;">(</span>flor_nueva_lstm<span style="color: #707183;">)</span>
<span style="color: #a0522d;">prediccion</span> = np.argmax<span style="color: #707183;">(</span>proba, axis=1<span style="color: #707183;">)</span>

<span style="color: #483d8b;">print</span><span style="color: #707183;">(</span><span style="color: #8b2252;">"Clase predicha:"</span>, iris.target_names<span style="color: #7388d6;">[</span>prediccion<span style="color: #909183;">[</span>0<span style="color: #909183;">]</span><span style="color: #7388d6;">]</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
Es fundamental aplicar la misma normalización y la misma estructura de
entrada (forma (1, 4, 1)) que se usaron en el entrenamiento.
</p>
</div>
</div>
