readme.org
** Interpretación matemática básica de la LSTM

En una LSTM, en cada paso temporal \(t\) se procesan:

- la entrada \(x_t\),
- el estado oculto anterior \(h_{t-1}\),
- el estado de memoria anterior \(c_{t-1}\).

La LSTM utiliza *puertas* que controlan el flujo de información:

#+begin_latex
\begin{aligned}
f_t &= \sigma(W_f [h_{t-1}, x_t] + b_f) \\
i_t &= \sigma(W_i [h_{t-1}, x_t] + b_i) \\
\tilde{c}_t &= \tanh(W_c [h_{t-1}, x_t] + b_c) \\
c_t &= f_t \odot c_{t-1} + i_t \odot \tilde{c}_t \\
o_t &= \sigma(W_o [h_{t-1}, x_t] + b_o) \\
h_t &= o_t \odot \tanh(c_t)
\end{aligned}
#+end_latex

donde:

- \(\sigma\) es la función sigmoide,
- \(\odot\) denota el producto elemento a elemento.

Al final de la secuencia (tras los 4 pasos), el último estado oculto
\(h_T\) se pasa a la capa densa con función softmax:

#+begin_latex
\text{softmax}(z_i) = \frac{e^{z_i}}{\sum_j e^{z_j}}
#+end_latex

lo que permite interpretar las salidas como probabilidades para cada
clase (Setosa, Versicolor, Virginica).


* Bibliografía  Deep Learning

** Teórica y Académica :MATEMATICAS:FUNDAMENTOS:
Libros diseñados para entender el "porqué" de los algoritmos.

*** Deep Learning
- *Autores:* Ian Goodfellow, Yoshua Bengio y Aaron Courville.
- *Editorial:* MIT Press (2016).
- *Nota:* Considerada la "Biblia" de la IA. Cubre álgebra lineal, probabilidad y arquitecturas complejas.
- *Web:* [[https://www.deeplearningbook.org/][Acceso gratuito a la versión web (HTML)]]

*** Neural Networks and Deep Learning: A Textbook
- *Autor:* Charu C. Aggarwal.
- *Editorial:* Springer (2018).
- *Enfoque:* Muy estructurado para estudiantes de ingeniería y computación.

** Práctica y Programación :PYTHON:PYTORCH:KERAS:
Libros enfocados en la implementación inmediata usando librerías de Python.

*** Deep Learning with Python (3rd Edition)
- *Autor:* François Chollet (Creador de Keras).
- *Editorial:* Manning Publications (2025).
- *Por qué leerlo:* Explicaciones excepcionales sobre la intuición detrás de las redes neuronales.
- *Enlace:* [[https://www.manning.com/books/deep-learning-with-python-third-edition][Página del libro]]

*** Hands-On Machine Learning with Scikit-Learn and PyTorch
- *Autor:* Aurélien Géron.
- *Editorial:* O'Reilly Media (Edición 2025).
- *Enfoque:* Es el manual más completo para pasar de la teoría a la práctica industrial. Cubre desde regresiones simples hasta Transformers.

** Aprendizaje "Desde Cero" :NUMPY:LOGICA:
Ideales para entender cómo funciona el "motor" de una red neuronal sin usar herramientas automáticas.

*** Grokking Deep Learning
- *Autor:* Andrew Trask.
- *Editorial:* Manning Publications.
- *Descripción:* Aprenderás a programar redes neuronales usando solo =NumPy=. Ideal si quieres entender la "caja negra".

*** Neural Networks from Scratch (NNFS)
- *Autores:* Harrison Kinsley (Sentdex) y Daniel Kukieła.
- *Descripción:* Basado en código puro de Python. Muy popular entre autodidactas.
- *Web:* [[https://nnfs.io/][Sitio Oficial de NNFS]]

** Tabla Comparativa para Elección Rápida

| Libro      | Nivel        | Enfoque Principal  | Tecnología           |
|------------+--------------+--------------------+----------------------|
| Goodfellow | Avanzado     | Teoría/Matemáticas | Genérico             |
| Chollet    | Intermedio   | Intuición          | Keras/TensorFlow     |
| Géron      | Todos        | Práctica/Industria | PyTorch/Scikit-Learn |
| Trask      | Principiante | Lógica Interna     | NumPy                |



