index.html
<div id="outline-container-orgfcd1968" class="outline-3">
<h3 id="orgfcd1968">Interpretación matemática básica de la LSTM</h3>
<div class="outline-text-3" id="text-orgfcd1968">
<p>
En una LSTM, en cada paso temporal \(t\) se procesan:
</p>

<ul class="org-ul">
<li>la entrada \(x_t\),</li>
<li>el estado oculto anterior \(h_{t-1}\),</li>
<li>el estado de memoria anterior \(c_{t-1}\).</li>
</ul>

<p>
La LSTM utiliza <b>puertas</b> que controlan el flujo de información:
</p>

<div class="latex" id="orgc1d181d">
\begin{aligned}
f_t &= \sigma(W_f [h_{t-1}, x_t] + b_f) \\
i_t &= \sigma(W_i [h_{t-1}, x_t] + b_i) \\
\tilde{c}_t &= \tanh(W_c [h_{t-1}, x_t] + b_c) \\
c_t &= f_t \odot c_{t-1} + i_t \odot \tilde{c}_t \\
o_t &= \sigma(W_o [h_{t-1}, x_t] + b_o) \\
h_t &= o_t \odot \tanh(c_t)
\end{aligned}

</div>

<p>
donde:
</p>

<ul class="org-ul">
<li>\(\sigma\) es la función sigmoide,</li>
<li>\(\odot\) denota el producto elemento a elemento.</li>
</ul>

<p>
Al final de la secuencia (tras los 4 pasos), el último estado oculto
\(h_T\) se pasa a la capa densa con función softmax:
</p>

<div class="latex" id="org0f0aea0">
<p>
\text{softmax}(z<sub>i</sub>) = \frac{e<sup>z<sub>i</sub></sup>}{&sum;<sub>j</sub> e<sup>z<sub>j</sub></sup>}
</p>

</div>

<p>
lo que permite interpretar las salidas como probabilidades para cada
clase (Setosa, Versicolor, Virginica).
</p>
</div>
</div>
</div>
<div id="outline-container-org8a82987" class="outline-2">
<h2 id="org8a82987">Bibliografía  Deep Learning</h2>
<div class="outline-text-2" id="text-org8a82987">
</div>
<div id="outline-container-org3c076f8" class="outline-3">
<h3 id="org3c076f8">Teórica y Académica&#xa0;&#xa0;&#xa0;<span class="tag"><span class="MATEMATICAS">MATEMATICAS</span>&#xa0;<span class="FUNDAMENTOS">FUNDAMENTOS</span></span></h3>
<div class="outline-text-3" id="text-org3c076f8">
<p>
Libros diseñados para entender el "porqué" de los algoritmos.
</p>
</div>
<div id="outline-container-org1a1484a" class="outline-4">
<h4 id="org1a1484a">Deep Learning</h4>
<div class="outline-text-4" id="text-org1a1484a">
<ul class="org-ul">
<li><b>Autores:</b> Ian Goodfellow, Yoshua Bengio y Aaron Courville.</li>
<li><b>Editorial:</b> MIT Press (2016).</li>
<li><b>Nota:</b> Considerada la "Biblia" de la IA. Cubre álgebra lineal, probabilidad y arquitecturas complejas.</li>
<li><b>Web:</b> <a href="https://www.deeplearningbook.org/">Acceso gratuito a la versión web (HTML)</a></li>
</ul>
</div>
</div>
<div id="outline-container-org654aaee" class="outline-4">
<h4 id="org654aaee">Neural Networks and Deep Learning: A Textbook</h4>
<div class="outline-text-4" id="text-org654aaee">
<ul class="org-ul">
<li><b>Autor:</b> Charu C. Aggarwal.</li>
<li><b>Editorial:</b> Springer (2018).</li>
<li><b>Enfoque:</b> Muy estructurado para estudiantes de ingeniería y computación.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org913b264" class="outline-3">
<h3 id="org913b264">Práctica y Programación&#xa0;&#xa0;&#xa0;<span class="tag"><span class="PYTHON">PYTHON</span>&#xa0;<span class="PYTORCH">PYTORCH</span>&#xa0;<span class="KERAS">KERAS</span></span></h3>
<div class="outline-text-3" id="text-org913b264">
<p>
Libros enfocados en la implementación inmediata usando librerías de Python.
</p>
</div>
<div id="outline-container-org8bb1bdb" class="outline-4">
<h4 id="org8bb1bdb">Deep Learning with Python (3rd Edition)</h4>
<div class="outline-text-4" id="text-org8bb1bdb">
<ul class="org-ul">
<li><b>Autor:</b> François Chollet (Creador de Keras).</li>
<li><b>Editorial:</b> Manning Publications (2025).</li>
<li><b>Por qué leerlo:</b> Explicaciones excepcionales sobre la intuición detrás de las redes neuronales.</li>
<li><b>Enlace:</b> <a href="https://www.manning.com/books/deep-learning-with-python-third-edition">Página del libro</a></li>
</ul>
</div>
</div>
<div id="outline-container-org69f9d04" class="outline-4">
<h4 id="org69f9d04">Hands-On Machine Learning with Scikit-Learn and PyTorch</h4>
<div class="outline-text-4" id="text-org69f9d04">
<ul class="org-ul">
<li><b>Autor:</b> Aurélien Géron.</li>
<li><b>Editorial:</b> O'Reilly Media (Edición 2025).</li>
<li><b>Enfoque:</b> Es el manual más completo para pasar de la teoría a la práctica industrial. Cubre desde regresiones simples hasta Transformers.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgc8123ac" class="outline-3">
<h3 id="orgc8123ac">Aprendizaje "Desde Cero"&#xa0;&#xa0;&#xa0;<span class="tag"><span class="NUMPY">NUMPY</span>&#xa0;<span class="LOGICA">LOGICA</span></span></h3>
<div class="outline-text-3" id="text-orgc8123ac">
<p>
Ideales para entender cómo funciona el "motor" de una red neuronal sin usar herramientas automáticas.
</p>
</div>
<div id="outline-container-org1eefb2e" class="outline-4">
<h4 id="org1eefb2e">Grokking Deep Learning</h4>
<div class="outline-text-4" id="text-org1eefb2e">
<ul class="org-ul">
<li><b>Autor:</b> Andrew Trask.</li>
<li><b>Editorial:</b> Manning Publications.</li>
<li><b>Descripción:</b> Aprenderás a programar redes neuronales usando solo <code>NumPy</code>. Ideal si quieres entender la "caja negra".</li>
</ul>
</div>
</div>
<div id="outline-container-orgdae682c" class="outline-4">
<h4 id="orgdae682c">Neural Networks from Scratch (NNFS)</h4>
<div class="outline-text-4" id="text-orgdae682c">
<ul class="org-ul">
<li><b>Autores:</b> Harrison Kinsley (Sentdex) y Daniel Kukieła.</li>
<li><b>Descripción:</b> Basado en código puro de Python. Muy popular entre autodidactas.</li>
<li><b>Web:</b> <a href="https://nnfs.io/">Sitio Oficial de NNFS</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org590c047" class="outline-3">
<h3 id="org590c047">Tabla Comparativa para Elección Rápida</h3>
<div class="outline-text-3" id="text-org590c047">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Libro</th>
<th scope="col" class="org-left">Nivel</th>
<th scope="col" class="org-left">Enfoque Principal</th>
<th scope="col" class="org-left">Tecnología</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Goodfellow</td>
<td class="org-left">Avanzado</td>
<td class="org-left">Teoría/Matemáticas</td>
<td class="org-left">Genérico</td>
</tr>

<tr>
<td class="org-left">Chollet</td>
<td class="org-left">Intermedio</td>
<td class="org-left">Intuición</td>
<td class="org-left">Keras/TensorFlow</td>
</tr>

<tr>
<td class="org-left">Géron</td>
<td class="org-left">Todos</td>
<td class="org-left">Práctica/Industria</td>
<td class="org-left">PyTorch/Scikit-Learn</td>
</tr>

<tr>
<td class="org-left">Trask</td>
<td class="org-left">Principiante</td>
<td class="org-left">Lógica Interna</td>
<td class="org-left">NumPy</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Autor: Eduardo Alcaraz</p>
<p class="date">Created: 2026-01-20 mar 12:01</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
